[
{"title": "January - a month of gratitude...", "date": "Friday, January 5, 2024", "text": "One of the things I have decided to do on the blog this year is to give each month it's own sub-theme, and that will always be something which will tie in with our main theme for 2024, Joy in the Ordinary. Let's begin the month by turning our hearts away from self, and showing gratitude to others.January is a wonderful month for looking back over the previous year to make decisions about what to eliminate from our lives, and what to give more time to. It is also a good time to remember those who were there for us during the last year and let them know how much that meant to us. From childhood, to well into my forties, it was common to send a thank you card to those who had in some way touched our lives for the better. It was common to write real letters by hand. It was normal to send cards on special occasions. It was natural to make time for all kinds of correspondence that required adding a postage stamp and a walk to the red posting box. And wasn't it so lovely to open our own mail boxes and find a card or letter lovingly sent from family or friends? Being the first week of January I decided that showing gratitude by mail would be a nice way to begin the month, so I have spent time the past few days creating a set of stationary you might like to download, print up, and use for just such a purpose. It's a free gift from me to you!There are two sets to choose from and both are included in your free download - a Scriptural set, as well as one without Biblical reference. In each set you'll find decorative writing paper, small pocket cards to add in a letter, and greeting cards. You could also print up a few and make little gift packs to use as presents during the year. I love things like this because they are easy to post in an envelope and that's rather helpful for those of us who are watching the pennies in 2024. I made gift packs with the small cards, greeting cards and envelopes. Some were printed on white heavy weight paper, and others on some lovely lemon paper from a coloured bundle I bought in 2010. Fortunately I found matching lemon envelopes too. The sprays of watercolour carnations and forget-me-nots which feature on the stationary items, remind me of Nana. Her wedding ring was a band of gold forget-me-nots, and she grew carnations in the summer. When my husband was at University he did some extra work in the semester breaks to save up and buy me my very own gold forget-me-not ring. It was the most beautiful surprise!!When we lived in Esperance (Western Australia) back in 2007-9, Blossom and I would often window shop on sunny afternoons before spending a 'girlie' hour at the local tea rooms which overlooked the ocean. One such afternoon we discovered a pretty blue forget-me-not mug in the window of the jewellers, and it was on clearance. Well, my heart skipped a beat and I bought it. To this day, whenever I use it my mind drifts back to the simple days of my childhood with Nana and Pop. Forget-me-nots really are the perfect floral embellishment to a gratitude card or letter, I think. Life today moves far too quickly, with social media, television, and even conversations rushing by without much thought of their purpose...which makes us forget a little too easily, the things we should hold close to our hearts, the needs of others in our prayers, and how we could better have used that wasted time. Yes, I do believe gratitude and forget-me-nots go hand in hand. Use the links below to download the Gratitude Stationary files... DOWNLOAD the A4 size Gratitude fileDOWNLOAD the Letter size Gratitude fileThe New Year clean has begun...The new year has me cleaning the house, one room at a time, to remove what's not needed and move everything else (not bolted down) around to a more purposeful position. I began at the back of the house in our small laundry, which runs directly off the kitchen and opens out to the backyard. It gets the afternoon sun rather fiercely, and needs a curtain to cover the smaller window, but as I am still not sure what fabric from my stash to use for that purpose, I am yet to achieve that goal. However, it was good to clean and scrub the drawers of cleaning items, rags and gloves with vinegar and water, and put things in order once more.On the other side of the laundry room, I finally went through all the random jars I'd collected and chose to keep only the best jars for filling with jam. It's summer here in Australia and this month is the time for making large batches of plum and vanilla jam (our favourite) to see us through the next year, with a few extra jars as gifts. They were scrubbed exhaustively, dried, and capped ready-and-waiting. The remainder of the space was well scrubbed, and things like the tub of Eco Store washing powder topped up and two teaspoons of eucalyptus oil added and shaken through. Eucalyptus is a wonderful antibacterial for the wash. I clean my washing machine with vinegar and water in a spray bottle so that I can scrub the gasket with only a rag before running the machine on an empty cycle. The next day I began in the kitchen, pulling everything out of the cupboards and off the shelves, again washing with vinegar and water. It was wonderful having all the surfaces, drawers and shelving done, and a few more things removed from them. I tend to declutter regularly through the year, but do not donate anything unless I am very sure we won't be using it, so a few items find their way to the donation box in my car boot each time I do a deep clean of the kitchen. Now I need to wash the front of the cupboards and drawers, clean the windows, wash the curtains, and get the double sink sparkling...but not till Monday. It's Friday afternoon as I write this, and before hubby arrives home from work I plan to make a spanakopita for dinner, and something for dessert - though exactly what I have not yet decided. I hope you are doing well in this first week of a new year, and that should you be struggling in any area of your life that you remember to lay your burdens at the feet of Jesus and pray for His help to get you through. He will always be our Rock and an ever present help in times of trouble. Don't hold back, dear ones, call out to Him for all your needs.But remember too, that He is our provider and gift-giver, so offer your prayers of praise and gratitude to our Lord regularly. God bless, and God willing we shall chat in the next post. Let me know what you've been doing around home this past week, and if you have a specific gratitude to share with myself and other readers. You may inspire us. Oh, before I go, please receive my gratitude for all your prayers for our Blossom. She's still on antibiotics and not yet recovered from the pneumonia, but she is definitely improving. You ladies are wonderful...HugsDon't miss out on any Elefantz news or free patterns. Subscribe to my blog posts HERE and receive them direct to your email inbox.  Or sign up HERE for my free newsletter which often has extra benefits, freebies & tutorials!"},
{"title": "New 2024 free block of the month and the annual tea towel post...", "date": "Sunday, December 31, 2023", "text": "In2024 the theme of my blog will be “finding joy in the ordinary”.Asa homemaker, it is quite easy to allow the everyday matters of life to becomeso routine that they lose a bit of sparkle. Delight in having a floor to mop, ameal to prepare or a bed to make, dulls with each passing year. In its placethe tasks become hum-drum, boring, endless, unimaginative, and may even provokean attitude of bitterness or agitation. Formany years I’ve been writing here about the love I have for my privileged roleas a  homemaker, and how that came aboutthrough the example of my Nana, who lived a very simple ordinary life with manyhardships along the way -  yet she alwaysfound a reason to smile by looking for the joys around her, and that attitude createdan atmosphere of love and gratitude which permeated every nook and cranny of ourvery tiny home. She made it known that Pop and I were her favourite joys, and thereforeeverything she did was done out of love for us. She had a deep respect for Pop,and taught me at a very young age to honour his position in our home. He inreturn adored her, and by extension heaped so much love on me that even today Ished tears thinking of how much I loved that dear little old man. Nana’sexample taught me to honour my own husband one day - to ‘do him good and notharm all the days of her life’ (Proverbs 31:12), a lesson which resonated withme later in life. The more I glance back into my memories of her life, the morenuggets of wisdom rise to the surface, and now I clearly see the many lessonsshe had taught, not in words, in fact rarely in words, but just by beingherself and living an ordinary life in a very simple home with the people sheloved. So,Nana is the sparkle behind this year’s blog theme, and as we traverse themonths ahead, I am praying our homemaker hearts expand with more joy, grace andhope in her honour. Tokick off 2024 I have a brand new, free, block of the month, “Joy in the Ordinary”, which over the course of a year will become a small wall quilt tohang in your home. Each monthly block has a little stitchery encased in a logcabin style border. Todayyou can download Block 1 and each of the remaining blocks will be shared on the1st of the month throughout 2024.  Usethe link below to download the free pattern.DOWNLOAD Block 1 of Joy in the Ordinary BOM Now,what about my annual January Tea Towel post and pattern?! Did you think I’d forgotten?Not at all. Asyou know, the past few months my fingers had moved from stitching to crochetedging on a number of table runners, small doilies, and a pile of new teatowels to carry me through 2024. Oh, how I LOVE replacing all my tea towels inJanuary! The old ones then become cleaning rags – those in good condition arefor use around our home, and those that are stained are given to hubby to usein his shed.  Thisyear’s free tea towel stitchery ties in with the blog theme for 2024… Perhapsyou will crochet an edge on your towel as well? Or you might like to sew some decorativecrochet cotton lace along the edge instead? Iam always asked if I fuse any backing to the tea towel before I embroider, so Ishall answer up front – no. I just weave the thread ends into the stitchesalready made and they have never come away in the wash (yet).  Usethe link below to download my free 2024 tea towel pattern.DOWNLOAD the Joy in the Ordinary Tea Towel pattern FamilyUpdate:Thankyou for all the emails which arrived asking if we were okay, as I had notposted on the blog in a while. Asyou know, Blossom and the children had Influenza A…but then they got Covid overChristmas so we were all isolated and had to resort to a Facetime call to watchthem open presents. It was sad not to be together and have our plans come to nought,but how grateful we are for the technology on hand to still ‘see’ each otherand be entertained by the children! Justwhen they came out of isolation, darling Bloss was diagnosed with pneumonia,and if you’re a long-time reader here you may remember that she gets it almost everyyear. 2023 was particularly difficult health-wise for my girl, andhaving Influenza, then covid, then pneumonia back-to-back without a break hascreated havoc with her immune system. Please pray for her, that the Lord wouldheal her and bless her with a healthy and strong 2024. (thank you xxx)Atour home, I was health compromised too, but it was over quickly and I recoveredwell. On Christmas Day hubby battled with our four pumps to keep water out ofthe house as we were hit with a tremendous storm (we got 7 inches of rain that day), which continued off and onfor days. Two of the four pumps broke on Christmas Day, as well as thedishwasher, and the cold water tap in the kitchen, and the internet. Honestly,all we can do is laugh now…even though we’re still waiting for things to befixed. But praise God we’re all fine here and nothing major happened that cannotbe fixed. In the big scheme of life, these were minor annoyances and nothingmore. I have to say that after only having a dishwasher for five years, it wasa delight to revert back to hand washing again. Standing at the kitchen sinklooking out the window was always very meditative for me, and with soapy rubbergloves and dishwashing cloth in hand, I had many of my aha moments with God. Ialways believed He chose then to speak into my thoughts because I wasn’tdistracted by other things, but present in the very lovely task of washingdishes. Just as Nana did. Now I am wondering if I really want that dishwasher repaired after all.The future...A new year is upon us, dear friends, and I am hopeful that the Lord will allow me to blog regularly, to inspire and encourage your homemaker heart, and to live an ordinary life with JOY for my grandchildren to see and remember when I am gone. If this becomes my last year blogging (we never know what is ahead) then I’d love for it be a good year. And I shall be praying for you too. Godbless you all, and may 2024 be a new season of life which we each approach with HOPE,leaving the past struggles and disruptions behind because we cannot change them.Shake off those feelings which darken your thoughts, and seek out all that isgood, and lovely, and pure and hope-filled. Seek the Lord daily, and if youstill find it hard to be cheerful, ask Him to gently sweep away emotions thatare unproductive (or even harmful). You may still have to work through grief, illness, separations, financial strains (as we are) and other life challenges, but don't allow the weight of these trials to block out the light, darling girl. It is there. His Light is always there to shine a path forward, even if its only one step at a time. May the Lord bless our year ahead as we seek out simple joys in the everyday, very ordinary, matters of life.HugsDon't miss out on any Elefantz news or free patterns. Subscribe to my blog posts HERE and receive them direct to your email inbox.  Or sign up HERE for my free newsletter which often has extra benefits, freebies & tutorials!"},
{"title": "Free Christmas pattern number 5...", "date": "Friday, December 15, 2023", "text": "Today I'm sharing the last of my five free Christmas patterns for 2023 - \"Glory to God\". It's definitely a good pattern for button lovers, but you could also applique the little berries or satin stitch them instead. When I first designed and made \"Glory to God\" back in 2016 I chose to use buttons as I had a lot of pink and red ones that blended so beautifully with the border fabric. The background was made from alternating strips of soft golden green prints, which to my eye gave the whole thing a touch of royalty, and indeed that is what the birth of our Lord Jesus was about. Royalty come to earth as a man to save His people...no wonder the angels sang Glory to God in the Highest! Use the link below to download the free patternDOWNLOAD Glory to God patternThis morning I went to visit Blossom and the children, taking freshly baked cranberry scones and a pineapple fruit cake which I had baked yesterday. It's been raining here for days, and yet walk outside and it's hot (odd thing about the tropics and rain)...so we stayed inside, turned down the air conditioner so we could imagine we were in a cold climate watching the rain, brewed hot cuppas, and feasted on scones and fruit cake. Blossom put a crackling fire on the television (from YouTube) and with that wonderful scene and sound, we chatted, played hangman with the kids, sang songs and really just enjoyed being together. It was such a special morning and as we thought about our Christmas plans we decided to change them. Instead of her, Ross and the children coming for Christmas day brunch, they are coming on Christmas Eve afternoon instead. The children can play in the pool with Ross and Poppy while Blossom and I prepare a Christmas feast for dinner that night. It means a much quieter Christmas morning for them at home the next day, before they head off to Ross's father's place in the afternoon. Usually there's a lot of rushing, stress, time management and weary children when the day is split between two families...so we considered all this and are now excited to have a family Christmas Eve here! She asked if her dad and I would be sad on Christmas Day, but I assured her that would not be so, as just knowing that we had a relaxed evening beforehand with no need for anyone to hurry off, and the children allowed to swim, play and eat until they were exhausted (meaning straight into bed when they got home) - oh how much fun that will be! It's always saddened me hearing of family disputes about where to have Christmas, and at who's place. This season is really about rejoicing in the gift of Jesus, showing love, humility and care for others more than ourselves, putting aside what we want to make another's life easier. I am already bubbling over with happiness at being able to really bless my daughter and her family by giving them the gift of 'time' together with their children on Christmas morning, time without the need to rush off, or have others rush in. May you and yours be especially blessed this Christmas!Love and hugsPS: Here's an oldie but a goodie!!"},
{"title": "Free Christmas pattern number 4...", "date": "Monday, December 11, 2023", "text": "Christmas 'firsts' can be a reason for extra celebration, such as when Blossom had Charlie David in early December 2020, and the joy we experienced welcoming that new wee babe to our clan. This blessed gift from the Lord after a year of challenge with covid lockdowns and restrictions made that Christmas even more special for our whole family. Holding newborn Charlie David in our arms, Blossom and I considered the moment Mary held her own newborn Son, Yeshua (Jesus), in her young arms and the enormity of her heart now overflowing with favour, gratitude and joy for a safe delivery and a promise fulfilled.But Christmas 'firsts' can also be touched with sadness for those who have lost loved ones throughout the year. I believe God's comfort is the only healing balm which can hold a broken heart together during times of celebration, when those around are rejoicing.This Christmas I have two dear friends who lost their mothers during the year, and many others who have asked for prayer in comments and emails, after the loss of their husbands or family members.Let us be mindful of those around us who will struggle in this 'first' Christmas without their loved one, and hold them in prayer. And let us also pray for those who do not know the Lord yet, and have not sought His gentle comfort. I am praying for all of you who have faced loss this year, and asking the Lord to magnify His great comfort and love within your hearts, that you may lift teary eyes to heaven and be able to rejoice also in the gift of Christ our Lord.Use the link below to download this free patternDOWNLOAD Comfort and Joy patternThank you for your prayers for little Charlie David. He is still unwell, as is Cully May now too. When we visited yesterday, I sat holding 7yo Cully May for a long time in my arms as her body burned with fever, and Blossom held her little boy as he struggled to sleep. We have prayed, and glorify God for His hand upon each of their lives, for nothing is allowed without His approval, and sometimes sickness must run its course before the healing is sure. I shall be back in a few days with the 5th free pattern for Christmas 2023. In the meantime we're expecting a lot of rain as Cyclone Jasper edges closer to the coast. There's still uncertainty as to where it will make landfall, but it's unlikely to be close to us. However, it's a slow moving cyclone, and that means it gathers a lot more water, so heavy rains over areas below the cyclone are expected, and that's us.God bless dear ones,Don't miss out on any Elefantz news or free patterns. Subscribe to my blog posts HERE and receive them direct to your email inbox.  Or sign up HERE for my free newsletter which often has extra benefits, freebies & tutorials!"},
{"title": "Free Christmas gift pattern number 3...", "date": "Saturday, December 9, 2023", "text": "With finances tight for many families and singles these days, creating small gifts which can fit inside a card, whether for Christmas or birthdays, means we can still reach out with love to family and friends near or far. The three little gifts included in this one pattern today can be sewn using small scraps of fabric, and embellished with beads, lace, ribbons, tiny buttons - the small bits and bobs we save because they are pretty and we hope to use them one day. Inside this free pattern you will find not just embroidery instructions, but tutorials for making the sweet gifts. The lavender sachet below can be kept under a pillow, in an underwear or nightgown drawer, or hung as I have done from a coat hanger in the closet. The bookmark is a lovely gift to send to an avid reader, and could even be gifted inside a book. Are there some lovely books on your shelf which you will no longer need or read? Consider regifting them with a pretty bookmark, or perhaps you could sew a pretty cover for the book using one of the little embroidery motifs in this pattern set? For many years I would gift Blossom one of my vintage novels every Christmas, and she was thrilled to receive the beautiful works of Jane Austen, Louisa May Alcott and other favourite authors which I had read with her during our homeschooling years. Now they sit on her own shelves, awaiting the day when she can begin reading them to her own daughters. Perhaps you can do something similar with treasured books to be handed down?The gift card is such a cute way to dress up a wrapped present, but is also lovely just as it is because it can be used as another bookmark. One of my projects for 2024 is to make a box of these kind of gift cards, using small fabric pieces such as vintage or recycled linen, lovely cottons, sweet satins and old lace. I'll also make some of the lavender sachets and the bookmarks, because there's nothing more satisfying than to have pretty handmade, useful, gifts on hand to send away in a card. Oh, and I'll also be making cards, something I have planned for the longest of times, but which has not been followed through on thus far.Use the link below to download the free pattern.DOWNLOAD We Three Gifts patternIf you missed the first two free 2023 Christmas gift patterns they are HERE and HERENot a lot has been happening here at home. There's been no rain other than the hour we received a week ago, so the garden is a bit worse for wear. My roses easily scorch on the tips of their petals if I don't pick them first thing in the morning, when still at the budding stage, yet they smell divine and grace my desk with beauty and dignity. Blossom bought me a bunch of sunshine yellow chrysanthemums last weekend and they are still as fresh as ever! That's what I enjoy about mums - they last and last, decorating your home with their presence for weeks. As we need to stay indoors more at this time of year due to the intense heat and humidity, once the housework is done I settle down for a bit of reading and a cuppa. I have all three of Rhonda Hetzel's books, and have read them a few times each, but this little one is brilliant for a condensed read and I have highlighted and made notes all through it - adding more each time I read it. If you haven't got her two large volumes, or don't have finances for them, then let me assure you that this small book is simply marvellous for learning of her journey to a simpler life, the success and freedom she and her husband found, as well as the challenges along the way. Its available here on Amazon AustraliaIt's also available here on Amazon US and I just checked and the Kindle version is only $2.99 at the moment. I am NOT an amazon affiliate, just really love her books and think this little one is a great place to start. Molly-dog is now one year old, and has become our little shadow, no matter where we are. The funny thing about pugs is that they don't look happy, and yet I have found them to be very happy dogs. Molly loves her toys but her favourite is a piece of checked fabric which I tied with a knot in the centre. She was getting into mischief in my sewing room, you see, pouncing on any bits of fabric I dropped...so I thought, \"Aha, you are fabric lover too are you, Missy? Then you shall have your own.\" Since she got her own large piece she has not touched mine. Yay. Many of our sunflowers have gone to seed now, which has brought even more birds to the garden. A gorgeous pair of red-winged parrots visit each afternoon to feast, and they are joy to behold! The cockatoos prefer to eat from the bird feeder, as do the rainbow lorikeets, but these parrots swing back and forth on the sunflowers and have dinner there instead. I have been doing some more crochet edging, but mostly for my older daughters. I'm sending them new crochet-edged tea towels for Christmas (they live in other states far from us) as they both prefer something handmade for gifts. I bought tea towels on sale at Bed, Bath & Table yesterday, in a mix of styles as both girls (and Blossom too) have very different preferences. These are a few I'm working on today...I finished this blue one last night. It only takes an hour and keeps my hands occupied while we listen to a sermon, or teaching on various subjects like gardening in the tropics or health related seminars.I always match the cotton yarn with the print of the tea towel, and leave a few pairs on the table at a time so that even if I only have twenty minutes or so of free time (while dinner is cooking perhaps) I can pick one up and make a start for later in the evening.This is the new runner I'm working on for the top of a chest of drawers in our bedroom. I'll get back to it once all the girl's gifts are made. It's more of the Cath Kidston cotton duck fabric I have had on hand for years. Today is Charlie David's 3rd birthday!!But I am going to ask you to pray for him as he has been ill for a few days - dreadfully high fever, vomiting etc. It has gone through all of Blossom's children, plus Ross (and it was his first week on his new job), but little Charlie got it last of all. So we shan't see him today as he needs rest and healing. Your prayers would be the best birthday gift. ((thank you))Did I ever tell you that the 'David' in his name was for King David? Blossom always knew that if she had a son she'd want him to be a man after God's own heart and that she would have David in his name so that she could teach him all about his namesake and how God was able to use him. (Charlie David pretending to be Nana at her desk - :-)How are YOU?? What's been happening in your life this past week? Is there anything you need prayer for? Just ask. xxxMy love and prayers go out for all of you who read along, knowing that our God hears them and acts on your behalf because He loves you so much. His answers may not always be what we wanted, they may not come as swiftly as we'd hoped, and for a while we might think He is deaf to our needs...but no, He is our Father and He always answers prayers in the way that is best for us because He is outside of time and knows the beginning from the end. So, we must have faith, hold fast to hope, always choosing to live according to God's Word, and remembering we were bought at a great price by the blood of His Son.We have a cyclone on the way, and the Bureau of Meteorology expect it to hit somewhere around our region on Wednesday if it follows their predicted trajectory, however, having lived in this cyclone region for more than fourteen years now, I know that cyclones can change their track at any time, so it may move further north, go south, or decide to make landfall here. For the next few days we'll just watch and prepare 'in case' it comes close to home. Thanks for all the emails asking me about it's proximity to us. I'll update on Monday when I share the fourth free pattern. God bless you all!Don't miss out on any Elefantz news or free patterns. Subscribe to my blog posts HERE and receive them direct to your email inbox.  Or sign up HERE for my free newsletter which often has extra benefits, freebies & tutorials!"},
{"title": "Free Christmas pattern number 2...", "date": "Tuesday, December 5, 2023", "text": "I love making a new pincushion from fabric scraps, especially during a change of season or when beginning a quilt project.Back in 2014 I designed this \"Noel\" pincushion as part of a set of Christmas projects, and at that time I was also designing for some Australian sewing magazines, which sadly have since closed due to the rapid rise of the digital age. Anyhow, at that time I often designed with fabrics and colours that were not really my style but 'hit the brief' for magazines which wanted to show projects in various themes to suit as many different magazine customers as possible. That's why I made the original version of 'Noel' in a very country blue. Now don't get me wrong, I still loved this pinnie! But over the years I've thought about remaking it in fabrics that show my own style...and this weekend I did just that. Naturally, with my current love of crochet edging, I ditched the binding part of my pattern and opted for some lacy, almost gathered in appearance, crochet.The yarn is 4ply crochet cotton, from that op-shop bargain bag I found recently. One of the colours was a perfect match to the vintage Tilda fabric I used as the stitchery/applique background. The floral applique and scissor pocket fabric is from a beautiful old piece of Barefoot Roses by Tanya Whelan, one of my favourite fabrics lines ever. Now, I am no crochet expert, as I have said before, and I cannot do graphs or anything like that to explain how I do an edging, nor do I intend learning - life is to be slowed, not wound up these days - but the best I can describe it is to say that (in UK terms), I blanket stitch the stitches slightly less than a 1/4\" apart...and when I begin the crochet I do a full row all around of double chain (chain in the US).Then, for that nicely gathered look, I crochet into every single stitch of that first row. So I start in a corner and do three trebles (UK) into one stitch on the row below, then a chain (not into a stitch) and  then into the next stitch on the row below I do another three trebles and another chain (also not into a stitch). From there I continue a pattern of one dc, three trebles, one dc, three trebles, into every stitch on the row below. Between each of the dc and three trebles I do a simple chain that does not go into any stitches on the row below. This creates the gathered effect because it's so full. Normally when I crochet my edges I skip a stich on the row below when I do a chain between the dc and the three trebles...but not with this pincushion edging. And that's about as technical as I will ever be with crochet edging. I just use what I have and sometimes fudge the corners a little, but in the end it looks lovely and I am satisfied and quite pleased with the end result. Getting back to my magazine days when I designed to a script a lot of the time, it really stretched me as a designer, and I learned a lot of skills along the way. I only began designing in 2009 at age 50...so I had a lot to learn. But by 2015, I stepped away from the magazines and decided to design for my own pleasure, and that's when my first Stitchery Club began. I learned back then to stay true to myself. And though over the years I dabble in different styles and fabrics, I find myself always returning to my first love - that soft, shabby chic almost, style. Another favourite is old 1930's, and sometimes fabrics with a real vintage look about them catch my eye and inspire a project, but the stream of gentle florals always runs true in the end. I'm not a fan of gaudy or bright prints, and I do not like Christmas fabrics or any novelty prints to be honest. Knowing your personal style is so important. It defines you, and it brings JOY to your work. Don't be concerned about what others (or me!) like...create the way you like, make items that bring a touch of *you* to your home environment. My one concession though, is when I make for others...always be mindful of their style and make things that reflect them and not yourself. :-) You are unique in more ways than you will ever know this side of heaven. Created by the Master's hand, He made you to be just that, YOU. If you make this pincushion, choose the fabrics that make your heart soar. As you decorate your home to celebrate Jesus, do it in such a way that it shows the beautifully unique style the Father impressed upon your mind when you were first made in His image.  Our God CREATES, He did it from the very beginning, and we are made in His image. So we can create too. I prayed every day for two years that He would bless me with a touch of His own creativity. And one day in 2009, that prayer was answered and a gift I'd not previously had, was given. To this day I am still astounded that at age 50 He taught me something new, and He opened doors for me that I could not have opened myself...and He blessed this blog, my writing, and my heart. Today, He still teaches me, corrects me, stretches me beyond what I can do alone, and at time he re-directs my path, tells me when to slow down or lay down certain things, and shines a light on the things that matter most - His Son. He also prods me to write more and more about this beautifully gifted homemaker life, and the high importance it plays in the family, from the days of babies and toddlers, to the latter years of grand-children, rocking chairs, and fewer sunsets at the end of the day. Today my mind is stayed on Him, on the gift of His own Son, on the depth of LOVE for all mankind that brought about a birth, a ministry, a death and a resurrection...all delivered as a gift for you and I who love, obey and believe in Jesus to receive. \"Noel, noel...noel, noel....born is the King of Israel.\"Use the link below to download the pattern.DOWNLOAD Noel Pincushion patternIf you missed the first of my five free 2023 Christmas patterns go HEREGod bless you...Don't miss out on any Elefantz news or free patterns. Subscribe to my blog posts HERE and receive them direct to your email inbox.  Or sign up HERE for my free newsletter which often has extra benefits, freebies & tutorials!"}
][
{"title": "The Ways We Saved this Past Week 1/5/24!  ", "date": "Friday, January 5, 2024", "text": "We bought two garden boxes for $10 each from an ad on Marketplace.  To me they look like shipping boxes and they did have a lid that I didn't want.  Looking forward to gardening season in 6 months.I made a copycat Outback Steakhouse steak seasoning from a free book last week.  We tried it out and it was perfect.  Yeah!  I signed up for the Winter Reading Challenge at the local library. The grand prize is a $50 meijer gift card. So far I've crocheted 5 dish scrubbies for our kitchen and finished embroidering one pillowcase.We went to Traverse City for my Birthday in December -just a short one night getaway.  It was the perfect present.  You can get a motel room for cheap on the off -season.  It was only $67 for a motel in the summer that's close to $300.   We never go north too much in the winter because of the snow but Michigan was snowless at the time. Keep in mind if you do this, attractions will probably be closed.  We had a great walk on the beach looking for rocks but the sand dunes were closed for the season.  Then we had the best fried perch dinner and then went for dessert at Traverse City Pie Company.  The next morning on the way out we stopped at the local Goodwill and another thrift store.  We had the best time just the two of us.Thanks so much for helping to support Vickie's Kitchen and Garden**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here). Be sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."},
{"title": "Happy New Year!  Goals for 2024!", "date": "Monday, January 1, 2024", "text": "It's going to be a great one guys.  We need to stay positive and do the best we can.  At least I'm going to give it a go.  One of the ways I love to look forward to the new year is kind of look back on the old goals to see what I did accomplish and expand from there.So here are my goals this year:  My #1 goal is to be the best wife, mother, grandmother, sister, and aunt I can.Sometimes I fail but I keep trying!  2.  Get healthier, lose weight, and exercise!  Me:  Get back to watching my weight and eating better.  Christmas was so good but bad at the same time.  I need to watch every holiday but between Thanksgiving and Christmas I get out of control.I've said this before and this is true today.  I just don't care around the holidays and I need to care! oh well I'm back on the band wagon and I'm doing fasting again.  So far so good,  I'll let you know my progress. I hope to start walking at the church's track at least two times a week (it's not close).  If the weather isn't bad I'll walk at home. In the summer there is no need to exercise with the amount of gardening we do.3. Create: Sewing/CraftingCrochet enough dish scrubbies for the whole year this month- I think I'll do 15 this year.Finish some embroidery and sewing projects.Start making more Christmas presents.4. Organizing:   I've already started and I'm getting some done!   This 3 tier rolling cart is for my corner, I put it up yesterday (easy), and it fits perfectly.  No more water bottles and other things in the floor. Organize my herb cabinet.  I bought these at a Goodwill for $15.00 when we took a trip up north recently for my birthday.  So far, in one jar I've put in my elderberry.Organize the pots and pans so they won't fall out at me. Last year I bought something to help me but it will only help if you use it.Spring Cleaning one room at a time.   I like to start in January so I'll be done by gardening season.  I hope to buy blinds for our bedroom, the big picture window blind will not work.Have a garage sale in April... I'm not sure about this-I'm still thinking donate and sell on Marketplace.  I ordered a bag from thredup to see if they will buy some of my clothes.  The jury is still out.Start seedlings in the house for this years garden -some in Febuary and some in March.I hope to have a more productive garden this year.  Last year wasn't bad but with the drought we had in July a lot of things didn't do as well.  5.  I love my readers and I hope to keep improving this blog by: Just posting more regular but not everyday.  Twice a week seems to be good for me (I hope it is for you).   I love the comments on my posts too!   If you like Free and low-cost Kindle books I post them throughout the day on my Facebook page here.Thank you all for a great year!  You make me feel so good when you stop by to read my blog!Have you made your goals list for the new year?Thanks so much for helping to support Vickie's Kitchen and Garden**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here).  My thred up link is also a refer a friend link.Be sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."},
{"title": "In the Kitchen:  Learn how to Make Do with half, Using Substitutions, and Making it Instead of Buying!    ", "date": "Friday, December 29, 2023", "text": "I hope you have had a wonderful Christmas (we did) and you enjoy the New Year!  The birds have been taking a long break and all I have in my fridge right now are 3 eggs.  At least one out of four will lay so everyday I come back in the house feeling like I've won a prize.  How did my egg situation get like this?   Well, I decided not to lime my extra eggs this year.  Instead I gave some extra eggs to the neighbors, my daughter, and the rest we used up ourselves (Thanksgiving cooking).  Now, my goal is to depend on my eggs though and not buy any from the store as long as possible.  So, I'm making do and saving up my eggs for recipes I know that will be coming up the next week.  This morning I decided to make egg bites and the recipe calls for 5 eggs. I feel, of course that you need real eggs in eggs bites so I'm going with just making a half of a recipe and use 3. Making half of a recipe is great for when you don't have quite enough ingredients or for a recipe you are just not sure of.  Ingredients are high and to throw a bad recipe away is a killer on your budget.  Of course you want to make sure that you have enough for your family.  My recipe this morning will make enough breakfast for a family of 6 and we have 3 so cutting it in half will be perfect for us.  Actually, one person in our family probably will not eat this breakfast, so we will have some leftovers that I can freeze or use up this coming week.  Some mornings are busy, so looking in the fridge or freezer to find a breakfast already made just feels like a life saver. It can be a big budget saver too...buying take out egg bites just for one person, can be very expensive.Making it:My mind is made up to do this recipe this morning.  You know how you get a recipe in your head and you just have to make it?   Well, of course, I'm missing another ingredient, cottage cheese.  I have milk though and I just printed a make it yourself cottage cheese recipe.  Using Substitutions:Substituting can be great too.  Instead of bacon this recipe I'm going to use some of the leftover ham that we have from Christmas.  Husband will love this! This could be a great way to problem solve if you decide to do a No Spend January.  Learning how to make do and get what you want at the same time is a big part of that whole scenario.  Deprived is one thing you and your family don't want to feel like during that time.Do you plan on a No Spend January this year?Thanks so much for helping to support Vickie's Kitchen and Garden**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here). Be sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."},
{"title": "The Merry Christmas Edition:  Cat presents, Good Deals, and Holiday Food!  ", "date": "Friday, December 22, 2023", "text": "Merry Christmas Edition!  I thought I was all set and then I realized almost forgot the cat's some presents!   Oh man, my cat would be very sad without a present or two or three.  So, I made him two fish (with material I had on hand),  one filled with catnip and the other with crinkley aluminum foil inside.  For some reason I have a jar a catnip in the closet and it came in very handy.  I plan on making a couple more presents (that are no cost) for him that I saw on you tube.Great Deals!  Our best deal this week came from Meijer on Flashfood. A deli block of cheddar cheese for $15.80 (5.25 lbs) and my husband's favorite Krakus deli ham (5.58 lbs) for $22.31 after a $5.00 flash food credit!  Now for the slicing.Dinner!  What's been on the dinner table this week (I took some pics but I couldn't tell you what day):I made a side salad that has come in pretty handy this week.Fish and Chips one day.Breakfast for dinner, scrambled eggs, bacon, fried apples, and toast (I almost forgot to take this pic) yesterday.The rest of the days that I remember were pizza (free with coupon for my birthday) and Spaghetti.  It's been a busy week!  Today will be the grand kids opening presents so we are having some cookies and cheese burgers.The boys disappeared last night watching t.v. and us girls had a sugar cookie decorating and taste testing party.  This morning I'm making No bake cookies  real quick before they come.  Then after the mess was mostly cleaned up, we played cards, old Maid, Slap Jack, and Go Fish.  We had a blast and laughed so hard. I'm sure granddaughter is sleeping very well this morning. I wish you all a Merry Christmas.  How's the holiday preparations going in your home?Thanks so much for helping to support Vickie's Kitchen and Garden**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here). Be sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."},
{"title": "Virtual Book Tour and Review of The Prayer Warrior Plus  a $25 Amazon or B/N Giftcard Giveaway!", "date": "Wednesday, December 20, 2023", "text": "This post is part of a virtual book tour organized by Goddess Fish Promotions.  The authors will be awarding a $25 Amazon or B/N GC to a randomly drawn winner via rafflecopter during the tour. Click on the tour banner to see the rest of the stops and for more entries make sure to comment along the way.The Prayer Warrior by D. Tina Batten and Traci Wooden-CarlisleThereis a thin line between the natural and the spiritual realm.Ms.V., a humble servant of the Lord, has been placed on assignment atCenter of Hope Christian Academy.Byday, she serves as a trusted counselor for students, giving them asafe haven to pour out their innermost feelings while providingprofessional and honest truth wrapped in a firm kindness and lovethat inevitably draws them closer to Jesus. Not to be outdone, thefaculty also bends her ear from time to time.Bynight, Ms. V. enters the spiritual realm and takes her place on thebattlefield as one of God’s faithful prayer warriors. She wieldsher whispering sword, slicing through the enemy’s plans to bind theprecious hearts under her charge.Herassignment’s burden on her physical body is taxing, but can shewithstand the strain and remain victorious?Savingsouls is her true mission, but at what cost?Readersare in for a journey of spiritual intrigue and biblical insight asthey experience the ramifications of each character’s life-alteringdecision.Read a Excerpt:“You’vebeen talking about your relationship with Kevin, and I understandyour struggle, but what have you been talking to Jesus about lately?”Porchbit her lower lip for a moment, a sign Ms. V. had come to understandas Porcha’s way of considering whether or not to exaggerate thetruth.“Ican’t help you if you don’t tell me the truth.” Ms. V. remindedher softly.Porchalet out a deep breath.“Ihaven’t really been talking to Jesus. I mean. I say my prayers inthe morning and before I go to sleep, but He’s gone quiet. I don’thear Him like I used to.” Porcha’s sniffles turned back intosobs.“Sshh,honey calm down. Why does this make you cry so hard?”“Ithink He’s left me. It used to be so easy to talk to Him.”“Ahh.No. God has promised never to leave us nor forsake us, and He has yetto break any of His promises. I am absolutely sure He wouldn’tbegin with you, especially if you’ve been wanting to talk to Him.”“Thenwhy can’t I hear Him?” Porcha asked in a near whine.My Review:Somehow this book scared me.  I know that's silly but the spiritual realm word kind of put me off.   I forced myself into cracking open the book and was greatly surprised.  Ms. V charactor is a loving kind counselor to everyone and was someone I would hope to be like.  She encourages listening to God and talking to him every night about their cares and troubles.Through the stories I've read about real-life circumstances, she encourages people to treat others with kindness, to stand up for what is right, and to revisit what is right in the eyes of God.I'm only on my fifth short story so far but now the book has drawn me in and I can't wait to finish it to see what happens.Author bios:Tina BattenD.“Tina” Batten is a loving mother, wife, sister, daughter and Mimato her grandchildren. She is a gifted visual storyteller who ispassionate about bringing encouraging messages of inspiration andhope to the world.TinaBatten, a writer for over eighteen years of various dramatic works ofperforming art via stage, and film, encompasses uniqueways of creating fascinating story concepts that touch the heart ofmost who view or read her work.She is both honored and thrilled to have teamed up with long-timefriend, sister in the gospel and co-author Tracy on this phenomenalcollaborative book project. With such a humble heart and desire tobring people together in love and unity, Tina Batten will continueher work as a visual storyteller spreadingthe good news of Jesus Christ one project after the other. AsAlways, D. “Tina” Batten gives God All the Glory!Website, IG, TwitterTraciWooden-CarlisleTraciWooden-Carlisle began writing to publish in 2011 and enjoys writingstories that provoke thought and evoke emotions. Her desire is todraw readers into the lives of her characters and share messages ofGod’s love, His faithfulness and peace. The messages in her booksspeak to her way before they speak to her readers.Tracilives in San Diego with her husband, David. When she isn’t writingshe does some light traveling or assists people with their physicalfitness, creates graphics, designs pretty things for her jewelrybusiness and swag for authorWebsite, Goodreads, Facebook: InstagramGiveaway!  TraciWooden-Carlisle and D. Tina Batten will be awarding $25 Amazon orBarnes and Noble GC to a randomly drawn winner via rafflecopterduring the tour.  a Rafflecopter giveawayMany thanks to Goddess Fish Promotions for providing a sample of the product for this review. Opinions are 100% my own.**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here).  Thanks so much for helping to support Vickie's Kitchen and GardenBe sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."},
{"title": "Snow for Christmas? , Good deals, and Our Menu for this Past Week!   ", "date": "Friday, December 15, 2023", "text": "With our weather in our area being warmer than normal, it was kind of neat to find a spring dandelion in the yard.  Husband is loving this weather but I want a little snow for Christmas.  Just feels a lot more like Christmas with snow.  It can leave after that.Good deals:I've ran to Meijers a couple of times this past week to get their Daily Deals.  One was for a gift and the other was for our household.  Sometimes the good deals can be used for us!  Thursday night I bought this sheet set for $22.50!  It has a 500 thread count and deep pockets on the sides.  Perfect!  I used the santa bucks coupon and the coupon for the sheets (1/2 off).  Both of them are mperks and for that day only.  Husband bought some filters for the car for half price too.  What we have had for dinner so far this week:Sunday:   Homemade loaded with everything Low Carb pizzaMonday:  Rosemary and Thyme Baked Chicken and baked sweet potatoes.Tuesday  Chili made from the hamburger we found on sale at Gordon's at $2.37 a pound this week.  You know I love getting a sale but buying it is half of the job, that putting up and freezing part is work!  Wednesday: we had enough of the baked chicken left that I made  quesadillas.  I used some green onions that were still growing in the garden and some of my homemade canned salsa to make it.  I found this recipe in a book that was free that I posted on Facebook, Homey TGI Fridays Copycat Recipes: Comfort Meals for You, Family, and Friends (unfornately it is no longer free).   I think that's the only recipe out of the book that I will use but that is just me.                                                    Thursday, we had hamburger steak, mashed potatoes, and  collard greens.  It was our first time having collard greens and they were good!  We had run out of steak sauce for the hamburger steak so I used some soy sauce and garlic powder.  They fell apart more and it wasn't as good but we ate it anyway. What I have planned in my head for the rest of the week:Friday:  Hot dogs (something easy in the hopes of finding an estate sale to go to)Saturday:  Ham and cheese omelettes and toast (I'm saving all my eggs for this day -some of those hens are taking a break).How is it been going at your house?Thanks so much for helping to support Vickie's Kitchen and Garden**As a Amazon affiliate I earn a small percentage when you purchase items from one of my links (the item doesn't have to be what I have linked here). Be sure to follow me on Facebook,and Bloglovin where I share my frugal list, gardening, recipes, Free Kindle books, and more!  You can also sign up for my email list on the top right hand side of the blog."}
]