[
{"title": "The Gift of Thrift", "date": "Monday 9 October 2023", "text": "Start with something simple. We've got the verb give, which we all know, and the thing that you give is a gift. They're quite obviously related. This is Not Interesting.Then you've got people who use the word gift as a verb, as in \"I gifted it to him.\" That's a bit odd because it's verb to noun to verb again. But it's still pretty obvious.Then you have the verb drive. And when the wind drives the snow into a pile that is a snowdrift, because the thing you drive is a drift. And when the wind and the waves drive a ship from its course, that movement is called the drift.And then the noun drift can get turned into a verb and the boat starts drifting. It is the gift that keeps gifting.And then you've got the verb thrive, meaning to prosper, flourish and generally quomodocunquize. And from that you get the noun thrift, but only because thrift used to mean wealth. Then its meaning wandered until it meant savings, and then the foolish habit of saving money, which is thrifty.(I should point out that I always save all my money for a rainy day, but I live in England, so my savings don't last long.)But that's why we still have spendthrift meaning someone who spends all their fortune.And then you have sieve and sift, which has also been re-verbed to mean exactly the same thing. And just as gift relates to given and drift to driven, so rift relates to riven (although the connection there is much further back in the Norse). And even swift is related to swivel. The verb in between was swive/swifan which just meant to move. But then it became the standard medieval term for to have sex with, as in:'For John,' said he, 'als ever moot I thrive, If that I may, yon wenche will I swive.Swive was a bit rude, even then, and has since vanished, but swift and swivel remain. It's a bit like how true relates to truth, just as rue relates to ruth. Ruth is the opposite of ruthless. But we don't use ruth anymore, largely because Milton used it in the line:Look homeward angel now, and melt with ruthAnd that's so beautiful that nobody will ever better it; even though, to modern ears, it sounds like an invitation from a woman with a raclette*. That's it. That's what I was driving at, if you catch my drift.A bit rude*Ruth's cooking is very interesting, partially because she uses alien corn."},
{"title": "Today is Mayday", "date": "Thursday 11 May 2023", "text": "Today is the first of May, or that's what Shakespeare thought, as did all proper Englishmen. May, for him, ran from May 11th to June 10th. The reason for this is reasonably simple. Ancient folk noticed that there were 365 days in a year. This allowed for calendars etc. Life was simple.Then Ancient Romans noticed that this wasn't quite right. In fact, there were 365 and a quarter days in a year. That's how long it takes for the earth to go round the sun once.So Julius Caesar decreed that everyone should have a new calendar with an extra day every four years. This is pretty familiar stuff: it's February 29th, a leap year.Because the calendar was decreed by Julius, it got called the Julian Calendar. Life was simple again for a millennium and a half.Then Renaissance Italians noticed that, in fact, a year was 365 and just less than a quarter days. This upset them terribly. The reason they were so terribly upset was that religious festivals. Christmas is meant to happen on the exact anniversary of Christ's birth. The same went Epiphany and Assumption and Annunciation, not to mention all the Saints' Days. Th dating of Easter was also terribly complicated, but terribly important.The Renaissance Italians realised that they had been celebrating everything on the Wrong Day. That's because the day-calendar had been slipping out of sync with the solar-calendar. Not by much, mind you. Only by one day every century and a half. But as this had been going on for a millennium and a half, it meant that everything was wrong by ten days. So Pope Gregory decreed a new calendar where a leap day is missed out every century or so. And he also decreed that we had to get everything back to it's proper anniversary. So on October the 4th 1582, he announced that tomorrow would be October the 15th.Thus all of Catholic Europe moved forward ten days, and called the new system the Gregorian Calendar.But England was Protestant, and we were very suspicious. We decided that all this looked very like a dastardly Catholic plot and that we weren't going to fall for it, and Brexit meant Brexit, and we were quite happy with the old system, thank you very much.So you had the odd situation of a ten day gap between England and Europe. When, it was May 1st in Dover, it was May 11th in Calais, even though France is (alas) only 26 miles away. This had all sorts of odd effects. One is the belief that Shakespeare and Cervantes died on the same day. In a way they did. They both died on April 23rd 1616. It's just that that wasn't the same day. April 23rd was really May 3rd, or perhaps the other way around.It does mean, though that Shakespeare's May was a lot merrier than ours. It skipped out early May, which is cold, and added in early June. If you are in England now, you'll notice that trees are much leafier than that they were ten days ago. So all his references to sun and flowers and darling buds of May, are a little bit off.It also means that Chaucer's April was a lot more springlike that our is, and that December was a lot colder, because it contained what we'd call early January (which is when Christmas was).This whole amusing situation lasted until 1752, when Britain finally capitulated and joined the Gregorian Catholics. That in turn really pissed off our colonists in North America, and caused the American revolution.Well, not quite. But it was a small contributing factor. America was a lot more puritan and anti-catholic that Britain was. So if you were a Puritan farmer in Massachusetts, and you were already annoyed about being ruled by people thousands of miles away, forcing silly laws on you without so much as a 'by your leave', then it didn't help. And it was, for years, a contentious bone.And the Russian Orthodox Church is still on the Julian calendar, which is why they have their Christmas in what we call January. This even caused some kerfuffle in Ukraine, with people undecided about whether to use the Western date or the Russian (boo!) one.Midsummer Night's Dream actually takes place on the night of April 30/May 1st. When Theseus finds the young lovers he says:No doubt they rose up early to observeThe rite of May, and hearing our intent,Came here in grace of our solemnity.And today is the day. Today is Mayday. And the distress call MAYDAY! MAYDAY! MAYDAY! is just the French way of saying 'Help me!'M'AIDEZ! M'AIDEZ! M'AIDEZ!The Inky Fool responds to the fuel crisis.P.S. Obviously this could all have been solved if we'd just used Stone Henge, which marks the solar year. So, really, the English were right all along."},
{"title": "The Illustrated Etymologicon", "date": "Monday 8 November 2021", "text": "It is of immense importance to absolutely everyone that The Illustrated Etymologicon is now published, out, in the shops, for sale, and begging to be bought. It's the same text as the original Etymologicon, but now filled, on each and every page, with delicious illustrations. Is is therefore illustrious.Illustrious and illustration both come from the Latin illustratus which meant lit up. In English the word illustration came first, and it meant to teach by means of examples, shedding light upon an abstract subject. The Illustrated Etymologicon is therefore both illuminating and illuminated, enlightening and enlightened. It is, if you like, an illuminated manuscript. The book is available in most English speaking territories, and in the lost former colony of the USA it can still be obtained by ordering it from The Book Depository.Incidentally, the mini in miniature has nothing whatsoever to do with the mini in minute or minimum or miniskirt. In Medieval illuminated manuscripts there were little pictures painted by little monks. These pictures were often painted using red lead or minium. Because of that the verb for painting little pictures was miniare. And because of that the little pictures were called miniatures. The word then got applied to anything small. Anyhow, all your Christmas presents are going to be this:"},
{"title": "Epistrophe", "date": "Tuesday 19 October 2021", "text": "I've done another little video essay with the splendid people at Little White Lies. It's about the rhetorical trope of epistrophe. And, just to end every blogpost with the same words, The Illustrated Etymologicon is coming out in November."},
{"title": "Pancallistic", "date": "Sunday 17 October 2021", "text": "Pancallism is the belief that everything is beautiful, or at least everything that exists, which is quite a lot of things. The idea, occurred to some medieval scholastic philosophers. Their reasoning went roughly like this. God exists. Existence is one of the features of God. All the features of God are beautiful. Hence existence is a kind of beauty.I exist. Therefore, I must be beautiful. This is the sort of positive thinking that makes Medieval philosophy such fun; I expect it's also an extremely effective argument to put on your internet dating profile. I came across the word pancallistic (the adjective) while reading Art and Beauty in the Middle Ages by Umberto Eco. The book's a little dry, but it's beautifully short. The etymology, by the way is Greek. Pan means everything, as in a pandemic which is a disease that has spread to all the people. The demic there is the same as democracy, which is government by the people. The callism bit comes from kalos, which meant beautiful and is the same root that you get when looking a pretty things in a kaleidoscope, or admiring somebody who is callipygian.Since you ask, callipygian means possessing a beautiful bottom, and is also a very useful word to use on your internet dating profile, I expect.The Inky Fool discussing Medieval aesthetics. P.S. Another thing that exists and is beautiful is The Illustrated Etymologicon, which will be released on November the fourth."},
{"title": "Flying Saucers, Pelicans, Prisons and Albatrosses", "date": "Thursday 24 June 2021", "text": "Today is, of course, the 74th anniversary of the Kenneth Arnold UFO sighting. The event is celebrated by lexicographers everywhere because it gave the English language two new terms: flying saucer and pelicanist.Kenneth Arnold was a businessman and aviator who, on June 24th 1947, saw nine thingummybobs flying past Mount Ranier in Washington State at over a thousand miles an hour. Or, he says he saw them. This blog post will not answer the great question as to whether extraterrestrial life visits earth, because, though I know the answer, I'm not telling.The question as to who first called these thingummybobs flying saucers is rather vexed. Kenneth Arnold says that he didn't use the term, that he only said that the motion of their flight resembled a saucer being skipped across the surface of a lake. However, there was a journalist who insisted that Arnold said the objects looked like saucers, and the term could have been invented by any of a hundred headline writers who wrote about the Great Event.(Incidentally, I have skipped a lot of stones across lakes, but never a saucer. I've never even heard of somebody skipping a saucer across a lake, and can only dream of having that much redundant crockery. We all need a dream.)However it happened, and whoever said what, the term flying saucer came into being as a result of this event 74 years ago today. Of course, there were naysayers. There were those who said that the flying saucers were, in fact, clouds, or very distant mountain tops, or very near drops of water on the windows of Mr Arnold's own aircraft, or pelicans.The pelican theory is curious. Pelicans are large birds. Their wingspans can be over three metres (ten feet). But they don't really resemble saucers and they don't fly at over a thousand miles an hour unless they're in the most terrible hurry.The pelican theory is a bit silly. It attempts to explain away a not-that-believable story with an even less likely one. It would be a lot simpler to suggest that Mr Arnold imagined the whole thing. The pelicans are unlikely, and if I have learned anything in this life, it is that one should never rely on an unlikely pelican.So silly is the pelican idea, that flying saucer enthusiasts coined the term pelicanist for those who would explain away all sightings with unlikely substitutes. By extension the word can be used for anybody who proposes a preposterous but naturalistic explanation for an inexplicable event.(Incidentally, and without wanting to sidetrack myself, there's a lot of pelicanism when it comes to Shakespeare. The (idiotic) theory that William Shakespeare did not write Shakespeare often runs something along the lines of \"no man could never have written something so wonderful, that's simply not believable; so it must have been written by someone else\").Anyway, there are a lot of pelicans on the west coast of America. When the Spanish conquistadors arrived in the bay of St Francis they found an island absolutely covered with them. So they named it Pelican Island. Except being Spaniards they did it all in Spanish. And that's why San Francisco bay contains the island of Alcatraz, because alcatraz is just Spanish for pelican. It comes from the Arabic al ghattas meaning sea-eagle.The English used to use the word alcatras, largely because pelicans aren't native to Britain so we might as well use the Spanish word. However, we never seemed to be entirely sure what an alcatras was. The OED lists alcatras as an English word, or at least a word used by the English, but one of the definitions is \"Perhaps: an albatross\".This makes perfect sense because albatross is simply an alternative way of pronouncing alcatraz. Pelicans and albatrosses are both huge nautical birds, and could quite forgivably be mistaken for each other. This means that they are unidentified flying objects.Of course, the albatross/alcatraz/alcatras has earned an immortal place in English literature:A gorgeous bird is the pelican,Whose beak will hold more than his bellican.He can put in his beakFood enough for a week.But I’m damned if I see how in hellecan.The Inky Fool was in a terrible hurryP.S. The proximate cause of this post was The Times Crossword on Tuesday. The clue for 1 across was:1 Pelican that's not more, unfortunately right after feline enters (8)right after feline = cat rthat enters the word alas, which means unfortunately.You get al-catr-asWhich is an obsolete synonym for pelican."},
{"title": "The Etymological Week", "date": "Friday 14 May 2021", "text": "The week is a curious thing: the division of our lives into a revolving, unfinishing cycles of seven days. Especially as seven days bears no relation to anything at all. Some people, rather foolishly, think that seven days is a quarter of the lunar cycle: seven days from new moon to half full, another week to full, another week waning to half, and another week until it disappears. But there's a problem. This system is two days out. Four weeks is 28 days, and a lunar cycle lasts 30 days.This means that the two systems go out of sync very quickly, and after only seven months they are as far as could possibly be. Time is a useful thing, because we use it. If I lend you some money and want it back after seven moons, we need to both agree on what that means. If one of us is counting 28 weeks and the other is watching the sky, there is liable to be a fight. Anyhow, I've been reading The Week: An essay on the origin and development of the seven-day cycle by F.H. Colson. It has been something of a revelation.The week began with the Jews. Efforts to backdate it to Babylon are implausible, largely for the reasons given above. Whatever you may think of the first chapter of the book of Genesis (and opinions, I'm told, vary), the Jews had been resting every seventh day since at least the first half of the first millennium BC. And the Romans thought this was amazing, and weird and crazy.The Romans looked at the Jews rather in the way that some modern Westerners look at Tibet or India. The Jews were eastern and mysterious and they had this mysterious ancient religion, which was really ancient, and probably contained some really profound kind of ancient wisdom that was really ancient.So just as rich bored Londoners can suddenly get really keen on some ancient Tibetan practice as a bit of a fad, so the rich bored Roman could bore everybody at the dinner party about how he had taken up resting on the seventh day, and it had really grounded him, and you should try it yourself, because those Jews are just so, so ancient. And did you know they don't have statues of their god because it's a really spiritual religion?Juvenal made fun of such people in his 14th Satire, although his main target was idle people who do things just because they're fashionable, and then get Much Too Into It. You start with the faddish Sabbath and the new-fangled seven-day week, and the you get carried away, and so do your children.Some who have had a father who reveres the Sabbath, worship nothing but the clouds, and the divinity of the heavens, and see no difference between eating swine's flesh, from which their father abstained, and that of man; and in time they take to circumcision. Having been wont to flout the laws of Rome, they learn and practise and revere the Jewish law, and all that Moses committed to his secret tome, forbidding to point out the way to any not worshipping the same rites, and conducting none but the circumcised to the desired fountain. For all which the father was to blame, who gave up every seventh day to idleness, keeping it apart from all the concerns of life.Resting every seven days is a gateway drug.The important thing here is that the seven-day week spread through the Roman Empire before Christianity did. The Christians existed at the time, but they were still a tiny little sect. The Romans were still basically interested in pagan gods and astrology.The Romans loved astrology and did everything according to the Seven Planets, which wandered across the sky. So far as the Roman were concerned there were the Fixed Stars (all those ones in the background that never move in relation to each other), and then there were seven things visible with the naked eye that wandered around. They were the moon, Mercury, Venus, the sun, Mars, Jupiter and Saturn. These were wandering stars and in Latin each one was a stella errans, but the Greeks were still around and still speaking Greek and the Greek for wanderers is planetes. Hence planet, which just means wanderer.Pluto may not be a planet, but the sun is. So you've got the seven day week and seven planets so of course you put them together. Saturnday, Sunday, Moonday etc. That way you could have an Astrological Week, and if you were planning to start a war or fall in love you could find the Right Day To Do It. The full Latin week went like this:Sunday = dies Solis = Sun/solar = ApolloMonday = dies Lunae = Moon/lunar = changeable Tuesday = dies Martis = Mars/Martian = God of War = martial as in court martialWednesday = dies Mercurii = Mercury = mercurial, ephemeralThursday = dies Iovis = Jove/Jupiter = jovialFriday = dies Veneris = Venus goddess of love = to venerate of love something/venereal diseaseSaturday = dies Saturni = Saturn = unlucky/miserable/saturnineThe Romans loved their astrological week and even tried to apply it retrospectively to the Jews, who obviously didn't do anything on Saturday because Saturn was unlucky. You can still see the Tuesday to Friday gods in French and SpanishMardi Martes MarsMercredi Miercoles MercuryJeudi Jueves JoveVendredi Viernes VenusAnd, weirdly enough, all the Roman names survive in Welsh: Dydd-sull, -llun, -marwth, -mercher, -iou, -gwener, -sadwrn.When the Christians came along they obviously tried to Christianise things. Saturday was the sabbath and Sunday was the Lord's Day, thus the Spanish Sabado and Domingo. But the week spread much faster than Christianity did. It arrived in Northern Europe while they were still pagan. That's why in English (and German) the days were passed over to equivalent pagan gods. Mars was identified with the Germanic god Tyw (who's actually etymologically related to Zeus and Jove), hence Tuesday.Mercury was identified with Wodin (whom you've heard of from the Vikings) hence Wednesday.Thor and Jupiter were both Thunder-Gods, so Jove's Day became Thor's Day/Thursday in English. But in German they're more direct and just call it Donnerstag, which literally means Thunder Day. (That's the same Donner that you get in the reindeer names Donner and Blitzen, which mean thunder and lightning, which is why the German army's tactic of lightning warfare, was called the blitzkrieg, or just the blitz, which I like to think of as London being attacked by flying reindeer.)Venus was identified with the female goddess Frigg, hence Friday.The Northern Europeans didn't use the planets because they weren't into astrology, because it's much too cloudy round these parts. In England you can detect the sun occasionally, in Wales never. The other planets might as well not exist.But the week was just popular. It spread northward even without planets to pull it there. It is strange to think that there is no seven-day week in Homer, nor in any of the Greek dramatists; and strange to think that this arbitrary seven day cycle has been running without pause for at least two and half thousand years, probably much longer. It is also strange to think that two thousand years ago people thought that there was a correct day of the week to be in love, as though from Saturday to Thursday you might be quite icy and indifferent and then suddenly perk up on the day of Venus. We moderns would never, ever have such a silly idea."}
]