[
{"title": "The Changing Spaces of Reading and Writing", "date": null, "text": "Innovations in technology have changed the way in which society acts. As classical scholar and university librarian James O’Donnell points out in the 1999 radio broadcast “From Papyrus to Cyberspace,” one generation’s frontier becomes the next generation’s reality. One can assume that with each new frontier there are gains and losses. For example, the invention of the automobile sparked a transportation revolution, but with this improved accessibility we also implicitly accept thousands of car-related deaths each year. Advancements in writing technologies have unpredictable changes in human roles and geography. Printing presses led to the spread of unorthodox ideas across the world and new forms of democratization, while the shift from a primarily oral to literate society brought with it new lines of exclusion between those who could read and those who could not.James Engell, Professor of English and Comparative Literature at Harvard, highlights the point that such revolutions of technology do not occur suddenly but are instead a gradual shift within societies. Just as manuscripts continued to be produced well after the invention of the printing press, it is common for information from the internet to be written down on paper. Thus the challenge with emerging digital technologies is not that such societal shifts are occurring, but finding the most effective way new technologies can be integrated with the way things are currently functioning. Learn more about the impact of the typewriter on literacy in my short documentary The Shift from Handwriting to Typewriting:Full List of References and Media Content SourcesThe shift from handwriting to digital text and their associated issues continue to plague educators as one-to-one devices become the norm in schools. My English Department meetings often consist of heated debates concerning whether students should complete their coursework on paper or digitally. The topic seems to polarise the teachers within the department and we cannot collectively decide on the \"correct\" answer.\"students who write out their notes on paper may actually learn more\" (Mueller & Oppenheiner, 2014).In 2012, scientists find that the brains of preliterate kids respond like a reader's brain when they write their ABCs, but not when they type or trace the letters (Pauly, 2016). Another research team reports that college students who transcribed lectures on their laptops recalled more information than those who took notes by hand because the use of laptops results in shallower processing (Mueller & Oppenheimer, 2014). Across three experiments, researchers had students take notes in a classroom setting and then tested students on their memory for factual detail, their conceptual understanding of the material, and their ability to synthesize and generalize the information. The two types of note-takers performed equally well on questions that involved recalling facts, laptop note-takers performed significantly worse on the conceptual questions (Mueller & Oppenheimer, 2014). This research suggests that perhaps completing tasks on paper may be more beneficial for students.However, sometimes the purpose of note taking is simply to collect information. During novel studies I often have my students take notes to record key quotations or details from the book we are reading under the categories of the elements of fiction (e.g. setting, characters, style, theme). When forced to write on paper, I find students’ notes quickly become disorganised and chaotic. Factor in that a novel study last several weeks - sometimes months - I find students’ paper notes become more of a hassle than helpful.Instead of making the paper-or-digital choice for my high school students, I share research findings and we collaboratively discuss the benefits and advantages of each format. I then prompt them to make the choice for themselves and give them the opportunity to change formats if they feel they made the wrong choice. In Benedict Carey's book \"How We Learn: The Surprising Truth About When, Where and Why It Happens\" he refocusses attention away from a mono-solution to the learning conundrum, by prompting learners to consider the task at hand:  \"It's not that there is a right and wrong way to learn. It's that there are different strategies, each uniquely suited to capturing a particular type of information. A good hunter tailors the trap to the prey\" (Carey, 2014, p. 44). My vision for my students is for them to discover for themselves how they work best in a time where they are living and learning during this technological revolution. The following is a lesson to prompt a discussion surrounding the ambiguity of the paper of digital argument:While reading and writing remains at the heart of education, emerging technologies will continue to alter the concept of literacy itself. As we continue to move from written text to digitized information, educators must adapt their didactic methods to coincide with modern technologies. The technologies of handwriting and typewriting need not exist in a binary relationship in our postmodernist culture. They can co-exist, offering us a multiplicity of ways to communicate where each is geared for its own different purpose.ReferencesMueller, P. A. & Oppenheimer, D. M. (2014). The Pen Is Mightier Than the Keyboard: Advantages of Longhand Over Laptop Note Taking. Psychological Science, 25(6). O'Donnell, J. & Engell, J. (1999). \"From papyrus to cyberspace\" [radio broadcasts]. Cambridge Forum.Ong, W. J. (1982). Orality and literacy: The technologizing of the word. London: Methuen.Pauly, M. (2016). A Brief History of Handwriting. Mother Jones, 41(5), 60.The Information Processing Theory is an approach to cognitive development that suggests a way in which humans process the information they receive. This theory contrasts a behaviourist that humans simply respond to stimuli. This theory suggests that information is processed in stages, much like the way in which a computer processes data (Orey 2002). Information enters the brain (or computer) through our senses (mouse/keyboard). Next, the information is processed in our working memory (processor/ram), where it is stored and recalled from specific areas of our long-term memory (hard drive). This recalled information can lead to an output response to the stimuli (monitor).Turple, C. (2016).Our sensory memory intakes information through seeing, hearing, smelling, tasting and touching. If we decide to pay attention to certain stimuli, it moves into our short-term memory, also known as our working memory as it is the place where we process information. In order for information to be stored in our long-term memory and formally learned, the information must be elaborated on through rehearsal to consolidate the new data.Turple, C. (2016). Adapted from: Lutz, S. & Huitt, W. (2003).We can then organize new information into existing knowledge sets (if information is similar to prior information) or create a completely new knowledge structure if the new information is unlike anything we have experienced before. Once information is stored in our long-term memory, we can later recall this knowledge back into our working memory to compare to incoming information or help elaborate on our knowledge experiences.Many of these operations involve executive function to pay attention to new information, attend to rehearsal practices in the working memory and help consolidate information into our long-term memory. Unfortunately, new information can be lost at all stages of information processing.  If incoming stimulus is not paid attention to in our sensory memory, our brain does not notice the information. In our short-term memory, only a maximum of five stimulus can be used at once - if this information is not encoded within 15-30 seconds it will be lost altogether. In long-term memory retrieval, there are also chances of encoding failure during information consolidation if elaboration does not occur or the information cannot be properly organized in existing knowledge structures. Finally, information in long-term memory could be lost through a retrieval failure or “overridden” if new information contradicts something previously learned.Watch my visual breakdown of the stages of the theory and applications to classroom practice:When considering the stages of the Information Processing Theory, there are 5 easy steps teachers can take to support students in the acquisition of new information.RECEPTION to ensure teachers gain students’ attention using an abrupt stimulus change to focus students’ sensory memory on the lesson. I like to use music or short video clips to gain students’ attention. Catchy songs such as this Information Literacy Song or the Literary Devices Rap work well.RETRIEVAL educators should stimulate recall of prior learning and skills from students’ long-term memory into their working memory. I like to use kinesthetic warmups that gets the students moving around and talking to peers other than their elbow partner. Simple activities work great such as having the students move around the room and when the music stops (often I use the songs above), I yell out a number. Students must form a group with that many people and answer a question about the content from the previous lesson. Scholastics's Mind Up Curriculum books are full of such activities.RECEIVE information transmitted by the teacher that should have distinctive features and suggest a meaningful organization of ideas for students. I started “branding” my lessons by using the same template and colour scheme for all lesson within a unit. For other skills such as the MYP Approaches to Learning, I always use the same cover slide. I have also started using less unconnected slides and utilising animations to put together the “pieces” of a slide. Finally, acronyms and step-by-step procedures have become the focus of my lessons. For example, when I was teaching my students about how to find reliable online sources, I began the lesson by playing the research song, played the kinesthetics warmup game, then introduce an acronym to help them remember the criteria for reliable websites:RESPOND or experience the information for themselves to absorb knowledge into their preexisting knowledge sets by eliciting performance from students. Arguably the most important step in student learning! Students need to immediately do something with their new knowledge. When introducing the CRAP acronym for determining reliable resources, I had students decide whether example websites are reliable or not. One issue I often run into for this stage is running out of time when I have 30 minute class time blocks. What I have come to learn is it is better to break up the learning into smaller pieces where students have the opportunity to immediately respond to new knowledge, rather than using a whole block to introduce content and the following block as a work period. REINFORCE by providing ongoing feedback to students and especially give them additional performance opportunities to apply the feedback. Encouraging students to make mistakes and learn from those “failures” is key. I try to give as many opportunities for students to experiment with new ideas by offering several chances to practice new skills. I aim to give my students individual verbal feedback once a week and written feedback every other week. Since I utilise Google for Education Apps Suite in my teaching, this is often done through the comments function. I have learned to create one ongoing template my students work in throughout a unit so all of my comments and their work is in one place. This way, it is easy for both myself and students to see their ongoing progress.Turple, C. (2016).More than anything, learning about the Information Processing Theory reminded me of the importance of lesson warm-ups and \"hooking\" students into a learning activity. The theory also offers a simple explanation of how memory may work and is something I have even taught my students to make them more away of their own learning behaviours. ReferencesLutz, S., & Huitt, W. (2003). Information processing and memory: Theory and applications. Educational Psychology Interactive. Valdosta, GA: Valdosta State University. Retrieved from http://www.edpsycinteractive.org/papers/infoproc.pdfOrey, M. (2002). Information Processing. In M. Orey (Ed.), Emerging perspectives on learning, teaching, and technology. Retrieved from http://projects.coe.uga.edu/epltt/index.php?title=Information_processingThe rapid emergence of modern technologies had drastically changed the way the world works and the way in which information and knowledge is acquired. The internet generation (net geners) have begun to absorb information in new ways and have a limited tolerance for absorbing information which they could easily find through a Google search. Growing up digital “has encouraged this generation to be active and demanding inquirers - not passive consumers of media created for a mass audience” (Tapscott, 2008, p.18). The development of of these skills has been a coping mechanism to handle the information overload in the digital age.\"If it were possible to define generally the mission of education, it could be said that its fundamental purpose is to ensure that all students benefit from learning in ways that allow them to participate fully in public, community, creative, and economic life” (New London Group, 2000).Effectively preparing students to be successful in the twenty-first century involves a development of digital fluencies that go beyond just being able to use digital tools - they must become producers of content and be able to take advantage of peer-to-peer learning opportunities, have a changed attitude toward intellectual property, develop the skills valued in the modern workplace, and have a more empowered conception of citizenship.So what does it mean to be digitally fluent? There seems to be much discussion about digital literacy in schools today, but I don’t hear as much chatter about digital fluency. While literacy refers to knowing what tools to use and how to use them, to be considered fluent one must be able to reliably produce a desired outcome. Just like most students arrive knowing what a book or pencil is and have some idea how to use them, they still need guidance to become fluent with the tool.Source: SociaLens BlogAn effective way to imagine the difference between literacy and fluency is to consider language. Developing fluency is like learning a foreign language: to be literate in that language means that you have learned some phrases and can share some basic ideas. However, to be fluent means the ability to create your own story and proficiently use the language in varying situations. Digitally fluent people are able create, re-mix, and share ideas through the use of technology. \"The key idea is the ability to produce content rather than simply use technology\" (Crockett, L., Jukes, I., & Churches, A. (2011).It is important to remember that literacy occurs on a spectrum and students don't simply become fluent after a single lesson. It takes time, practice, and continuing feedback much like the acquisition of most other skill sets. The Global Digital Citizen Foundation divides digital fluency into five categories: Information, Solution, Creativity, Collaboration and Media. The organisation has developed a structured framework to model the critical skills that today's students require to become digitally fluent.Source: Global Digital Citizen FoundationGreat - yet another set of criteria I must integrate into my teaching. Teachers are already juggling an array of criteria that must be covered through their programs. I currently must satisfy the demands of the MYP concepts, objectives, ATL skills, a national curriculum and the ISTE Standards. The last thing I need is another set of criteria that must be infused into my program. However, what I like about The Global Digital Citizen Foundation is that the fluencies listed are easily integrated into already existing programs. Instead of restructuring my units, I simply reviewed my program with these standards in mind to see which areas I deficient in.There are many large and small scale educational activities which can be integrated into current teaching practices to promote technology competence and digital fluency. The following is a brief collection of classroom activities and technology tools I collected to encourage the acquisition of digital fluencies using the five categories identified by The Global Digital Citizen Foundation:Curated alongside: Costello, J., Hamilton, D., Langford, C., Stigall, J. (2016)ReferencesBriggs, C. (2012). The Difference Between Digital Literacy and Digital Fluency. Retrieved from http://www.socialens.com/blog/2011/02/05/the-difference-between-digital-literacy-and-digital-fluencyCostello, J., Hamilton, D., Langford, C., Stigall, J. & Turple, C. (2016). Digital Fluency in the Classroom. Retrieved from http://digitalfluencyintheclassroom.weebly.com/toolbox.htmlCrockett, L., Jukes, I., & Churches, A. (2011). Literacy is not enough: 21st century fluencies for the digital age. Corwin Press. Jukes, I. (2015). Global Digital Citizen Foundation. 21st Century Fluencies. Retrieved from https://globaldigitalcitizen.org/21st-century-fluenciesNew London Group (2000). A pedagogy of multiliteracies: Designing social futures in Literacy Learning and the Design of Social Futures, ed. Bill Cope and Mary Kalantzis. London: Routledge, p 9-38."},
{"title": "Copyright: The War against Piracy is Stifling Creativity", "date": null, "text": "As an educator who utilizes technology in her teaching, I had so many questions about copyright that no one seemed to be able to answer:           What does copyright mean?          Where can I find free-to-use content?          Do Fair Use principles cover me as an educator?My pursuit of answers that led me down a rabbit hole of information, contradictions, and legal jargon. Unfortunately contemporary copyright laws are convoluted and full of “grey areas”. The hypocrisy of how most laws have been established (through large corporations looking to cash-in) has stunted culture and put limits on creativity in the digital world. While I do believe direct copy and paste piracy should be illegal, today’s restrictions may be crippling today’s Creative Class of learners.See original slides with image / music sources here.I once tried what I thought was a fantastic idea as an English teacher: have students create a movie trailer for a book they had read to present to their classmates. Students did an excellent job carefully piecing together images, footage and background music using a variety of editing software. When they presented in front of their peers, we filmed their presentations and posted them privately on YouTube.Then YouTube took down the majority of my students' videos for copyright infringement. Oops.I had to backtrack and learn more about copyright laws and teach this information to my digital citizens:I also created a student-friendly printable \"cheat sheets\" to help students find content for their multimedia projects:How to Find Creative Commons Music / Sound EffectsPlease feel free to copy these materials and use them for educational purposes."},
{"title": "Digital Literacy is Crucial for Reading and Writing Instruction", "date": null, "text": "Literacy is known as the ability to read for knowledge, write coherently, and think critically about a language. The emergence of new technologies has brought about a need for the addition of digital literacy which refers to the ability to select appropriate technological tools and use them effectively. Though digital literacy goes beyond the use of specific tools to encompass a whole set of skills needed to flourish in today’s technology rich environment. The Future Lab’s report Digital Literacy Across the Curriculum defines digital literacy as having “access to a broad range of practices and cultural resources that you are able to apply to digital tools. It is the ability to make and share meaning in different modes and formats; to create, collaborate and communicate effectively and to understand how and when digital technologies can best be used to support these processes.” (1) It’s about collaborating, staying safe and communicating effectively; it’s about cultural and social awareness and understanding; it’s about being creative. Digital literacy can be envisioned as a number of interrelated components:The Components of Digital Literacy from Futurelab report However, the education systems - and schools on both sides of the digital divide - have been slow to adapt this new type of literacy in reading and writing instruction. Troy Hicks (Central Michigan University) and Kristen Hawley Turner (Fordham University) offer a passionate plea for teachers to incorporate technology in more meaningful ways in their article No Longer a Luxury: Digital Literacy Can’t Wait (2). They offer some examples of how teachers commonly integrate technology tools in the classroom in an ineffective manner:Hicks and Turner claim that educators should not just focus on students learning how to use specific technology tools, but we should be teaching students how to be literate across multiple forms of media and in a variety of contexts. Students should be able to:critically consume information and share across time and spaceco-create and collaborate to solve problemspersevere in light of setbacksmaintain flexibilityUnderstanding how technologies enable new literacies and meaningful communication should be a core curricular and pedagogical function of English education (3). Henry Jenkins (MIT Media Lab) calls this ability to function in online networks a “participatory culture” which has a relatively low barrier to artistic expression and civic engagement (4). Benefits of this digital culture include peer-to-peer learning, a changed attitude towards intellectual property, diversification of cultural expression, modern workplace skill development, and an empowered conception of citizenship. Jenkins further claims that participatory culture is the new “hidden curriculum” in schools. Digital literacy is a crucial component in modern literacy instruction and is necessary for today’s students to be productive members of a digital world. Teachers should focus on the skills related to digital literacy, not specific tools which will soon be obsolete in the ever changing world of technology.1. Hague, C. & Payton, S. (2010). Digital literacy across the curriculum. Bristol, England: Futurelab.2. Hicks, T. & Turner, K. H. (2013). No longer a luxury: Digital literacy can’t wait. National Council of Teachers of English. English Education, 102(6), pp 58-65.3. Grabill, J. T. & Hicks, T. (2005). Multiliteracies meet methods: The case for digital writing in English education. National Council of Teachers of English. English Education, 37(4), pp 301-311.4. Jenkins, H. (2009). Confronting the challenges of participatory culture: Media Education for the 21st century. Cambridge, MA: MIT Press."},
{"title": "Gamifying Education: Not Just Playing Video Games", "date": null, "text": "The observed motivators which engage children in free play are tantamount to the key elements found in games (1). Further, it is no question that video games are a dominant entertainment form in the twenty-first century and have the capabilities to engage users (2). Such game mechanics are beginning to be applied outside the immersive environments of games themselves, to create engaging experiences for participants in the real world. Gamification is the concept of applying game-design thinking and game elements to engage users in solving problems and increase users’ self contributions (3).The gamification of education is NOT just playing video games in the classroom - sometimes it doesn't involve digital technologies at all.Research reveals that the longer students stayed in school, the less likely they are to attend and feel engaged in their classes (4). Yet, game players regularly exhibit persistence, risk-taking, attention to detail and problem solving skills - all behaviors that would be ideal for students to possess in the classroom. Games are important as they embody four elements associated with how people learn; games are “immersive, they require players to have goals and make frequent decisions, they adapt to each player, and they unfold within the context of a community that supports the social dimension of learning” (5). Through the new media literacies of play and performance, players of games have the capacity to experiment with their surrounding as a form of problem solving, and can practice improvisation from varying perspectives (6). Guiding learners through the curriculum by encouraging thought and action is the foundation of intellectual engagement and aids students in the development of original work, collaboration, and confidence as knowledge-builders (4).I synthesized my understanding of academic literature to create this visualization of the key elements of gamification:Special thanks to @TyRiddick for his input.The gamification of education supports the constructivist theory where knowledge is not simply transmitted from teacher to student, but actively constructed by the mind of the learner (7). Games allow for role play and the immersion in experience through situated practice (8). Well-designed games allow for players to “construct understanding actively, and at individual paces, and. . . enable players to advance on different paths at different rates in response to each player’s interests and abilities, while also fostering collaboration and just-in-time learning” (1). Since the cycle between choice and result is much shorter in games than in life, hypotheses are regularly tested and refined, lowering the emotional stake of failing and encouraging risk taking (6). With this increased willingness to experiment, players continue to make choices, contextualizing facts and information as tools for problem solving (9). The intrinsic motivations instilled in players of games is only increased through extrinsic positive or negative reinforcements such as awards, achievements, or loss of power often found in games. This sort of operant conditioning affects the users’ choices if faced with a similar scenario later in the game (10). Students are forced to use their power of reasoning to construct knowledge for themselves when immersed in a game, no matter their age. The relevance of these capacities beyond a games context, form the basis of a modern literacy that should be developed by all young people.See my (first) stop-motion video explaining the four principle elements in game that make them engaging to users:James Paul Gee is a psycholinguistics researcher who has crossed over into literacy and learning. His book \"What Video Games Have to Teach Us About Learning and Literacy\" is an excellent account of gaming principles and discuses how these elements can be applied to the k-12 classroom.Again, gamification is not playing video games - it in the idea that the elements of video games can be applied in other areas. See the video below for an overview of his work:1. Klopfer, E., Osterweil, S. and Salen, K. (2009). Moving learning games forward: Obstacles, opportunities & openness. The Education Arcade. Cambridge, MA: MIT Press.2. Prensky, M. (2001). Chapter 5: Fun, play and games: What makes games engaging. Digital Game-Based Learning. New York: McGraw-Hill.3. Deterding, S., Sicart, M., Nacke, L., O’Hara, K. & Dixon, D. (2009). Gamification: Using game design elements in non-gaming contexts. Vancouver: CHI.  4. Willms, J. D., S. Friesen, & P. Milton (2009). What did you do in school today? Transforming classrooms through social, academic and intellectual engagement — First national report. Toronto, ON: Canadian Education Association.5. Mouza, C. and Lavigne, N. (eds). 2013. Chapter 1: Emerging technologies for the classroom. Explorations in the Learning Sciences, Instructional Systems, and Performance Technologies. New York: Springer Science and Business Media.6. Jenkins, H. (2009). Confronting the challenges of participatory culture: Media Education for the 21st century. Cambridge, MA: MIT Press.7. Piaget, J. & B. Inhelder (1967). A child’s concept of space (F. J. Langdon & J. L. Lunzer, Trans.) New York: Norton (Original work published 1948).8. New London Group. (1996). A pedagogy of multiliteracies: Designing social futures. Harvard Educational Review. 66(1), 60-92.9. Gee, J.P. (2003). What video games can teach us about literacy and learning. New York: Palgrave-Macmillan.10. Skinner, B. F. (1953). Science and human behavior. New York: Macmillan."},
{"title": "Using the Power of the Internet to Connect People", "date": null, "text": "Online performance artist Ze Frank's discusses his \"web playroom\" in the video below. Traditionally, art endevours have been transmissive and do not involve the audience, whereas Ze Frank utilizes technology to connect humans to one another. What resonated with me was his pursuit \"to feel and be felt.\" This is not a new idea, but rather a long time need for humans which has been augmented by the development of new technologies. It is a concept I think our Generation Z students struggle with on a daily basis.I find the idea of interactive art is very common in Asia. Around the city there are frequently art exihibtions which encourage interaction from the audience. Holiday decorations are even built as small cities meant to be walked through and experienced. Last November, there was a participatory show in Hong Kong called MURS described as an immersive, interactive outdoor Smart show. This show really hit home with me because it brought a crowd of complete strangers together in an engaging manner. In a city like Hong Kong, with one of the highest population densities in the world, a place where you are NEVER alone (quite literally unless you are in your home) there is an overwhelming sense of disconnect among the people. I still cannot believe how lonely it can feel standing in a large crowd of people. Hong Kong is a city always on the go: people are in a rush to commute, aggressive to close a business deal, storefronts and buildings are in a constant renovation cycle, and the workforce is transient. All these factors contribute to a place where no one feels grounded and are aching to connect. I think this is one of the reasons an interactive show like this was so popular, and why art which brings people together goes viral.In my eyes this is one of the greatest capabilities of new technologies for educational purposes. Teachers can transcend the walls of their classrooms to reach audiences around the globe. I have long been a fan of Dr. Ruben Puentedura’s SAMR Model which helps educators to think about HOW they are using technology. Is a technology just a different way of doing the same old task or it is adding something and transforming the learning experience? I often refer back to this model when working with teachers to help them move up the ladder. Technology seems a bit less daunting when there are clear goals laid out to assist tech integration.Culture is understood in Anthropology as the symbolic, ideational, and intangible aspects of human societies. The “essence of a culture is not its artifacts, tools, or other tangible cultural elements but how the members of the group interpret, use, and perceive them” (1). It is the values and beliefs based on knowledge and perceptions chosen and expressed through behaviour, image, and sound. According to my students, culture is about food and religion and clothing.I realized that these slides my students created as part of a lesson on global issues are just the beginning of an authentic exploration of culture, identity, and representation. This realization was particularly important to explore on a more meaningful level in the multicultural learning environment of my school.How are educators to challenge the assumptions surrounding culture? How will we decide whose voices will be heard?One approach to facilitate learning surrounding culture and identity is through art education. Art can provide us with a tangible object to discuss intangible concepts of identity, and help bring words and understanding to such abstruse constructs. Art is experienced through the senses and acts as a window into cultural representation. The representational power of art is intertwined with the interpretation of symbols used to communicate cognitive processes that are unique to each person. The creation of art can also be used to help students construct meaning surrounding culture and identity.As an art educator, Stacy Friedman explores issues of racism through puppetry. She has students design, create and script puppets with a commentary on conflicts surrounding identity representations. She notes that the puppets “serve as sort of metaphorical Trojan horses helping us to enter into uncomfortable discourse through a seemingly benign medium” (2). Friedman’s intent is that the puppets open up a door to higher critical thinking and have the potential to become a mechanism for exploring the thoughts and voices of others. Art is an individual encounter based on the mental filters and prior experiences of a specific person.French artist JR’s street art toys with identity by challenging preconceptions and reductive images propagated by advertising and the media. He work can be found in war-torn and conflict ridden areas of developing countries. JR snaps black and white portraits of local people and literally pastes blown up paper photocopies of these images in the streets. Powerful images of women were pasted around a slum in Kenya, Israeli and Palestinian portraits were placed next to one another in the Middle East, and portraits lined the streets of poor areas of India. JR does not explicitly explain the meaning of his art but instead allows the audience to interpret the art themselves by collecting the stories of those featured in his portraits. He also notes that his projects aid in the construction of his own mindset regarding culture and identity.Shouldn't students become producers of art as an alternative to the traditional consumption-centred model to emancipate students from media bias and offer a different perspective of how meaning is created?Authorship of media texts and tangible art can be applied to forms of critical analysis that “open up alternative positions from which students can think, debate, act” (3).  Not only can art serve as a surrogate of abstract ideas surrounding culture, but the “truths” about identity and culture can be interrogated and constructed through the production of artifacts.1. Banks, J.A., Banks, & McGee, C. A. (1989). Multicultural education. Needham Heights, MA: Allyn & Bacon.2. Friedman, S. (2004). Responsibility and re/presentation: Reflection on digital video and puppet-based inquiry.3. Goldfarb, B. (2002). Students as producers. Visual pedagogy: Media cultures in and beyond the classroom (pp. 57-83). Durham: Duke University Press."},
{"title": "Utilizing the Tech You Have: Mobile Devices in the Classroom", "date": null, "text": "If 1:1 laptops have not yet reached your classroom, there is most likely other tools which can be utilized for learning. Many students in the intermediate secondary levels already have their own cell phone and are often able to use them at school for educational purposes thanks to many school boards' BYOD policies.Are you utilizing this tool to improve learning?5 Tips to get a mobile program up and running:Clearly define when, how and why mobile devices are being implementedConsider the digital divide - will some students be left out not owning a device?Co-create a clearly defined set of rules with students which compliments the school's established Responsible/Acceptable Use Policy.Practice using devices in group settings first to ensure students are familiar with the technology and can effectively use it.Ongoing reflection of your teaching practice: Is the use of technology modifying or transforming the learning task?There are many softwares which support the use of mobiles in the classroom. The following are not limited to use with mobiles, but can easily be integrated into a BYOD setting:    See the original infographic at VennGage"},
{"title": "Alternatives to PowerPoint: Web-Based Presentation Slide Programs", "date": null, "text": "I used to teach Grade 8 English for 90 students. That meant whenever there were class presentations....I watched 90 of them. Thus, one would understand why I absolutely refused to let my students create boring, unengaging presentations using static, simple technology.I didn’t restrict what software my students could use, rather I restricted what they couldn’t use by banning PowerPoint.However, I learned as a teacher to be sure to direct students to programs that fit the criteria of the assignment. Since my oral presentation had to include a live speaking portion, students who chose the PowToons option were left starting and stopping their video. You can imagine how NOT smooth my nervous 13 year old students were in doing this in front of an audience of their peers.When providing options for students to create a presentation, it makes sense to me to seperate technology by presentation slides and presentation videos. See my review of various technology to create slides (could also be used as a student resource):See the slides here.To create short videos or animations to accompany presentations, see my Pinterest board of Video Creation Resources:Follow Cris's board Video Creation Resources on Pinterest."},
{"title": "Flipping the Classroom: Don't Re-Invent the Wheel, Find Pre-Made Video Resources Online", "date": null, "text": "There has been a lot of talk lately around the theory of ‘flipping the classroom’. Essentially, students preview lesson material and lectures at home to make time to do more hands-on, collaborative activities in class. Watch the following short video or view this infographic for more details.Source: Center for Teaching and LearningHowever, what teacher has the time to create a high quality video for each lesson?Allow me to be so bold as to say: no teacher. Though I have seen success from teachers who simply record themselves teaching a lesson at the front of the class or from an aerial view then posting it in a place students can access such as on YouTube or school LMS. This simple act allows the student to pause or rewind any confusing parts of a lesson which promotes self-regulation in the learner.Further, I have also seen success from teachers who record their screens during a lesson using tools such as EduCreations or the recording feature on SmartBoards. What’s great about this format is the accompanying online learning community of educators who have posted their own lessons to share. You could further check out places such as OpenEd or Share My Lesson for lesson sharing in a video format. Flipping the classroom has many benefits: instead of students listening to a transmissive, passive lecture, teachers can utilize the collaborative environment of the classroom by guiding cooperative and exploratory tasks. It also frees up the teacher’s time to provide personalized instant feedback to students and differentiate instruction by pulling small groups of learners to work with. However, there are many problems to the flipped classroom as well. What if the students don’t do their homework? What if there were technology issues? What if every subject teacher expected a student to learn lesson content the night before (how many hours of homework is that??)The more prominent downfall I spotted in my sideline analysis of the flipped classroom is that student grew tired of the format. Making an educational video entertaining is a hard feat! Creating even a simple animation or instructional video to accompany or substitute a face-to-face lesson takes much effort and time on the teacher's part. What I realized is that I did not have to create the video myself - what it came down to is finding the best resource to fit my teaching needs. Why re-invent the wheel? Luckily there are many free educational video resources available online. Follow Cris's board Video Resources for Lessons on Pinterest.I’ve also learned when it comes to the flipped classroom, as with anything, it works best in moderation. I appreciate many educational benefits to ‘flipping the classroom’. But I also am going to teach a lesson in the format which I feel worked best for the topic and my learning goals. For instance, I chose to flip a lesson during a speeches unit I taught. In this lesson, I had students view Martin Luther King Jr.’s infamous “I Have a Dream” speech at home, identifying literary devices and observing the vocal skills used in the speech. By flipping the lesson, students could view the video as many times as they liked. For the in-class lesson, we discussed the answers in groups and as a class before viewing another video which deconstructs the speech. I used the extraordinarily user-friendly site Ted Ed Lessons to create this lesson, along with embedded instructions, formative assessment , and discussion forum. The website sends the lesson creator a link to view what students have started the lesson and to review progress. Other teachers can also customize the lesson to suit their needs.See the Ted Ed Video Lesson hereSee the Full Lesson Plan hereSee the Unit Plan here Ever find yourself drawing incomprehensible doodles as you attempt to explain an idea to a student? I do all the time. There is no doubt in my mind that I am a visual learner. I see this come out in my teaching, as I break down complicated ideas for my students in the same way I did to make sense of it for myself. Taking large amounts of text and synthesizing those ideas to create an aesthetically pleasing, symbol-saturated visual representation is something I truly enjoy doing. Source: OnlineCollege.orgSee my Pinterest board for resources to make digital posters or infographics as well as editing programs for photo manipulation:Follow Cris's board Digital Posters/Infographics on Pinterest."},
{"title": "Reaching the Auditory Learner: Text-to-Speech Software and Voice Comments ", "date": null, "text": "It's undeniable that students learn best in different ways. So much time is spent classifying learners as auditory, visual, or kinesthetic yet often I find students are a combination of various learning styles - I know this is true for myself. Source: OnlineCollege.orgSometimes it's not enough to have the voice in your head reading along with you; sometimes it's just easier to have accompanying audio to text you are reading. Text-to-speech software is a great teaching tools for ELL students, struggling readers, students with learning disabilities like dyslexia or auditory learners. The following are my top text-to-speech tools:See link to the slides here.Some of my students this past year requested I leave them audio comments on their work instead of written text. Perhaps this was due to the high ESL population at my school who find speaking and listening to the English language much easier to understand than reading and writing. Or perhaps these students truly did identify with being auditory learners.Sometimes students just prefer to receive feedback in a certain way. As an educator who is a strong believer in differentiating my instruction, I am open to leaving comments in a form most useful for my students. Technology can be utilized to support various feedback mediums. Here are various ways to give audio feedback on your students' work:See link to the slides here.How do you reach your auditory learners?"},
{"title": "Learning Skills and Work Habits: Tech Tools for Tracking Student Behaviours", "date": null, "text": "The first statement of the Learning Skills section of the Ontario Ministry of Education’s publication Growing Success: Assessment, Evaluation, and Reporting in Ontario Schools states, “The development of learning skills and work habits is an integral part of a student’s learning” (p. 10).Teachers are expected to report on six categories:ResponsibilityOrganizationIndependence CollaborationInitiative Self-RegulationLearning Skills should not be considered in the determination of a student’s grades. Instead, the assessing, evaluating, and reporting on the achievement of curriculum expectations and on the demonstration of learning skills should be done separately.Though some may identify other skills as being crucial to student success, it is clear that a student’s work habits significantly contribute to their success in school and for life beyond the classroom. The Definition and Selection of Competencies (DeSeCo) Project, sponsored by the Organisation for Economic Co-operation and Development (OECD), has underlined the importance of identifying and developing key competencies as follows:Globalisation and modernisation are creating an increasingly diverse and interconnected world. To make sense of and function well in this world, individuals need, for example, to master changing technologies and to make sense of large amounts of available information. They also face collective challenges as societies – such as balancing economic growth with environmental sustainability, and prosperity with social equity. In these contexts, the competencies that individuals need to meet their goals have become more complex, requiring more than the mastery of certain narrowly defined skills.  (OECD, p. 4)We are preparing students for an information saturated world where they will need to be self-directed learners with the skills to collaborate with others, are organized, have initiative, and set and monitor personal goals. As educators it is our responsibility to foster and help develop these skills in our students.When it comes time for report card data entry, our tracking should be consistent and accountable to result in accurate reporting of students’ learning skills and work habits. The following are three simple tools for tracking students behaviours for the reporting of learning skills:See the slides here.Once again, I refer to Dr. Matthew J. Koehler's model of TPACK to conceptualize the interconnected and overlapping realms of teacher knowledge. The question posed is concerning the role of the teacher as it pertains to learning and understanding 21st century tools. The TPACK model shows a breakdown of the areas of expertise teachers are expected to know, including content knowledge, pedagogical knowledge and technological knowledge. According to this model, teachers should strive to reach the middle area where all three realms overlap. Content Knowledge: this is the information on the subjects we teach.But I think we can all agree that being an expert in a field does NOT necessarily equate to being a good teacher.Pedagogical Knowledge: this is ‘the art of teaching’.It includes such things as taking into consideration learning styles, differentiating instruction, creating a classroom environment and assessment practices. Basically, its your philosophy of education.Technological Knowledge: this is the tools used to teach.Today, many people’s immediate thoughts are of modern technologies. However, it can also includes things as simple as a pencil or a calculator.The overlapping area between content and pedagogy covers the core business of teaching. It is what to teach and the best way to teach it. However, it is often the third realm of technology with its overlapping areas that tends to be the most challenging for teachers.It’s true, that technology is advancing at exponential rates and there’s no way any one person could keep up with it all.So how should teachers face the daunting task of learning and teaching with 21st century tools?First, teachers should remember that technology (including new computer-related software and hardware) are merely tools to use to support student learning. The foundation of teaching still lies in a teacher’s knowledge of the content and their own personal teaching pedagogy. Effective technology integration does not consist of using it as a gimmick or reward for students. Instead, technology should be utilized as a teaching tool for lessons firmly rooted in calculated pedagogy and closely linked to content and curriculum outcomes.Second, it’s important for teachers to realize that they only need to know enough about new technologies to integrate it into their specific classroom - the same way that we only use teaching practices which fit our pedagogy and content knowledge which relates to our subject. Teachers do not need to be tech experts to effectively use technology in the classroom. Instead, the best 21st century educators know of a tools which fits the context of their teaching, some basic skills of how to use and tool, as well as the courage to try it out!Third, teachers should remember that a proper education in the 21st century must include teaching and learning with new technology. Educators must equip students with technological skills to be digital citizens and successful in the world. It is the role of the teacher to learn alongside his or her students as technology advances to guide students on their journey and model self-sufficiency when learning about new technologies."},
{"title": "Microsoft Word Online vs. Google Docs", "date": null, "text": "Why Both Are Great:Collaborate and share with others - work on a document in live time; collaborate on whole folders of documents; share with others via a link or email with various levels of editing rightsAuto-save feature - no more backup files as documents save every few secondsSync all your documents in a clouded drive - access your work from any device by signing into an accountHow They Differ:At first glance, One Drive and the comparable Google Drive offer many of the same types of documents to create. OneDrive does not offer a Drawing option, but this is not that great of a feature in my opinion as there are many better drawing tools available online.A major benefit of One Drive over Google Drive is an online version of OneNote.But apparently Google offers OneNote as as an App in the Chrome Store:What’s a greater concern is the mere 3 GB of storage space on One Drive with the ability to upgrade by recommending the service. This is extremely limited when considering that Google offers 15GB of free storage (30GB if you are signed up at work or school).For additional reasons Google Docs edges out the competition see this article: 10 Reasons Why Google Docs is better than Word Online.On the flip side, there is a not-as-convincing list: 5 Reasons for Microsoft fans to dump Google Docs.Though the above article does bring up a key problem with Google Docs: FORMATTING. If you don't know what I am talking about, read about the way Google Docs often alters original formatting when documents are converted.  Personally, the only time I ran into formatting issues in my daily use of Docs was when I printed pages, but I do admit it can be a problem. Ironically, it was the Word Online document’s formatting that was disarranged during my demo.The Bottom Line:If you work in an environment that is already utilizing Microsoft products or produced highly formatted documents, Word Online is an ideal tool to increase collaboration and sync work. However, if you regularly use Google tools (like I do in a Google certified school) than it makes more sense to stick with Google tools.For more information, see this comparison of Word Online and Google Docs.The Ontario College of Teachers has professional guidelines and standards for educators to follow. See below for my visualization of the standards as well as a summation of the Professional Advisory surrounding electronic communication and social media: Click here for full-size poster"},
{"title": "Blended Learning: Learning Management Systems", "date": null, "text": "This hybrid method of learning combines traditional classroom and online education. Blended learning has emerged with the advancement of new technologies in an effort to reach and teach students more effectively. While educators may debate the exact meaning of the term, the gist is that online technology is used not just to supplement, but transform and improve the learning process. The Ontario Ministry of Education explains the tools used to create Blended learning should help students:learn or review key conceptsstay organized communicate with othersshow what they have learnedsubmit assignmentstrack achievementThe website further states, “Blended learning uses the tools of the provincial learning management system (LMS) to teach and support learning in a face-to-face class.” Thus, technology used to support Blended Learning not just technology tools which can be used in the classroom, but online learning platforms meant to support traditional classroom learning. The goal is to use technology to build an online learning community that transcends the walls of the classroom so students can continue their learning outside the classroom. Click here for my comparison of various Learning Management Systems (LMS) to Support Blended Learning"},
{"title": "This Post is Licensed for Noncommercial Reuse...", "date": null, "text": "It is my school’s policy that students and teachers use only copyright-free material. This makes sense hypothetically, but what does it actually mean? Where could this mysterious content be found? After asking around, it became clear to me that copyright-free material was not understood by many other teachers as well. So how could we possibly teach and model finding such content for our students? Although it was part of my job to ensure students were only using copyright-free material, I knew very little myself about what can and cannot be used nevermind how to monitor this from my students. However, teaching in a technology-focused school means the students use digital technology to create many of their projects. They take images, video clips, sound bites and more from the internet and to create their own products on a regular basis. I decided to make it my mission to learn about copyright licensing alongside my students. First, I compiled a list of websites with copyright-free material. I sent students to my Pinterest board of copyright-free resources.However, my students thought Pinterest itself was all copyright-free material which could not be further from the truth. I witness numerous students searching for \"copyright-free\" content using the search bar of Pinterest!I can see now why the students were confused.So next, I modeled finding content using the Creative Commons website. This search engine links to various copyright-free sites. But students still struggled with the specific options on the different websites.Luckily Creative Commons has a great resource to explain what each of the copyright permissions mean:Sharing Creative Works (Creative Commons) by Creative CommonsFor my own students, I made it clear what the best options would be for them on various websites: Make a copy of these lesson slides hereWe went over the above slides as a class before any task requiring images, video or audio. I also print hard copies of these slides for students to refer to at their desks. Whenever we brainstormed Success Criteria as a class, I made a point to include \"copyright-free material\" in the list. It became second nature to always use copyright-free content and students began searhing for only copyright-free content in their other subject classes without being asked to.Research Function in Google Docs and PresentationsSince I mostly utilize Google tools in my teaching, one of the simplest ways for my students to find copyright-free material is using the Research Tool in Google Docs and Presentations. This tool allows you to search Google content (filtered by usage rights) directly in Docs via a pop up box. A few of my students made this tutorial video: See written instructions for using the Research Tool here.I think it is important to teach students to identify and understand the copyright-free licenses so they can determine for themselves what material they can and cannot use. Furthermore, students should understand WHY they should use copyright-free material and how to label their own work in the Creative Commons."},
{"title": "Online Privacy for Students in a Digital Age ", "date": null, "text": "When I taught Grade 8 English, I always had my students write an autobiography at the beginning of the year to learn more about them. This past year I added a media focus by having students design a digital poster to represent themselves. The software to be used was left wide open - students could use anything from Microsoft Publisher to online digital poster software to simple Paint.I even gave student the option to publish their work online as visual resume or an About.me page. My intention for this online option was to encourage students to begin building a positive online presence. It was not mandatory, but rather an option and platform for the students to showcase their accomplishments. See my lesson instructions here:We spoke as a class about what is and isn’t appropriate to post online. However, I received mixed reactions from parents and my peers. Was this still too much information for students to post publicly? Should students under a certain age be anonymous on the internet? Should such online behaviours be encouraged by a school?Where do we draw the line between creating a positive digital footprint and protecting children from the dangers of the internet? In a school which introduced a 1:1 laptop program and supports a tech-infused learning community dedicated to the principles of the International Society for Technology in Education (ISTE), these are critical questions to be asked. And it seemed that no one knew the answers.My classroom project sparked a lively debate among educators at my school concerning what the students should and should not be doing online. On one side, it is important for schools to protect students from the dangers of the internet. On the other side, I think we could all admit that students with their own laptops and a constant wifi connection are visiting whatever sites they wish.Instead of hiding children from the internet, I feel it’s the role of the school to educate students on safe online behaviours.We can never teach someone swim from the deck of the pool. We of course shouldn’t push them into the water with no previous guidance, but instead assist them into the water with a suitable knowledge of what to do once in the water and how to react to unfavourable situations. From my experience, educators often prematurely give students full reign of the internet after deciding technology is a beneficial tool for education. We essentially pushed students into the deep end without the necessary skills needed to stay afloat. Students need to be explicitly taught digital citizenship and have their online actions closely monitored while they are still learning appropriate online behaviour.See my follow-up lesson on online privacy here:Access the lesson slides herePlease feel free to use any of these resources in your own teaching of online safety."},
{"title": "21st Century Teaching Means Collaboration", "date": null, "text": "The information age has broadened our accessibility to information and people. As technology and consequently approaches to education advance, the roles of the teacher and learner in the 21st century are drastically altered too.  My emphasis as an educator has always been about collaboration. Even the most dedicated and hard-working teacher is not as effective and resourceful as two teachers collaborating. Working with others increases productivity, encourages critical brainstorming and problem solving, increases professional learning and offers a different perspective of the content to be taught. I have consistently pushed cross-curricular projects within my school and modelled my instruction after what the Ontario Ministry of Education has coined Teaching-Learning Critical Pathways (TLCPs). It is through working closely beside others teachers that I have learned the most about teaching.When it comes to collaboration in my classroom, I foster a cooperative learning environment for my students through group activities and exploration of topics. I strongly believe that all people learn more in a social setting where they are encouraged to questions and test their ideas instead of a more traditional rote-style learning setting. Learners are encouraged to interact with one another, share ideas and work together to complete tasks and solve problems. However, traditional teaching methods do not often incorporate collaborative learning and often it is viewed as ‘cheating’. Yet 21st century teaching requires a re-imagining of what learning should look like. If students are unable to share information with one another and discuss their ideas, then perhaps it is the assignment that is flawed and not the cooperative nature of the students. Teachers must re-evaluate where assignments lie on Blooms Taxonomy. If the sharing of answers between students defeats the purpose of the assignment, the task itself needs to be changed so students have the opportunity to analyse, synthesize and evaluate topics instead of simply regurgitating facts and ideas. Source: http://juliaec.files.wordpress.com/2011/04/blooms_taxonomy.jpgFor me, 21st teaching and learning is all about collaboration. Collaboration among teachers (in-person and online) and collaboration between students."},
{"title": "Social Media in the Classroom - Twitter Pilot", "date": null, "text": "Social media is a great tool to integrate into the classroom and I have experienced with various platforms such as Edmodo, Blogger, Google Sites, Facebook, Skype and most prevalently Twitter. I used Twitter in my practicum classroom back in Ontario and it went over quite well. The students stayed in touch with me and their peers from the ease of their phones and home computers. I was able to send links to the students easily and recommend educational resources related to the topics were were learning about in class.Last year, I piloted a Twitter program at my school and Hong Kong and did not have as successful of results. Twitter is not popular in Asia and many of the students had never even heard of it before. After the chaos of getting 90 students signed up on the website, I found Twitter not to be very user-friendly for 12 year olds. Unfortunately the students were not very engaged in using Twitter as it was not a form of social media they were interested in using. In addition, we ran into many problems with the students’ inboxes getting spammed with adult content.In the end, we found other collaborative web 2.0 tools such as Edmodo and Google Docs a better fit for our students. I personally use Twitter to connect with other educators and find it a valuable tools for collecting resources and having conversations with other educators.For those new to Twitter, see this document about the basics of using Twitter (I made this for my students). Here is a presentation and instructions for signing up to Twitter we presented to the teachers after our pilot project.Follow me @CrisTurple"},
{"title": "A Breakdown of TPACK: My Understanding of the Theory and What It Means for Education", "date": null, "text": "Just because a teacher uses technology, doesn't mean they know how to teach with technology.  Good teaching practices are embedded in an established pedagogy with an aim to transfer the skills and knowledge laid out in curriculum documents. * PowToons is an easy-to-use software to create animations. I use this tool with my Grade 8 students quite frequently."},
{"title": "When Kids Can’t Read: What Teachers Can Do", "date": null, "text": "What do good readers do? This is a difficult question for any person to answer, as reading comprehension is an invisible process for the most part. A struggling reader cannot see the reading comprehension strategies a strong reader uses when reading. Struggling readers can’t see their classmates re-read, make personal connections, visualize, or make inferences. As a teacher, it is important to make such processes visible in the classroom. Educators must model reading strategies, allow collaborative discussions about reading, and provide opportunities for repeated practice of making meaning of texts.Recently I read Kylene Beers’ text “When Kids Can’t Read: What Teachers Can Do - A Guide for Teachers 6-12” in an attempt to better my teaching practices surrounding reading.Beers lists practical, easy to integrate pre-reading, during reading, and after-reading strategies that educators can implement in their own classroom. She draws on over 20 years of personal experience as both a teacher and reading specialist to share what she has learned and shows teachers how to help struggling readers with:comprehensionvocabularyfluencyword recognitionstudent motivationSee the following Google Doc for my detailed notes on this textbook."},
{"title": "The Horizon Report: Emerging Technologies Initiative", "date": null, "text": "The Horizon Report is a decade-long comprehensive research project designed to identify and describe emerging technologies likely to have an impact on learning, teaching, and creative inquiry. This report is the result of a joint venture between The New Media Consortium (a globally focused not-for-profit consortium dedicated to the exploration and use of new media and new technologies) and The ELI (a community of higher education institutions and organizations committed to advancing learning through information technology innovation).The following are my synthesized points of learning from the 2011, 2012 and 2013 editions of the report, outlining the contemporary key trends and critical challenges of emerging technologies.Key Trends1. The abundance of resources and relationships made easily accessible via the Internet is increasingly challenging us to revisit our roles as educators. sense-making and the ability to assess the credibility of information are paramount - teach research skills, not knowledgemedia/digital literacy for students to be able to navigate the internet2. Technologies we use are increasingly based not on school servers, but in the cloud. browser-based software that is device-independentnotions of privacy and control (where is the line?)significant cost savings (bring your own device)3. Technology continues to profoundly affect the way we work, collaborate, communicate, and succeed. The digital divide, once seen as a factor of wealth, is now seen as a factor of educationevolving occupations, multiple careers, and an increasingly mobile workforce (prepare students for jobs which don’t exist yet)4. People expect to be able to work, learn, and study whenever and wherever they want to. logistical challenges in a busy, fast-paced world (should we also be sure to unplug?)the implications for informal learning are profound - social networks“just-in-time” learning and “found” learning: maximizing the impact of learning by ensuring it is timely and efficient5. The perceived value of innovation and creativity is increasing. “Innovation is valued at the highest levels of business and must be embraced in schools if students are to succeed beyond their formal education. The ways we design learning experiences must reflect the growing importance of innovation and creativity as professional skills.”Near-term horizon (within 1 year): electronic booksMid-term horizon (within 2-3 years): augmented reality and game-based learningFar-term horizon (4-5 years): gesture-based computing and learning analyticsCritical Challenges1. Digital media literacy continues its rise in importance as a key skill in every discipline and profession. despite widespread agreement on its importance, training in digital literacy skills and techniques is rare the lack of formal training is being offset through professional development or informal learning, but we are far from seeing digital media literacy as a normdigital literacy is less about tools and more about thinking, thus skills and standards based on tools and platforms have proven to be somewhat ephemeral (short-lived)2. Economic pressures and new models of education are presenting unprecedented competition to traditional models of schools. ways to control costs with growing number of students, and fewer resources and staff than beforesimply capitalizing on new technology is not enough; new models must engage students    3. The demand for personalized learning is not adequately supported by current technology or practices. more learner choice and control (differentiated instruction)“It has become clear that one-size-fits-all teaching methods are neither effective nor acceptable for today’s diverse students” - has one-size-fits-all teaching ever been an effective way to teach??4. The fundamental structure of the K-12 education establishment — aka “the system.” “As long as maintaining the basic elements of the existing system remains the focus of efforts to support education, there will be resistance to any profound change in practice.”Why are we still educating in the same manner we did before computers were invented? Why is education not the number one priority to our society? Capitalist mentality: no personal gain from education system5. Many activities related to learning and education take place outside the walls of the classroom and thus are not part of our learning metrics. social networks: difficult to tie back to the classroom, as they tend to happen serendipitously and in response to an immediate need for knowledge, rather than being related to topics currently being studied in school"},
{"title": "My Move to Google Drive", "date": null, "text": "I made the switch. After a year of flip flopping between various formats and learning platforms in an attempt to distribute materials in the most effective way to my students, I transitioned to Google Drive. I started using Google Docs about 3 years ago. In my past teaching, I have created lessons on Docs when working with other teachers and had students use them when collaborating on group projects. However, the lack of technology in my past school did not allow the foundation of my teaching to be in the Google cloud. Now that I teach at a one-to-one laptop equipped school, I feel very fortunate that this is even an option for me. Perhaps it was the Google Apps for Education Summit I attended last June that pushed me over the edge. Learning about many new Google Apps, made me think that Drive could be an equivocal solution to compiling all my lessons and resources in one place.Recently, I ran a professional development workshop aimed at familiarizing teachers with the key features of Google Drive. See my presentation with links to further resources to get you started if you are new to Google tools."},
{"title": "Pedagogical Reflection", "date": null, "text": "I am a strong believer that students should play an active role in their education. I also agree with the pragmatic understanding that there are no absolute or eternal ideas in the world, but rather concepts which can be altered over time through experience. Similar to existentialist thinking, it is my opinion that people continuously make choices which define who they are. Thus, an education system which employs the idea of individual freedom and curriculum consisting of experience-based activities would be beneficial to students in finding a personal identity.  Students collaboratively created their ownclassification systems for various leaves. My time spent in my first practicum placement solidified many of my education beliefs I have developed over the past five years spent in the concurrent program. I implemented my concept of experimental learning through hands-on work and exploratory projects which enable my students to construct their own knowledge. I strived to implement the process of gradual release, coupled with tiered lessons to scaffold individual students’ understanding. Collaborative learning and group work was also very prevalent in my classroom, as I believe humans learn best in a social setting.Furthermore, a strong emphasis on problem-solving and inquiry was a major focus when lesson planning, as well as student-centred learning to ensure an equity-based learning environment. As I do not feel memorization necessarily ensures understanding, I attempted to move away from rote learning and the regurgitatation of facts by giving students the opportunity to construct their own meaning. Through project-based culminating tasks, I encouraged students to link new information with their existing knowledge in meaningful ways.    Students applied their new knowledge of classification systems to create a whole-class taxonomy of the animal kingdom.For the most part, my lessons included a de-emphasis on textbooks in favour of varied learning resources. The use of math manipulatives, visual mind mapping, educational technologies, and kinesthetic activities aided students in problem-solving and inquiry in the classroom beyond what traditional texts could offer. I was fortunate enough to have a SMARTboard installed in my class, which enabled me to easily integrate a plethora of learning tools and software into my lessons, and provide students with an interactive digital tool to collaborate with their classmates. However, despite being equipped with the professional knowledge of child-centred learning, I did find myself reverting back to a teacher-directed teaching style at first. My inexperience implementing my education theory in an actual classroom led me to teach the way I was once taught. In my future practice, I must be conscious of this pattern, and try my best to not slip into this comfort zone. Although I do recognize the value of explicit and direct instruction, I do not feel it should be the basis of my teaching model. Another challenge I faced during my practicum placement was related to classroom management. Since I believe students should be able to roam and explore new concepts throughout the classroom, the environment became much more complicated to govern than a traditional classroom setting. This type of cooperative learning environment also fosters an increased noise level, which seemed to be bothersome to some of the students. I will be better prepared to navigate such dilemmas in the future, to best suit the needs of my students. Classroom management, specifically the idea of management versus discipline will be key areas of focus for me in my upcoming placement.   I need to always remember that my personal ideals, beliefs, and personality are who I am, and will come out in my teaching. I need to be aware of and eliminate my biases and stereotypes, to provide an inclusive schooling environment for my students. Furthermore, just as I bring personal baggage into the classroom, I must consider that my students will also bring with them experiences and opinions of their own.I will attempt to constantly challenge and alter my worldview of teaching to best aid my students. Following the misinterpretation of his earlier work on progressive education, John Dewey wrote that educators need to think in terms of education itself, and not an ‘ism about education, even one such as ‘progressivism.’ For any movement which holds itself to any particular ‘ism becomes controlled by them (Experience and Education, 1938). I want to adapt educational theories and concepts to my own style, and not let one particular idea be my absolute guideline in the classroom. I hope to constantly question my approach to teaching as well as the common practices found within the education system.Through ongoing reflection, I hope to solidified my values and intentions as a teacher to inform and refine my professional practice.“Of all the teacher knowledge need to draw on, self-knowledge is most important (and least attended to)” (Ayers, 2001)"},
{"title": "Working Together: Moving Away from Teacher Autonomy", "date": null, "text": "Collaborating with other educators is becoming increasingly simple thanks to new Web 2.0 tools aimed to facilitate information sharing, interperability, and collaboration. The internet has exceptionally expanded accessibility to teacher resources and lesson sharing, and has made working in a group much more convenient.In one of my faculty of ed courses, the class decided to create a handbook for first year teachers as a culminating project. Groups were formed based on interest, and what was to be included in the handbook was completely up to the students of the class. Some of the elements of the handbook included assembly organization, field trip considerations and destinations, DPA activities, classroom management, community building, and other issues deemed important by the teacher candidates. This project was a great example of how working towards a common goal can be beneficial to all involved, as the class members would be creating a truly useful and meaningful text together to aid them in the field upon graduation.However, the real magic occurred with the integration of web-based technology. As mentioned in previous posts, LiveBinders is a website which allows users to create digital, multimedia representations of 3-ringed binders. Since I am the new unofficial spokesperson for LiveBinders (self-appointed), I was asked by the to facilitate a short workshop for my peers on the basic functions of the tool. The results were pretty remarkable.Instead of each of the twelve groups handing in a physical written report, a LiveBinders account was created for the class consisting of separate binder for each topic. Students took advantage of the variety of digital mediums supported by the website by uploading images, videos, audio files, PDFs, and Google Docs into their binders. Since the account could be accessed from anywhere with an internet connection, student candidates could work on the project on their own time without requiring a meeting time booked around five or six hectic schedules.An example of a binder created by fellow teacher candidates for our class project.At the end of the day, every member of the class gained access to an extensive digital compilation of resources specific to the context of being a new teacher in Ontario. If they would like, students could copy the binder to their own LiveBinders account and continue to add relevant information to the binders as they progress in their teaching careers. There is also the option to make the binder public to share with other Brock teacher candidates, or even new teachers from around the world. The possibilities seem endless.After this practical application of technology for a large-scale collaboration project, I have seen first hand how simple teacher collaboration can be. None of the more than thirty students had experience with LiveBinders prior to this project. It took little effort to give a 'how to' crash course and direct them to online video tutorials. The feedback I received via anonymous online surveys stated that my peers found that the tool genuinely simplified group scheduling, and the sharing of teaching resources.However, this integration of technology did not come free of challenges. I received many emails and questions regarding how to work certain features of the website, but in many circumstances it became a topic of conversation with those I had not socialized with all year. Also, we ran into some complications uploading Google Docs into the LiveBinders by copying and pasting their URLs, but this was resolved by linking the URL to words in a text box. In addition, there was some confusion regarding varying instructions for Mac users, as I ran the demonstration on a PC.Finally, some of my peers appeared frustrated by the 'extra work' involved in comparison to printing out pages to hand in a physical copy. But for those, I say they missed the point. Creating a handbook for beginning teachers was not just another project to be finished and handed in then forgotten. The professor for this course aimed to make the year-long assignment meaningful and authentic for those in the class. Instead, creating LiveBinders was a way to learn and familiarize teacher candidates with a new digital tool, and collaboratively create a resource for all those in the class.Personally, I cannot justify not taking advantage of such tools to better my professional knowledge and practice as a teacher. More importantly, I cannot justify not sharing such ideas, skills, and tech tools with other educators to simplify collaborative work for others. The information age has broadened our accessibility to information and people. As 21st century teachers, we must also change the way we communicate and share education resources."},
{"title": "My 21st Century Classroom is Merely 21st Century Learning", "date": null, "text": "When envisioning what a 21st century classroom would look like, I seem to get less caught up in the physicality of a room lined with the newest technologies or the aesthetic qualities of the room. Instead, my mind wonders more towards the academic content which fills a classroom. I imagine beyond the physical constraints of a traditional classroom to an environment injected with 21st century teaching and learning.The 2011 Horizon Report suggests that the demand for personalized learning is not adequately supported by current technology or practices. The report states, “It has become clear that one-size-fits-all teaching methods are neither effective nor acceptable for today’s diverse students.” But is this idea genuinely clear when condidering the structure of today’s education system?A truly progressive classroom requires a complete restructuring of what has been conceived as a learning environment for the past 100 years:   Through the process of creating this glog, I gained a deeper understanding of just how new technologies can be utilized to convey meaning and knowledge in a manner which best suits an individual. A glog is just one example of a way to reach those who are classified as ‘visual learners’. I have discovered through my own experiences as a student that tailoring instruction towards a visual learning style requires more than simply adding images to a slideshow (or SMARTboard!) and proceeding to lecture at students. Instead, I feel students should be engaged in the exploration of a topic. A tool such as Glogster offers a platform for learners to display their understanding using a medium which may be best suited for his or her learning preferences. Glogster gave me the opportunity to construct my knowledge in a way which works for me, and allows me to express a collection of ideas in a visually appealing manner."},
{"title": "Contemporary 3 Ring Binders: Organize Your Multimedia Teaching Resources", "date": null, "text": "I will be presenting a short session on LiveBinders at the fourth annual Brock University Education Technology Showcase. This PD event showcases innovative educational technologies, and more importantly, how such technologies can be integrated in the classroom. LiveBinders is a Web 2.0 tool which can be used to organize websites, blogs, photos, videos, word documents, Google Docs, Voice threads, PDFs, and so on. Visualize it like a bookshelf in your room. On each shelf are binders containing information on various topics. Each binder is organized by an overall subject. Each subject is further divided into sections, and smaller subsections using tabs. LiveBinders allows you to bundle online resources without printing hard copies of the information. But more importantly, links are automatically updated as they would appear on the web, and other mediums such as Livescribe Pen files, Google Docs and webpages can be added as well. By making LiveBinders public, you can make your binders open for others to view. Or you can decide to just search other Livebinders while keeping yours private. It’s like borrowing someone’s book and making a copy for yourself. But no physical storage space is needed, it’s accessible from any device with an internet connection, and we’re reducing our eco footprint by not printing off a stack of papers. The following is a video tutorial I have created for new users of LiveBinders:  For me it’s about the organization of information. With the limitless amount of information available at our finger tips, I needed to find a way to organize and compile data in a useful and meaningful way. Learning about these individual tech tools is great, but not if it’s information overload.  Through the use of LiveBinders, I can go into any classroom with an internet connection and have with me every teaching resource I’ve ever compiled, as well as other teachers’ unit plans I’ve found to be helpful. I have learned that teaching is not about reinventing the wheel. It’s about taking snippets from multiple places and molding it into something that suits the needs, abilities and interests of the students. Almost every teacher I’ve worked with has had an intense physical filing system full of lesson ideas and plans, as well as multiple shelves of books. LiveBinders is a digital and collaborative version of such traditional filing systems. This is the filing system of the 21st century teacher. See a LiveBinder on How to Use Livebinders: Your First Binder"},
{"title": "Tech Enabled Leadership", "date": null, "text": "A video about the education technology cohort I am a part of at Brock University Faculty of Education, shared at the K-12 Online Conference.                      Presentation Description: Our story is about growing leaders in the Ed Tech Cohort at Brock University in Hamilton, Ontario. This story begins with planting the seeds of tech leadership by providing intensive hands-on educational technology training. Their growth was nurtured by helping them develop an online professional network and partnering them with Virtual Associate Teachers. As their technical and tech-social competencies grew, cohort participants also received instruction in pedagogical approaches that use technology to enhance teaching and learning, technical curriculum design and leadership theory. This training and support was essential so that they may become a future educational technology leaders and a ‘Forest of Leaders’ can take root. Throughout the presentation you will hear their voices and stories as they grow into 21st century teachers."},
{"title": "Support Network", "date": null, "text": "Here's a look at our cohort support board. It's nice to see people have been acting on their offers and updating their support notes! Zoe has also posted her 'modes of communication' sheets from her opening circle activity, so we can better visualize the best methods of communication within the cohort. A Google doc has also been started to list contact information of those wishing to participate.\"When you're drowning, you don't say 'I would be incredibly pleased if someone would have the foresight to notice me drowning and come and help me,' you just scream.\" - John Lennon"},
{"title": "When Live Gives You Lemons...", "date": null, "text": "Find some more lemons and unite.Like many teacher candidates, I have recently been experiencing a lot of stress and work overload which has negatively affected my overall well-being. A recent feeling of being utterly overwhelmed has pushed me to brainstorm solutions, and create a survival strategy to cope with the daunting task of concurrently completing assignments, being placed in my first teaching block, and managing a life outside of school.My reflection led me towards examining the importance of support systems, whether it be in the form of family, friends, a significant other, or so on. We can’t do it all ourselves, and at times we need the care and support others can provide us. But maybe for some such supports are non-existent. Or their network is not local. Or our worries are not relatable to those people who have been our support system in the past. It is difficult to explain to a person outside of the education realm the anxieties which accompany being filmed and critiqued teaching your first microlesson.So today I led an activity for my fellow teacher candidates highlighting the support system we have in one another. We not only talked about what we need in the way of support, but reciprocally what we can offer our peers. From what I’ve learned about this group so far, they want to help each another as much as they may need help themselves. I merely wanted these potential connections to be realized.I felt this was an opportunity to work together to succeed. We talk endlessly about collaborative learning for our students. Why not us? Why can’t we work together toward the common goal of becoming teachers. Let’s truly break free of an individualized state of mind and model cooperative learning.For me, what it comes down to is the students. If we are not mentally healthy and secure, we will be of no use in the classroom. However, as educators if we work together to better ourselves and better each other, we will only be able to better help our students. That’s something I truly believe, and has been a reflective learning for me this past week. Many thanks to my cohort group for their participation today."},
{"title": "Literacy in the 21st Century", "date": null, "text": "Traditionally, the term literacy has been used to describe the ability to read and write. However, as our world changes and develops, the forms and functions of literacy have evolved with it. In today’s world, social forces such as the rapid emergence of the internet, economic competition, migration and immigration, and the state of the planet all contribute to a reconceptualized idea of what literacy is. Reading itself is not comprehension, and children need to have sustenance beyond reading as it is not enough if they do not know what to do with the words. Students need to be able to go beyond reading and writing to understand the world, be equipped with the skills to survive in today’s changing society and become global citizens.One of the major ways our society has changed is the abundant amount of information now available through the invention of new technologies. To get through this new text-saturated culture, we need to teach children critical literacy. Critical thinkers and media literate persons actively analyze to uncover underlying messages and biases presented in all forms of texts, media, images, and so on. This notion of an ‘acquired skepticism’ encourages students to establish a disposition towards a text, and not merely take it at face value. We have created a difficult world for children to live in, so we must prepare them to navigate through the excess information available to them, and critically analyze everything they are exposed to."},
{"title": "What Does Literacy Mean Today?", "date": null, "text": "Traditionally, the term literacy has been uses to describe the ability to read and write. However, as our world changes and develops, the forms and functions of literacy have evolved with it. In today’s world, social forces such as the rapid emergence of the internet, economic competition, migration and immigration, and the state of the planet all contribute to a reconceptulized idea of what literacy is. Reading itself is not comprehension, and children need to have sustenance beyond reading as it is not enough if they do not know what to do with the words. Students need to be able to go beyond reading and writing to understand the world, be equipped with the skills to survive in today’s changing society and become global citizens. One of the major ways our society has changed is the abundant amount of information now available through the invention of new technologies. To get through this new text-saturated culture, we need to teach children critical literacy. Critical thinkers and media literate persons actively analyze to uncover underlying messages and biases presented in all forms of texts, media, images, and so on. This notion of an ‘acquired skepticism’ encourages students to establish a disposition towards a text, and not merely take it at face value. We have created a difficult world for children to live in, so we must prepare them to navigate through the excess information available to them, and critically analyze everything they are exposed to."},
{"title": "Welcome", "date": null, "text": "Welcome world, to a collaboration of my journey as a teacher! This is the first of many posts centred around my teaching practices, philosophy and learning. I hope to be able to share with you my experiences in the education field, and reflect on my ups and downs in teaching."}
]