[
{"title": "Street Style Do's and Dont's", "date": "Monday, March 16, 2015", "text": "I love looking at street style trends, and I must admit, I laugh at many of them.  Some of them are just plain ridiculous, some only work if you are under 20, and some can be surprisingly cool.  According to Harper's Bazaar, one of my favorite fashion and beauty mags, here are some of the street style trends for this Spring 2015.  And here are my recommendations about which ones to avoid if you are a femme d'un certain age.1. FRINGE: There was a time when I thought fringe was pretty cool, but that has been a while.  In small doses, it's okay, but beware the allover fringe look.Add captionNow I think Olivia Palermo almost always looks fantastic and she looks good here, too. But if you're over 50, I wouldn't go there.  If you must have fringe, try it on a scarf or bag.2. LADYLIKE BAG: This is an all time classic.  I have a camel Bally bag from 1991 that is a dead ringer in shape and size for some you see on Bazaar's pages.  it still looks fresh and pretty with an outfit. A definite YES!Ladylike Bag3.  OVERALLS:  I had a pair of lilac overalls by Liz Claiborne that I wore in the '80s - does that tell you anything?  Unless you need to do yard work or paint a room, please avoid.OverallsStay tuned for the next 3 trends!"},
{"title": "Over 50 Style: Helen Mirren", "date": "Thursday, August 07, 2014", "text": "In my last post, I expressed dismay that out of Harper Bazaar's 100 Women of Style list, only 9 of the women noted were over 50! Surely there are more stylish women over 50?! I immediately thought of several whose absence from the list was surely a glaring oversight on someone's part. Heads should roll!   The first woman of style missing from the list: Helen Mirren.   Why she should be on the list: She has style in every inch of her body. Her style speaks through clothing choices, her posture and attitude, her hairstyles and makeup choices. There were a few under-thirties on that list who could learn a lot about style from Helen Mirren! Above and below, I love her choice of formal wear.  The dresses are always beautiful on her and they are truly what I call \"starlike\", that is, they are beautifully cut and adorned with lovely embellishments.  When she goes to awards shows, she is just flat out glamorous and sexy while still being classic. I would love to own the black dress below. Love the earrings with this outfit.  Below, I love that Helen Mirren shops at CVS!  I also like this \"everyday\" look she's wearing for running errands.  That top is divine! Below, another look at that gorgeous dress.  Love the hair! And Helen Mirren is so good about choosing colors that look fantastic on her. Knowing what works on you is such a huge part of having style! Below, this bright blue is beautiful and looks great with the color of Helen's hair.  I love the whimsical lizard pin that she is wearing.  Below, another of the wonderfully embellished dresses that Mirren favors.  The earrings are perfect. Above, striking a pose in red. Look at the wonderful decorative belt she is wearing. Below, two wonderful head shots with two different attitudes. Both are stunning!   So, who over 50 would you add to Harper's Bazaar's list of stylish women? Do you agree with me about Helen Mirren?"},
{"title": "Harper's Bazaar and 100 Stylish Women: Where Are the Over 50's?", "date": "Sunday, August 03, 2014", "text": "The list is out: Harper's Bazaar has chosen 100 women who supposedly are some of the most stylish in the world.  Am I to be blamed for being disappointed that only 9 out of 100 are women who are over 50?  And of those who were chosen and are over 50, I'm a bit puzzled by the choice.   But let's look at those 9:   1. Carine Roitfield: (above) She's 59 years old and looks pretty good, but then she's French! She's also the former editor of Paris Vogue.  If she were a close friend, I would tell her to do something with her hair. 2. Carolina Herrera: The jet-setting lady who lunches turned designer is a favorite of mine because of her taste in clothing, perfume, and home furnishings. Yes, I can see why she was chosen.  She is the ultimate in ladylike fashion and good taste. 3. Cindy Sherman:  The famous photographer/artist is a chameleon when it comes to fashion and in this photo looks rather tame compared to some of her other incarnations. 4. Ines de la Fressange: Once again, she's French, so what can I say? Actually, she's the best of French style and always looks chic.  Being rail thin doesn't hurt her chicness, but she definitely has style in anybody's book! 5. Linda Fargo: She is senior vice president of the fashion office and store presentation at Bergdorf Goodman. She's responsible for spotting trends and is quite trendy herself. She always looks good! 6. Lynn Wyatt:  This lady who lunches has been around forever.  I like her. I enjoy reading about her at times, but I don't see her as particularly stylish since she has more money than I could spend in a million lifetimes and so much cosmetic surgery that it's hard for me to consider her stylish. Style indicates a certain individuality that comes from having imperfections and quirks, and Lynn just doesn't seem to have any - or if she does, she gets rid of them quickly. Although her clothes are pretty, I never remember seeing an image of her in anything that made me really sit up and take notice (and I've been following her since the 1980's at least). 7.  Queen Elizabeth:  Now I like that Queen Elizabeth is on the stylish list because she does have style. If you don't believe it, then go to Nieman's or Saks' websites and see if you can't choose an outfit for her. I'll bet you can! Her style, by the way, is perfect for who and what she is.  It's called appropriate. 8. Tilda Swinton: I love her as an actress.  She does have style, not necessarily style I would want to emulate, but style that does inspire!9.  Sheikha Mozha: She's probably not as familiar as the other names on the page, but yes, she certainly has style.  She is the widow of the Emir of Qatar, a graduate of the University of Qatar and extremely active in furthering education and development in Qatar.  She's known for her love of haute couture and for adjusting it to meet the modesty requirements of her home state.Who would you add to the list of Most Stylish Women Over 50?  I'll be adding to this list in the next few days - the women over 50 who should have made the list, but didn't!"},
{"title": "Mid-Summer: Best Buys Right Now!", "date": "Sunday, July 13, 2014", "text": "This is a great time to stock up on summer clothing.  Of course, the August sales may bring somewhat cheaper prices, but I've found that right after the 4th of July, prices are low and the selection is still good. This means that you can find pieces that actually fit you well instead of settling for a size too big simply because it's 70% off (really, a no-no).   My first and favorite buy is this pima cotton tee from Charter Club at Macy's.  Why I like it: If you are over 50, it covers the worst part of the arm while                                  remaining cool; it's also fitted without being too tight.                        Runs a bit large, I took an XS instead of a SM.   Price: 19.99  although a few colors are on sale for 14.99!    Below, Tahari pants in white.  Can be found at Marshall's and T.J. Maxx depending on your store.     Why I like it:  Not too sheer and unlined so they are cool, but not                                            transparent.    Price:  19.99                                                             If you don't know about Dooney and Bourke's Specials each month, you're missing out! This month two of the specials are the Florentine satchel that you see above, and the Croco Fino satchel below.  If you go to the site, you will find more.     The satchel above is regularly  priced at $318.00 and now is on sale for $238.50, a substantial savings!  It is only available in salmon (shown above) and ivy.      The Croco Fino satchel is a classic.  It is available in 7 colors!  Shown in red below. It's regularly priced at $348.00 and is currently on sale for $261.00.       Why I love them:  Dooneys are well-made bags that will last.                                   The satchels are classic looks made of good leather                                  that will look good for a long time.   Below, a Michael Kors assymetrical bathing suit on sale at Macy's (along with many other suits as well).       Why I like it:  The assymetry gives this classic suit a bit of an edge.                              With its cut it will look good on anyone!        Price:  67.20  (originally 112.00)Happy Shopping!  Please note that I am not an affiliate of nor do I have any financial connection to the products listed."},
{"title": "To Wear or Not To Wear: The Bikini If You're Over 50", "date": "Monday, July 07, 2014", "text": "It's an ongoing debate: should women over 50 wear bikinis or two piece bathing suits.    First, I do truly believe that people should wear whatever they want to wear.    That said, this is a fashion and beauty blog, and I am concerned with not just appropriate attire, but also what looks good on women over 50 especially.  Since the point is to look good, that is the position I'm coming from.  Pictures always help, so first, above, Courtenay co in an elegant black bikini.  At exactly age 50, she can still look good in a bikini, and certainly she should wear one if that is what she is most comfortable in.  Imagine how elegant she would look in a one piece though! Why?    Well, one thing that you will notice is that very often older women will have a certain je ne sais quoi at the top of the hipbone. It's a slight heaviness, or fat, that can look like a wrinkle.  Courtenay has it, most of us over 50 have it.  The key to an older woman looking good in a bikini is the amount of aging shown by the middle part of the body.  Below, Sharon Stone still has a great body. No one would argue that. In fact, even though she is several years older than Courtenay, I would say Sharon looks much better in her bikini than Courtenay does in hers!     Below, of course Helen Mirren looks good in her bikini. Again, I'd say she'd look much more elegant in a one piece simply because if she were 25 with the same body, I would recommend a one piece.  It's about looking good, and she could look better.    In my book, for the best look, Anjelica Huston should definitely not be wearing a bikini.    Does it have to do with age? No, it has to do with the way that her body is shaped. Her legs look okay and so do her shoulders; cover up the part that doesn't look so good - her middle, and she would look much better at the beach.   Below, Janice Dickinson is nice and thin, no question.  But she does not look good in a bikini!    Her skin on the middle part of her body is loose, not toned, and the hip line is very pronounced. Notice the \"lines\" or shadows you can see starting with her rib cage and going down (no, those are not her ribs).  Although she is skinny, it looks as though I could pull skin from her body in my hand. A one piece would cover that middle part that really shows her age!    Below, Christie Brinkley is gorgeous and still has a gorgeous body.  Her body looks toned, filled out, but still not overweight. She fills out her skin. Below, I'm a big fan of Julianne Moore. Her middle part isn't bad, but she would still look so much better in a skimpy one-piece suit.   So, should older women wear bikinis? If you are over 50 and you want to look the best you can, you probably shouldn't wear a bikini!   However, I was on the beach once in Brazil in my one piece American bathing suit when I saw a woman about my age or older in a Brazilian bathing suit.  She was a bit larger than me, certainly had one of those beautiful Brazilian bums, and the marks of time showed on her as she stood there with her husband and two grown and beautiful daughters.  She had stretch marks and aging skin, but stood there as comfortable in her own skin as she could be, in fact, she was much less self-conscious than either of her two beautiful daughters.   My own son, in his early thirties at the time remarked that he thought that the freedom that she had to wear that bathing suit at her age without anyone thinking twice about it or being judgmental was wonderful.  And I know exactly what he meant!  Me, at 63, I'm sticking strictly to a one-piece although I may wear a bikini when I'm in my best friends pool (as I did in my own pool)  and it's just the two of us. The feeling of freedom is just too tempting!  Note: some of the photos here came from http://www.faboverfifty.com/wstyleblog.php/?p=13099."},
{"title": "Best Dressed? Sorry Elle,  Not If You're Over 50!", "date": "Monday, June 30, 2014", "text": "I adore fashion magazines. Always have, probably always will, although I no longer pore over them endlessly the way that I did in the 1970's when I had no money at all to buy clothes or accessories or even the way I thumbed through them over and over in the 1980's when I lived in a too-small town for the clothes I really would have liked to wear.But now that I am, ahem, over 50, (really I'm over 60), I am constantly amazed at what is considered to be \"well-dressed.\"I really got tickled when I was looking at my Elle magazine and saw this best dressed list that follows. Needless to say, I vehemently disagree, but especially if you are over 50, you need to avoid these looks like the plague.As usual, I will tell you exactly what is wrong with each one!Above, okay, Dakota Fanning is cute and this is a really young look.  I don't find it becoming to her though for several reasons.  Look at where the skirt stops at a most unbecoming place on her legs causing them to look stumpy instead of curvy. Then the dress looks particularly shapeless; even though it seems to have a drawstring, it hangs completely straight.  This color does nothing for her either. The shoes are okay, but I don't find them flattering either. If you are over 50, this look is the kiss of death.  Why?  Are your arms completely muscular and toned?  With this sleeveless dress they will need to be.  If you are over 50, this length will look \"old-lady\" on you unless it happens to be your \"g-spot\" length (what I call the skirt length that hits at the most flattering place on your legs).Only if you are a bit curvy and you pull that drawstring to show off your waist will this look the least bit okay on you. Gwen Stefani made Elle's best dressed also.  You won't if you are over 50 (personally I don't see how Gwen made it either).If you are over 50 avoid wearing a jacket that:has too many zippershas too many additional details such as the large flaps near the hemis super bright neon orangeYou may be able to get away with one of these, but all 3, forget it!The boyfriend jeans with their loose fit will look like \"mom\" jeans, dowdy and unbecoming because they will likely add an extra 5 to 10 pounds to your lower half.Don't wear t-shirts with lettering unless you are playing a team sport or coaching one. Above, there is so much wrong with this I hardly know where to begin. Remember Ralph on Green Acres? Then you are too old to ever wear over-alls unless you are repairing something.Stripes are good; spaghetti straps and cut-out sleeveless tops are not.Leather baseball cap? Just say no.They may look cute on Miley, but if you're over 50, be careful about wearing gold shoes with casual wear.Alessandro Ambrossio got it right.   Everything works here.  If you're over 50?    Easy.  Let the hem down, and unless you are extremely graceful and have never taken a fall in your life, get shorter heels. Otherwise, perfection.    Oh, but avoid the long single braid."},
{"title": "It's Summer!  Do's and Don't's If You Are Over 50!", "date": "Sunday, June 15, 2014", "text": "1. DON'T wear panthose. Now I love pantyhose and hate the bare leg look when it's the least bit cold. But in the summer, pantyhose don't just look hot, they look sweltering!2. Do: Use a spray tan just on your legs, a light-colored spray tan if you don't use it on your arms or the rest of your body. Otherwise, use leg make-up. I know, sounds awful, but it looks great, actually much nicer than most spray tans! Sally Hansen makes a great one that you can get at the drugstore.3. DON'T have arm swing. If you like your arms, you can show them off.  But be realistic; are they really toned and smooth? Did you look at your arms from behind, too?4. DON\"T go as short as you can!  Save the mini-skirts for winter when you can wear opaque tights with them.  With bare legs, the mini on someone over 50 just looks wrong... sometimes almost naked, even if your legs are beautiful.So many things wrong here! 5. DON'T pile on the bronzer. Be judicious and use a lighter color bronze than you may think you should use.  You don't want to look like a terracotta pot.  What you want is a glow.Everyone has seen her, but are you sporting the same look with makeup?6. DON'T go more than one shade darker with your summer foundation. Again, you want a bit of color, but you don't want to sweat brown or have streaks on your face.  Add most of your color with powder.7. DO: Change your colors.  Try pinks and corals and lighten up on the red.  This not only goes for your lipstick and blush, but also for finger and toe-nails.  Pinks are especially flattering to older skin.  Dark red polish will age your hands and feet.8. DO: Wear a sunscreen.  All the time, and all over, not just on your face.9. DO wear underwear the same color as your skin, especially if you are wearing a lot of white.  People who have to look at you from behind will thank you.  By the way, this tip is good for any age, not just those over 50.10. DON'T wear short-shorts.  Do I even have to mention this? Good."},
{"title": "What To Buy Now for Summer", "date": "Saturday, May 24, 2014", "text": "Straw hats add protection while being relatively cool. Before it gets any sunnier or any hotter, there are four items you need to make sure that you have ready to go for summer - especially if you are over 40.  These are not just fashion accessories; they will make your life simpler, make you look better, and protect you from the harsh elements of summer.A HAT:  I know. You hate hats. But a hat will not only protect your hair from sun damage as well as your tender scalp, it will also shade your face and reduce the sun exposure your facial skin receives.  Although many people wear sunscreen, some still get a rash from being directly exposed to very hot, very bright sunshine (alas, I am one of them!). Canvas hats are great: they can be rolled up and stuffed in a suitcase, but they can also get a bit hot.  Your best bet for running around town is a closely woven straw hat.SUNGLASSES: Your eyes need to be protected just as much as your skin does.  Too much sun exposure can lead to cataracts.  Be sure to buy sunglasses that fit you without sliding off when you sweat and those that flatter your face shape.  Below, Coach, Fendi, and Prada sunglasses are great, but if you are like me and constantly misplacing them, the cheap ones are okay. Just make sure that they meet the following standards:UV 400 protection. (These block light rays with wavelengths up to 400 nanometers, which means that your eyes are shielded from even the tiniest UV rays.)  (frLenses block 99% or 100% of UVB and UVA raysLenses meet ANSI Z80.3 blocking requirements. (This refers to standards set by the American National tandards Institute.)om WEBMD)A GOOD BEACH TOTE:  Forego the cheap bags that barely outlast the summer unless you know that it's going straight into the drink the first time you get into a boat, kayak, or canoe.  A good bag can be used when running errands around town and still look chic. You can still be colorful; just avoid kitschy (always avoid kitschy!). The bags below range from $9.99 to over $370.Coach Tote Bag with Colorful StripesLarge Striped Beach Tote from WalMartLongchamps Travel and Tote Bag in Colorful StripesA TUNIC COVER-UP: Don't go inside the snack bar in your bathing suit.  Get a tunic that can double as a run about town top over pants or shorts and a cover-up over a bathing suit.  The tunics below are modest, cover up drooping upper arms and your lower bottom when worn over a suit, and look airy and summery over a pair of leggings or shorts. These three tunics are from Soft Surroundings, but they can be found at most department stores, and specialty stores such as Anthropologie. (I love Anthropologie's Striped Swing Tunic, not pictured here).  Amazon.com Widgets"},
{"title": "More of My Favorite Products", "date": "Thursday, May 22, 2014", "text": "If you've ever read this blog before, you know that for most of my adult life (from about ages 30 something to 58) Aveeno lotion is the only lotion and/or beauty product that I used on my face with its ultra sensitive skin.  While I don't use it exclusively anymore, I will still use it at night when I have any kind of skin rash or problem, or sometimes over a stronger retinol that I may be wary of using.However, I still do use Aveeno lotion all over my body.  It is hands down one of the best moisturizers that I have ever used, and with a chronic dry skin condition known as icthyosis, that is saying something.  For summer, I use the Aveeno lotion with a sunscreen all over my body.  Cures dry skin and protects it from sun damage. It also seems to \"plump\" my skin; my skin seems thicker after application.  After using for about 30 years, I have to say it is still a winner!By now, everyone surely knows about Essie!  If not, here is some good news for your nails, especially for those of us over 40.  Essie nail polishes go on smoothly and last.  They have one of the best choices of light colors that look good on over 50 hands.  The light pink (see below) flatters older skin, a good thing since our hands are one of the first places to show age.  My favorite range from white (looks so clean and fresh, especially in the summer) to a medium dusky pink.  Sugar Daddy and Mademoiselle are almost cult favorites: pale pinks that look good on everyone.  Some of my favorites: Fun in the Gondola, Eternal Optimist, Fiji, Mademoiselle, Sugar Daddy, Ballet Slippers, and Vanity Fairest.Essie's best invention: No Chips Ahead.  This marvelous topcoat dries quickly and really makes your manicure long-lasting.  I've had a paint job last for a week!  Really!  I love this stuff and will never be without it.  To me it seems to work best with Essie polishes although I've used it with other brands as well.Donna Cluny Gardner"},
{"title": "Two Products I Swear By!", "date": "Monday, May 19, 2014", "text": "Revlon Grow Luscious Plumping Mascara: It Works!I love finding new products that work!  Two that I've found lately are making my life much happier. Disclaimer:  I am not advertising nor do I receive any renumeration in any form from these two companies or any other having to do with these products.First, finally a mascara that I can love using everyday.  Through the years, my lashes have grown thin owing to my using extensions for years and years (those things are very, very hard on your lashes and everyone ends up losing some permanently), then using strip false eyelashes everyday for at least 10 years.  Many people swear by products that help lashes grow that you put on at night before bed, but I was always forgetting to put those on.  Coming to my rescue: Revlon's Grow Luscious Plumping mascara.  It has the ingredients that help your lashes grow, but in a mascara that actually looks good.  And since this is mascara, I don't forget to put it on.  I'm wearing it everyday as part of my regular makeup routine.  It's a good mascara that thickens lashes when you apply it, and over time actually helps your lashes grow.  It has minimal flaking, a big plus for me!  And of course, since it's a drugstore mascara, it's relatively cheap, about $7.99 per tube.  I use a tube about every 6 weeks or so.  It will last longer for people who don't use mascara as heavily as I do.Estee Lauder Re-Nutriv Intensive Lifting Makeup SPF 15Second, a product that will cost you more, but if you measure the effectiveness of a product by how it makes your skin feel and how many compliments you get,  is definitely worth the money.  I am known to be an Estee Lauder fan and have used their foundations, especially Fresh Air makeup base, since the 1970's. While I still think that the oil-free Fresh Air makeup is one of the best ever, ever made, it lacks a sunscreen.   On Saturday, I turned 63 years old.  I need a foundation with a sunscreen, even in the winter months, and even though I use a cream with an SPF of 15 every day. I splurged and bought Estee Lauder's Re-Nutriv Intensive Lifting cream foundation in the Fresca shade.  I though that it was a bit shiny, so I also got the Re-Nutriv finishing powder.  I didn't really need to though since the subtle glow/shine is what I get so many compliments on.  Does it really \"lift\" (I could use the lift)? I'm sure it doesn't, but for the finish it gives my skin and the comments I've received, it is definitely worth the $75.00 price tag for the jar. A plus, a great range of shades for all skin colors.Below: my face with only a bit of lipstick, eyeliner, and my foundation.  No blush, basically a blank canvas.  Doesn't my skin look great!?"},
{"title": "A Few Little Beauty Tips To Try Today", "date": "Wednesday, April 23, 2014", "text": "Put clear lip balm on your cheekbones? Try it!  Vanessa Axente, a Hungarian model who is also the star of Endless Euphoria fragrance ads, uses Chanel's Rouge Coco Baume on her cheekbones, then follows with a bit of blush.The highest part of the arch of your eyebrow should be jusst above the outer edge iris of your eye.Drink 1 1/2 litres of water a day and a good hyaluronic serum should follow your antioxidant serum. Hyaluronic acid can hold and bind up to over 1000 times its own weight in moisture.Remember to put sunscreen on your hands and reapply it throughout the day.  Hands show age dramatically.Try soaking your feet in apple cider vinegar to make them especially soft.  It's cheap, too!Squeeze water out of your hair, but don't towel dry it so that you will avoid the \"frizzies\"!"},
{"title": "The Difference Between Being Older and Looking Old", "date": "Sunday, March 02, 2014", "text": "Yes, I am a femme d'une certain age, as the French put it so wonderfully. That is, at age 62, I am an older woman.  However, I don't think that I have to look \"old\" when looking old means looking dowdy, frumpy, or tacky as so many people seem to think.Many of you may be familiar with the work of Ari Seth Cohen, a photographer based in New York who is known for capturing vibrant and beautiful older people going about their daily routines on the streets of that city.  I've chosen a few of his photos of especially attractive older women who look wonderful, and whose look, I believe, is within the reach of anyone.One of the things that you will notice that all these women seem to have in common is that they take care of themselves; it shows through even in the photos of those who are dressed casually, so this is not about expensive clothing.You will also notice that they are not overweight, probably one of the elements that can age us more than anything!You will also notice that they are all wearing lipstick whether they wear other makeup or not!Photo, above, yes, she's dressed up, so elegant. Not a ton of jewelry or make-up although she is wearing make-up. I love the photo above.  Although not my style, I love the way this outfit is put together. It's vibrant and colorful, but it looks youthful and definitely not like those big-flowered \"old lady\" prints.Below, being thin is better. Love her grey hair and that turban although this is a bit much for where I live. She is wearing denim, yes, denim, and it looks really good.  Multiple rings and the statement necklace work here (but no earrings).  Those sunglasses add a unique, personal touch. Personally, I hate tattoos, but it seems to work for her. Below, I love this lady in her casual outfit.  Her hair is great, not teased, not sprayed, just airy and natural looking.  Her camo jacket works for her over her leggings. And yes, when you are this small, you can get away with wearing leggings even if you have grey hair! Notice though that the boots go with the camo so this looks deliberate, not like an afterthought. Her skin is beautiful, her grey hair is beautiful, again, natural looking, not teased and sprayed. Below, I love how her lipstick, sweater, and gloves all match.  Natural grey hair pulled back. Above, this outfit looks so comfortable! She is wearing fashionable glasses (not little old lady wires), and her handbag is gorgeous.Below, here she is again. Comfy clothes that don't look sloppy because everything is pulled together (notice how the lining of her jacket is the same color as her pants?) Lipstick! Her shoes are very up-to-date and a great color! Below, this is perhaps my favorite photo.  I love her complexion, her eye make-up, her lipstick, the way her hair is pulled back. She is perfect! Those earrings add individuality.This woman below is old. She looks old.  Her hair is teased and probably stiff; her glasses age her and her rouge looks as though it almost goes down to her chin line. She is not wearing lipstick. Her jewelry looks as though it is plastic.   She has probably worn her hair like that since she was in her teens.Change her glasses, her jewelry, blow-out her hair, and give her lipstick and she could stand her own with the women above.  Below - old lady or teenager. If your grand-kids give you this, wear it only around them. Below, frumpy (although she's not really old). Her pants are too big, her sweater is too big, and nothing works with anything else. What she is wearing makes her hips look huge!The thing I also loAnd that's half of really looking good!ve about my elegant older ladies though is that they all seem to know that they look good."},
{"title": "Street Style: What You Can Learn From It", "date": "Friday, February 21, 2014", "text": "So many women think that so-called \"street style\" is only for the young, avant-garde, artsy-looking New Yorkers who are looking to stand out and turn heads on a busy street.  However, street style is interesting because it shows us fresh ways to style our clothing, not replicate a complete look.If you look at the street style photos on this page, you will find that there is a fashion tip, or fashion lesson in each one of them, sometimes subtle, sometimes not so subtle.For instance, the photo above may not look particularly daring, but note the way her scarf is tied (perfect!), the way the 3/4 length sleeved coat works in colder temperatures when paired with a heavy sweater, and ow that bright pink cheers up an otherwise somber outfit.  In fact, if nothing else, street style photos can convince you that a pop of bright color that is not necessarily found already in your outfit will make a real difference in its fashion quotient. Below, just jeans, but that bright red mini-bag and bright red nail polish makes a huge difference. Below, if you are over 40, lose those too short wide pants and opt for black pants that are straight-legged or skinny. Keep the cream layered on top and add a wonderful fringed shawl in a print on a cream background. Perfectly elegant. Skip those shoes, too. The power of color really shows on a rainy day.  There ought to be a law that umbrellas can only be made in the brightest colors possible. Below, forget the outfit on the left with the weird ripped-hem peplum (or whatever that is) and look at the classic outfit on the right.  When is the last time you wore a simple white shirt with jeans and then put a great red coat or blazer over them? So fresh looking! This look will work for anyone over 40; layer the tops, grey over bright (hot pink would look good), skinny jeans, and instead of boots with sky-high heels, go for flat boots and still tuck in your jeans.  Lose the white purse; try one in another bright color. Below, a wonderful look for almost anyone.  Black shoes and tights lengthen your legs forever.  A skirt a bit longer (if you aren't in love with your thighs) would work just as well. The lady-like bag gives the whole outfit a polished look even though it's just a sweater over a skirt! Above, the lesson here is mixing navy blue with sky blue and black.  Try this look with a longer skirt, tights and medium heeled black pumps. Gorgeous.Below, the pink coat is beautiful; the color-blocked bag updates the classic outfit. Above, the lesson: black jeans with a black jacket, black boots, black bag and a light shirt or sweater. Make sure your black jeans have no holes if you are over 40.  Below, a bright jacket over all-black is gorgeous! Make those shorts a pencil skirt or a pair of black jeans and you have a winner. If you are over 40, use self-tanner on your bare legs or wear a pair of thin tights and forego the peep-toes (which usually aren't very comfortable anyway).Street style is exciting, eccentric, and fun! Add those qualities to your own wardrobe by studying the latest photos. Two great street style blogs are Streetpeeper and also Caroline's Mode."},
{"title": "Aging Gracefully", "date": "Tuesday, February 18, 2014", "text": "Pictures of me today! Why? Because at age 62, I have been trying for the first time all the creams and serums that so many people swear by.  While I don't think that any of these will keep me from aging, I am hoping that they will give me soft, smooth skin and help me age, well, gracefully.  Plus, I am having a ball trying different things!  A funny switch for someone who until the age of 59+ used only Purpose soap and Aveeno lotion on her face!   Now, my routine has changed. No more sleeping in make-up (my huge vice - I'm so often lazy); if I don't shower before I go to bed (with my Purpose soap), I use either Neutrogena facial wipes (it takes me 2 to clean my face, then I splash with lukewarm water) or Estee Lauder's Re-Nutriv cleanser (always splashing water afterward).   Currently, at night I am using a firming serum called Acure Organics Seriously Firming Facial Serum; afterward I apply L'Oreal's Revitalift (a drugstore, yes, drugstore purchase!).   In the morning, I may experiment with some sort of serum, but usually I just use Estee Lauder's Daywear. It's very moisturizing, has a sunscreen, and I love the cucumber scent.  When I remember, I may use their foundation primer, but usually I just use Re-Nutriv Ultimate Lifting Creme make-up. It  has an SPF 15 rating so I am doubling up on the sunscreen. If I do decide to go sans foundation, I always put a sunscreen on!   I've been very happy with the results, best seen in the first picture: no retouching, no photo-shopping. I don't know how firm my skin is, but it is certainly smooth and soft!By the way, my skin is extremely sensitive, but so far nothing has caused a break-out during experimentation except for Lauder's Swiss Performing Extract.    Next experiments will be with lash enhancers!"},
{"title": "What To Buy Now", "date": "Saturday, February 01, 2014", "text": "Ahh, January, one of the coldest months of the year (in many places in the US, certainly here in the Washington, D.C. area) when our thoughts turn to self-improvement although grey days cast a dismal light over complexions and wardrobes. But cheer up! This is a great time to go shopping, in stores and online. One thing we can do is think ahead to next year's winter and search out good quality merchandise at low, low prices now, and also find pretty accents to cheer up our current wardrobe.What to buy now? Something in Orchid, this year's newest color. Your best bet is a purse! But even small doses of this pretty color will update your wardrobe. Try a cashmere scarf or orchid leather gloves for a great pop of color during these cold, grey days.  Orchid will add a feminine touch to anything! A winter coat that you will wear for years.   Most stores are having sales with prices slashed to ridiculous lows. You may not find your dream coat, but it is worth a look. Best bets are cashmere and camel hair in camel or black although a bright red or crisp navy would be great, too.Great equestrian style boots. There's still plenty of time to wear them this year and you may be able to score a pair on sale.  Look for flat boots with buckles or a two-toned leather so that they are chic and extremely wearable.Shopping in February not only gives you a chance to find some great deals, but you can also scout the early Spring arrivals and decide what is going to be worth adding to your basic wardrobe in the coming season."},
{"title": "It's Good To Shiver, Watch Out for Coral Lipstick and Dark Nail Polish", "date": "Saturday, January 25, 2014", "text": "Some researchers have \"...found indirect evidence that the body's response to cold, which consists of shivering and hormonal actions, plays a major role in energy expenditure.  Regulation of body temperature, they say, is associated with weight.\"(Fiona Johnson, University College, London, 2011) Also, shivering burns about 400 calories an hour!  You may have heard the oft repeated advice to drink ice cold water since it takes more energy and burns more fat than drinking lukewarm water, but  supposedly even lowering the temperature in your home a few degrees will help with weight loss. Of course, where I live, all I have to do is go to the local grocery store where I swear they keep the temperature deliberately below 55 degrees Fahrenheit.As you get older, your hands are one of the parts of your body that shows aging, and there hasn't been a lot that you can do about it.  One help though is to avoid very dark polishes or brown polishes which seem to accentuate wrinkles and make your skin look older.Everywhere you will read that the hottest new lipstick color for Spring is coral.  But if you have less that white teeth, beware.  Coral is a color that will cause your teeth to look dingy - as will most red lipsticks that have a lot of orange in them.  Instead, go for a coral with a lot of pink in it rather than orange - or opt out of coral totally."},
{"title": "Four Beautiful Women Over 40", "date": "Tuesday, November 19, 2013", "text": "Just a short post to celebrate the beauty of these four women who are all over 40. First, above, Nicole Kidman is still gorgeous and drop-dead sexy  no matter what color her hair is (I personally prefer her in red). S. Epatha Merkerson (Law and Order) is a beautiful woman.  I love her dimples and the sprinkling of freckles that she doesn't try to hide. And what a smile! She is 60; can you believe it! By the way, she is not the thinnest star either, but she still looks great.Above, Kim Basinger. Enough said. She's 59 years old. Yes, in this picture. Catherine Zeta-Jones is 44 years old and absolutely stunning despite health problems and possibly marital problems.  All four of these women prove that you do not have to let a stressful life show on your face no matter what your age.  It is not too late to get enough sleep, take nutritional supplements, exercise, lose weight, and wear makeup.  Don't think of private trainers, chefs, $800 haircuts, expensive make-up. None of that really matters. What matters is that you exercise whether you have someone to train with or not.  That you eat healthfully, even if you eat out or cook for yourself. Get your hair cut by someone who cares what you look like. And drugstore makeup is wonderful these days. Experiment and you can find something that will work for you!"},
{"title": "Losing Weight; Getting Fit", "date": "Saturday, November 09, 2013", "text": "Yes, it has been quite a while since I posted; in fact, it has been approximately 4 to 5 sizes ago!  Since January, I have been dieting and trying to get healthy, and I have succeeded somewhat.  I told myself that I was not going to go back to this blog until I had lost enough weight that I was happy with the way I looked!I have currently lost approximately 33 pounds and I feel great!  I have gone from wearing a size misses 12 (sometimes 10) to wearing a size 4 in pants (occasionally a 6 in some brands).  I feel on top of the world! The weight loss was precipitated by my son who wants me to be able to climb mountains and be around while my grand-daughter, who is 4, is growing up.  One of the great motivators was his purchase of a scale which showed not only weight but the amount of water, body fat (cringe), bone density, muscle mass and a few other factors.  My fat percentage was way out of line with my weight and small bones.  I looked forward to weighing on his scale once a week to see if I had lost fat percentage (and I kept an eye on muscle I might be losing, too), and then looked forward to telling my son the proud results.  When he left in July for his post in Bulgaria, I continued.  It doesn't hurt that I live in a townhouse with 4 floors and am constantly running up and down the stairs all day. Because of the stairs, my thighs are hard as rock and I can see daylight between them.  Now I want arms just as hard! Below, you see a photo taken (with my darling Cluny) in the summer of 2012, just before we went to Paris.  The rest of the photos here have been taken in the last month. Below, the jeans are a size 10; above the jeans are size 4. One wonderful change has been in my face; I feel as though my face looks younger and my double chin has all but disappeared.The only downside: I've had to buy a new wardrobe! It's amazing how many wonderful pieces I have don't fit any more! Even my beloved cashmere sweaters swallow me!  But it's a small price to pay for being healthy.More on how I actually accomplished this in my next post. I did NOT adhere to any paid diet, but did this on my own with the help of one online app."},
{"title": "Beautiful Women Over 50", "date": "Saturday, September 22, 2012", "text": "Everyone needs role models, not just young children and teen-agers.  I have different role models for different qualities: spiritual role models, intellectual role models, and among others, role models whom I look up to for their beauty and youthfulness.  These role models are beautiful older women who are aging gracefully. They eschew both the \"grandmotherly\" look and the \"I'm a teenager look\", and are comfortable in their own skins.  I look for their beauty tips and secrets whenever I can find them.Catherine Keener is a beautiful woman over 50 whose sparkling personality makes her seem much younger, as does her gorgeous long, straight hair, and fresh make-up.Barbara Hershey is 63 years old! She has not succumbed to the trend of so many over 50 women to cut her hair. Note her fresh makeup with ample brows (very youthful looking). Goldie Hawn may have overdone the sun at one time, but it's hard to tell now. The over 60 grandmother looks gorgeous and as glamorous as ever by playing up her big, blue eyes, softening her blond haircolor, and wearing a color that absolutely makes her glow!Jaclyn Smith still looks angelic.Soft. long hair a lighter color than it was 30 years ago brightens her face.  Her round, flushed cheeks and bright eyes make her look well-rested and younger than her age. She is an excellent role model for graceful aging.Susan Sarandon is on everyone's list for a beautiful woman over 60.Jane Seymour cut her long, long hair to a slightly shorter length and went from stick straight to pretty waves and a lighter color which soften her face.Geena Davis's smile is her signature. White teeth and minimal make-up give her a natural beauty.Jerry Hall has been a favorite of mine since the 1970s.  She looks unbelievable!I believe that Mary Steenburgen is one of the few women who is actually better looking now than she was 30 years ago.  She credits her good looks to loving and being loved, always important, but I'm betting a good skincare regimen helps as does her great haircut, winsome smile, and slender form!Who would you add to this list of beautiful women over 50?"},
{"title": "Why I Love the Duchess's Style!", "date": "Saturday, August 18, 2012", "text": "As I peruse the fashion pages of the many magazines I look at,from Vogue to Lucky, and read different fashion blogs, I am just amazed at how many fashions I simply don't care for.  I'm not talking about the younger, kickier stuff that no woman over 40 should wear, but many of the outfits I see on celebrities who are 30+. One celebrity that I've fallen in love (her fashion sense, anyway) is Kate Middleton, the new Duchess of Cambridge. Now I am not a special fan of royalty or nobility, and I didn't really care for Princess Diana's style at all. But Kate has something about her look that I love.  She's young, so it may be caused by royal restraint, but she epitomizes good taste in fashion. The clothes she wears could be worn by anyone over 40 with very few exceptions (women who don't like their arms won't care to go sleeveless).  So am I saying that she is dressing like a middle-aged woman? NO. I am saying that she dresses so well and timelessly that even middle-aged women will look good in the clothes that she wears.  In the picture above,you see Kate in jeans (great fitting and slim)with a casual striped top (stripes are so in right now) and a pretty , fitted navy blazer. She looks great. The scarf adds just that extra touch that gives a bit of style. The espadrilles say casual.  Now what I also love about the Duchess is that she constantly reuses her clothing (some celebrities try never to be seen in the same outfit twice). Below, you see her in the same navy blazer with the great cut, a simple white shirt, the same espadrilles and possibly the same jeans.I even love her outdoorsy look her.  The boots are great, and you are never too old to tuck them into jeans. Above and below: classic looking coats.  It doesn't get any better than this! The wonderful cut emphasizes Kate's slim figure.  For those of us not so slim, the coats would have an elongating and slimming effect. The blue Missoni coatdress above is perfect for Kate's coloring. I love her monochromatic look which generally makes one appear slimmer (not that she needs it). She pairs the same outfit with two different pairs of pumps.  I love the grey suede! They are a bit high for some of us however.  She changes accessories with the occasion.Yes, she looks wonderful in red.  Note that the dress is well cut and fits her perfectly.  The secret to looking really good often is not an expensive wardrobe, but one that you've taken to a good tailor so that the fit for you is impeccable.Love this white suit, below. Two great dressy looks.   The lessons here:Fit is extremely important. How to apply:  Find a tailor, a good one (someone recently suggested to me that a man's tailor is best) and get your clothes tailored to fit you.  Even that wool skirt that you've been wearing for 5 years can benefit from tailoring if your body has changed or if it never fit you quite right to begin with. You'll know when the tailoring is working when your clothes not only look great, but they feel great when wearing them.Accessories can make a big difference     How to apply: If your budget is limited, spend more on your accessories.  Hermes scarves (or good quality silk scarves), pretty jewelry in sterling silver or genuine gold, different handbags (which can be used for years) can change outfits fast and help you to dress up or down.  (If you're budget is very, very tight, then buy good quality costume jewelry when it's on sale and buy classic pieces. Try outlet stores for your handbags.)  Good shoes are a mustSpend your money also on good shoes, even if you have to buy them on sale.  Your feet will thank you and you will look much better when your feet aren't killing you.Don't get locked in on the idea that there is only one pair of shoes that you wear with an outfit. Mixing up (and not necessarily matching up) can give you a different look.No bare legs with \"work\" clothing (dresses, suits)Of all the styles lately, the style of not wearing hosiery is the one I deplore most.  In the summer, when it is very, very hot - okay, but not with a business suit. And the rest of the year most women (not just women over 40) do not have skin that looks good without tights or hosiery, yes, even the flesh-toned kind.  Most have too-white skin or spend wasted hours at a tanning salon ruining their skin; leg makeup rubs off on clothes and chairs, and self-tanner is a pain, and really doesn't look very good in the winter.  They always look as though they have forgotten part of their clothing!Buy quality, not quantityThis one always bears repeating - buy the best you can afford, but don't feel you have to have a lot."},
{"title": "The Myth of French Chic", "date": "Saturday, August 11, 2012", "text": "On the Pont Marie  Longchamps bag, Cole-Haan sandals,Banana Republic top, Old Navy tee  To be a Frenchwoman!  That was one of my earliest dreams. When I was in junior high, I got really lucky when Dominique moved in next door to us, a 24 year old Frenchwoman whose American husband was in the service and always away.   She became my mentor (we didn't use that word then) and I frankly worshiped her.  She was from, of all places, Biarritz.  Heaven!  She had a wonderful French chic: a Sassoon style haircut in a reddish color when no one had Sassoon or was doing red. She didn't wear foundation often, but her skin was lovely. No matter what she put on, she was sexy - and she had 2 adorable litttle girls that I wanted for my own.  She was one in a thousand, so I was really lucky to have her living next door to me. She taught me a lot, but the best lesson was to be \"happy in your own skin.\"  I've just returned from Paris, and while I adore Paris, love, love the French (who were wonderfully sweet and very, very friendly), and will still look to it as a style capital, the idea that French women are undeniably chic is a myth.  I was all over Paris, from Montmartre to the Bastille, to the Left Bank, to St. Germaine, and the number of truly chic women I saw could be counted on the fingers of one hand. True, I didn't see tacky, that is the purview of the Americans, but I didn't see chic either. I saw women who dressed okay, pretty young girls in colorful dresses (the greatest difference between Paris and the D.C. area where I live), but not the kind of style that makes you want to follow a woman down the street and say, \"How do you do that?!\"  On Blvd. St. Germain, I saw some women who looked elegant, but no more so than those I see shopping in Georgetown or at Tyson's here in the metro area.   However, that does not mean that French women do not have much to teach us because they do.  If we took their lessons about grooming, skincare, clothing, and accessories to heart, we would look better, be happier, and probably have more money. Why? Here's why:  1. The first lesson: self-confidence (being happy in your own skin). It's powerfully chic and very sexy!   2. Less is more.  You don't need all those clothes.  Buy good clothes, but only a few (two pairs of jeans tops!) You can afford the good clothes if you don't feel that you have to go a month without wearing the same outfit.  French women wear the same outfit more than once a week, but they change it up with accessories and other pieces.   3. Buy good accessories: own a Hermes scarf and wear it different ways.  Make sure that you have good, real jewelry, a really good umbrella, a decent hat to wear when it is really cold.    4. Your shoes should be comfortable, but still look polished. No bulky white trainers. A small heel because you walk a lot.   5. Don't wear your workout clothes unless you are working out.   6. Spend your money on a good haircut.   7. Take care of your skin. Makeup removal every night! Use creams every night and day as well as sunscreen.  Don't try to get a super tan.   8. Don't pile on makeup, but always wear a bit of mascara, blush, and lipgloss at least.   9. Make sure that your entire wardrobe for any season could fit in a single armoire.   10.  Amend your diet the minute you are one pound overweight.   11. Femininity is good.   12. Every item you purchase must be becoming to you - color, shape, fit, style.Ines de la Fressange, the current style icon is 53 years old.Marion Cotillard is classic perfection.Big handbags are everywhere in Paris. Chic outfit, but you can tell it wasn't bought as a \"set\".French women wear lots of neutrals with pops of color.So, yes, there is more, so much more that French women could teach us that they take for granted."},
{"title": "Off to Artomatic", "date": "Tuesday, June 26, 2012", "text": "Off to Artomatic on Saturday! Artomatic is a wonderful even where an entire office building is taken over (this year in Crystal City) in order to display work from artists using different media. The art we saw was so interesting we only made 2 floors of the 8!  But we were rewarded with fabulous and interesting works and installations.  The wonderful part of Artomatic is that any artist who pays $110.00 can have a space to showcase his/her art, so even artists who have never shown before get a chance to display their work.    Dress had to be very casual since we walked for hours; comfortable shoes a must!  My shoes are by Blowfish, very comfortable criss-cross wedge sandals. Casual Old Navy tee, and Land's End pants in khaki (flat front, side zip with no pockets).  Bag is Prada quilted navy tessuto with chain straps. Gucci watch. Cluny Grey gemstone necklace featuring aquamarines, rubies,sapphires, emeralds, and 14 karat gold-filled accents.  My favorite necklace is this Portuguese cross, a Christmas present from my husband when we were in Portugal. Perfume: FracasNail Polish: Essie, A-dor-a-bal"},
{"title": "What I'm Wearing", "date": "Thursday, June 21, 2012", "text": "The shorts are new for me. I'm not sure how  feel about them yet, but after wearing them a few hours, I've found that they are quite comfortable.  I'm trying them out for our trip to Paris.  We'll be taking my grand-daughter to Euro-Disney and I'm thinking that it is going to be too hot for long pants.  And you know how I feel about crops!  These have a cuff and seem a little dressier than most shorts. I'm wearing them today with a turquoise tee from Old Navy, my favorite Franco Sarto snakeskin sandals, and my Hermes Andalucia scarf.  David Yurman watch. Cluny Grey mixed gemstone necklace.I find that I often wear my hair in a ponytail.  I wear a high ponytail although I've read that at my age, one isn't supposed to.  But it's the most comfortable for me and I think looks better than a lower ponytail (which also bothers the back of my neck).Below, in keeping with being truly realistic about what I wear and how I look, I have not done anything to the photo below. (I see some messy eye makeup!)  Estee Lauder Fresh Air foundation; Armani blush in #10; Estee Lauder lipstick. Underneath, Estee Lauder Daywear moisturizing cream with SPF 15. And yes, my hair needs trimming badly!"},
{"title": "How to Look Slimmer for Summer", "date": "Sunday, June 17, 2012", "text": "On my way to do errands.  I'm on a diet, trying to do Weight Watchers online. The best part is the being able to keep up with what you eat online and have the app automatically gauge points for me.  The hardest part is to get exercise.  I get busy and forget to take a walk or do something active.  I've got to work on that! Today, I'm wearing very inexpensive clothes.  I've had the pants for about 4 years; they are from Land's End and are their side-zip flat fronts that they unfortunately don't make any more (why!?).  The tee is also from Land's End. Although the quality of their clothing has sadly decreased lately, I do like their tees that are fitted.  They are more slimming as long as you order the right size. The important thing is to wear a bra that fits and to keep everything smooth that you are wearing.Watch is David Yurman; shoes are Franco Sarto. Rutilated quartz bracelet is a Cluny Grey.I've found a new go-to nail polish that I am loving.  It's from Essie and is called A-dor-a-bal.  It's a soft, clean but not bright white colour that looks great for summer!"},
{"title": "Capris: Please, Just Say NO!", "date": "Friday, June 01, 2012", "text": "It's that time of year: the time when many otherwise chic, sensible and even elegant women feel the heat and decide to wear that which is lovely on almost no one!  I speak of course of cropped pants and/or capris. I've had a longstanding animosity for what was known in the 'fifties as \"pedalpushers\" probably because I was so skinny in grade school that my mother would not let me wear shorts, but instead put me in cropped pants.  They usually just covered my kneecap in a very awkward way and sometimes made sitting and other movement problematic because they were binding there - that is, until I had worn them for several hours and they had stretched out or ripped and were even more unsightly.  I am (just last week) 61 years old, and well aware of the changes time has wrought: no more shorts for me outside of my house and the beach. Cropped pants would seem to be a good alternative to the hot summers here; they would cover my upper legs and yet be cooler than long pants.  I understand why women want to wear them.  But if you look at the evidence, better to suffer the heat or put on a simple short dress than wear one of the most unbecoming garments ever constructed.  Above, a young, very pretty, very thin model wears cropped pants and looks, well, okay. Now if you were going to say that she looks fabulous (which she does in face and body), stop and really think about what she is wearing.  Yes, she has long legs and thin ankles - a must for wearing cropped pants.  But look at how disproportionately wide her hips appear in these pants! She would look much sexier wearing shorts or long pants.   Above, three chic women who don't look all that chic thanks to the crops.  Cameron Diaz looks ready for the office from the waist up, and ready for the gym shower room from the waist down.  I adore Gwenyth Paltrow but I have never, ever seen her look worse! If she looks like this, just think how you will look with that 20+ extra pounds you've put on in the last few years.  Who is thinner than Victoria Beckham with her invisible hips?  Still, not a good look for her either.Perhaps one of the worst aspects of cropped pants is that they are heavily advertised to, well, heavier women.  The result is not pretty or chic. And if you are dressing to look slimmer, my first tip is to avoid cropped pants.  Above, she needs balance for those hips, even though she has worn high heels and does have good looking ankles.Below, if you are an apple, stay wwwwwwwwway away from cropped pants.These casual cropped cargoes are good if you are on an archeological dig; otherwise, just say no!Above, these cropped pants stop at the worst possible point on this plus model's heavier legs; she's compounded the squat look by wearing flats with crossed straps that hit right at what should be the thinnest part of the ankles. Yes, this is a fashion problem. Imagine how much better she would look with long pants and even a low heeled pump.Above, while a bit longer, these crops are wide at the bottom so that they will soon wrinkle and flare out above these flat thongs.   Cropped pants are not always terrible. If you look below, you see some cropped pants that actually look chic, but note that they are really what some would call \"ankle\" pants rather than cropped.  The pants stop at the smallest part of the ankle - good if you have pretty ankles and wear the right shoes.The right shoes are usually heels although not always. Below, since these pants are longer and the model is very thin and tall, she can go for flats. Notice though that while her sandals have crossed straps, they are well below the small of the ankle.   Above, yes, it's one of the Olsen girls; keep her in mind the next time you decide to try on cropped pants if you are under 5'6\" and weigh over 130 pounds.  I realize that some of you may think I'm harsh, but remember, I'm talking about what looks good on a woman over 50, and what will look chic.  I have sweats I like to wear (and often do), but I don't try to accessorize them and think I will look elegant.  Do you have a picture of yourself in cropped pants that you think looks great? I'd love to see you!  Please share!"},
{"title": "Ready to Do Errands!", "date": "Sunday, May 27, 2012", "text": "I like doing errands when I'm on my own; doing them gives a different structure to my day, and often provides me with that wonderful feeling that I've been productive and busy - a feeling that tends to make me more productive and busy.  Sometimes the best time to do errands for me is as early as possible.  Eager to be on the go, I don't really dress up (after all, I'm buying cat food, doing a quick grocery store run, stopping at the hardware store, the frame shop, the post office).  I often don't even dry my hair if I am really in a hurry!  I pull it back in a messy, wet bun and use one of those large clips in a colour the same tone as my hair.And of course, I have to wear my gold Portuguese cross. With it on, I always feel ready for anything!Just so I'm not too scary, I do put on minimal makeup. I put on a bit of eyeliner and the lightest coat of mascara possible. Lipstick is a must. And yes, my hair is wet here!   Below, for errands, nothing is quicker than jeans and a white tee.  Low platform sandals are easy to run about in, and cool at the same time.  Mine are Franco Sarto, a brand that fits me well and has the added plus of being very comfortable! Here my cat Cluny decided that he had to get in the picture, too. On a slightly cooler day I wear a thin cotton, lace-trimmed 3/4 sleeved jacket I bought at Banana Republic over 8 years ago.  Underneath, a cotton tee from Old Navy, and cream cotton no waist pants.Perfume for errands?  A light spritz of Bulgari's Jasmin Noir, fresh, light, and unobtrusive. Gucci watch."},
{"title": "SALES For Summer!", "date": "Thursday, May 10, 2012", "text": "I hear so many people griping about the price of clothing and accessories, and the truth is, they are expensive.  But with some judicious shopping, you can find some very nice things.  I love internet shopping for sales at high end stores.  Of course, I have a good idea of the size that I will take, and a knowledge of what will work for me and what won't.  I have also learned not to be fooled by the skinny models who look unbelievably chic and sexy and to do some simple things like look to see what material clothing is made from.  Here are some things that can be found on the net right now.At SAKS:  Have you always wanted one of those unbelievably beautiful Judith Leiber jeweled bags but couldn't afford it? Try sunglasses instead. Judith Leiber makes quality products and her sunglasses are tres chic! These can be had for $139.00, and there are others.SAKS Judith LeiberYoana BaraschiCap-Sleeve Dress/Red:   If you have the figure for it, this is a great dress for summer dining out. And it is still available in sizes 8, 10, and 12. The curved pockets are quite slimming (providing you don't put anything in them), and at 89.00 this is a steal! It is made of viscose which does breathe. The cap sleeves hide just enough of the underarm to be attractive.  The next dress is also Yoana Baraschi and also is 89.00. In black with wonderfully slimming vertical blue lines, this dress is sure to be a favorite.  Both can be found here. I love flats!  These are perfect for summer since they are decoratively vented.  They also come in tan and black. Pour le Victoire flats are only 69.00.Don't you need a new watch for summer?  Breil square stainless steel and mother of pearl chronograph watch is fairly easy to read and looks great on your wrist with its bone-colored band and rose gold plated rim. Retail price is normally about $750.00, but it is on sale for 215.00"},
{"title": "I'm Loving Pink!", "date": "Friday, May 04, 2012", "text": "It's been years since I've worn pink lipstick, but lately I'm loving it for Spring. Below, the pink lips look great with my pink cashmere jacket (worn for the last time this year since 80 degree weather is on the horizon).I like to wear hot pink with black and white; in this, case, cream slacks, black tee, pink cashmere jacket, pink Cole Haan loafers - my favorites because they are sooooo comfortable.  I can wear their driving shoes (like these) for hours and hours of walking,  They're great for doing errands on a busy day!Below, I'm wearing my Portuguese cross, Cluny Grey gemstone longer necklaces, and David Yurman ring and bracelets.  I love piling on bracelets!I'm also loving L'Occitane Verbena hand lotion - a sharp dash of freshness everytime I put it on my hands. Thank you, Fernanda!"},
{"title": "Clothes for Women over 60", "date": "Thursday, April 19, 2012", "text": "Yes, I admit that I'm over 60;  next month I'll be 61. I still try to dress fashionably but comfortably as well since comfort means a lot to me these days.  Yesterday was a grey day here in D.C. so I dressed to match with grey cotton (with 2% stretch) pants (Eddie Bauer) with a Hollywood waist (that is no waist and the pant curves slightly about your natural waist - very comfortable and leaving no marks), a white Carole Little tee with a curved neckline and a fitted shape, and a 3/4 sleeve light grey cotton cardigan with a ruffle around the bottom. Anne Klein loafers and trouser socks completed my outfit. I wore a Cluny Grey necklace and my David Yurman watch.My diet starts today; there is nothing like putting a picture of yourself on the internet to see that you need to lose weight!"},
{"title": "Long Hair Styles for Mature Women: We're Keeping Our Locks!", "date": "Friday, April 13, 2012", "text": "So, yes, I've turned 60 (actually last May), and no, I am NOT going to cut my hair!  Above, a smoother look, and below, caught off-guard.  I am so tired of everyone assuming that just because one is une femme d'une certain age that one must cut one's hair.  I love my long hair.  It's versatile, it's good to hide behind occasionally and I love the way it feels more than anything. And yes, I'm on a crusade: Don't cut your hair just because you are over 60, or 50, or 40.Below, Jaclyn Smith looks gorgeous with her long layers of hair. I'm not sure of her exact age (some sources say that she is 66), but she is definitely over 60 and looks great with her long hair. Can you imagine Jane Seymour without her long hair? She is 61 years old.  Can you imagine her in a butch cut or a pixie? Catherine Deneuve is supposedly 68 years old. She looks great with her longer locks. Above is a picture taken this year. Below is a picture taken when she was over 50.So Jennifer Lopez is only over 40, but do you think she's ever going to cut that gorgeous hair! I think not!Below, at age 60. Lynda Carter is still beautiful.  Her hair is part of her attraction. The second picture was taken before she was 60 (a couple of years ago) and her long hair is smashing!Remember Catherine Bach from the Dukes of Hazzard. Her hair still rocks!In the 1970s, Marisa Berenson was known for her gorgeous hair that was sometimes, sleek and smooth, sometimes wild and unruly, but always fabulous. She is well over 60 now, and her hair looks perfect for her!   If you are a mature woman and long hair looks great on you, why cut it? It can also help camoflauge a sagging chin! Tweet!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0];if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=\"//platform.twitter.com/widgets.js\";fjs.parentNode.insertBefore(js,fjs);}}(document,\"script\",\"twitter-wjs\");"},
{"title": "Casual Style", "date": "Monday, April 09, 2012", "text": "Okay, we all hate to roll out of bed in the morning, and if you have little ones (or not so little ones) to get off to school, it can be very tempting to throw on anything just to get them there. But if you don't have to go on to work, or as so many of us, you work at home and can wear whatever you want, are you guilty of looking, well, frumpy?  Check out these celebrities who are known for their style on their morning school runs. What they have on is deceptively easy to put together, and looks very - put-together! Above, Kate Winslet looks great!. Yes, she has an expensive handbag and Chanel shoes, but anyone can copy this look for much, much less!   What to do: pin clean hair up in a messy bun; slip on comfortable flats (the Chanel look in ballerinas is so easy to find at almost all price points), and throw on a black short-sleeved dress. What makes this so simple is the shift dress (you can even try a knit polo style dress), bun, and shoes. Quick, and you'll still look fantastic.Okay, it's Angelina Jolie. But look how simple: if you have long hair, comb it straight back and let it fall naturally. If you wash your hair every morning, all you need here is a blow dry that you do yourself, save the hot rollers or curling iron for when you get back home. One sweater, cashmere is ideal, a pencil skirt, and tall heels in black. The only real upkeep with skirts and dresses is keeping your legs waxed/shaved.Jeans can look great and don't have to look like \"mom\" jeans. The key here is fit.  They cannot be baggy in the rear, hips, or thighs. Jennifer Garner looks put-together with simple flats, a white tee, and a short black jacket. Her hair is simple. If you don't trust your locks to stay quite as sleek, pull them back in a low pony tail. Below, Claudia does the jean thing, too.  Here they are slightly flared, but fit well in the rear, hips, and thighs.  A simple button top worn over the jeans needs nothing more than a scarf and sunglasses to look chic. Again, don't think your morning hair will look like this? Pull it back in a sleek ponytail or a messy bun."},
{"title": "Lips and the Best Mascaras", "date": "Thursday, April 05, 2012", "text": "As we get older, our lashes often thin, and mine are no exception.  I got tired of wearing false eyelashes for the lush look that was a part of my signature eye makeup and have been looking ever since for a mascara that both lengths and thickens my lashes with making them look spidery. I've finally found the right concoction!I am using two, yes, two mascaras, and both are by Maybelline.  I first put on Illegal Lengths mascara to get the length that I want, being careful not to let it dry between coats.  It goes on best if you apply until you get the length that you want without letting it dry between coats.  Then, I use the Volume Express mascara, Falsies, for thickness.  If this sounds, goopy and like too much, it really isn't.  I like the \"winged\" Falsies best, I think.  I apply a couple of coats of it starting close to the lash base, and finally, I have the lashes I want!  The Falsies in waterproof is also decent, too.  I used it lately when I was in South Africa and Mozambique to keep away racoon eyes.  It worked! Beauty Tip:  If you have very dry lips all the time, try this. Your toothpaste may be drying your lips.  Before brushing anytime, put a thick coat of vaseline on your lips, then be sure to rinse lips after you finish brushing.  Toothpastes containing baking soda are especially drying to the lips.  I've tried this and my every so dry lips are finally getting soft and smooth!"},
{"title": "The Simply Luxurious Life: Rules Of Style – Inès de la Fressange", "date": "Friday, March 30, 2012", "text": "The Simply Luxurious Life: Rules Of Style – Inès de la Fressange"},
{"title": "Olay Total Effects  Anti Aging Body Wash", "date": "Thursday, March 29, 2012", "text": "Total Effects 7-in-1 Advanced Anti Aging Body Wash - Deep Penetrating MoistureThe skin on my body is so dry that its condition even has a name: ichthyosis.  I do everything I can to keep it moisturized, and it has been a difficult battle even since childhood.  I love Aveeno lotion and it works as well as anything I have ever tried, but I'm always looking for more. Enter Olay Anti-Aging body wash. This great body wash helps with moisture in a wonderful way, keeping my skin soft and smooth even before I put my moisturizer on.  It also seems to \"tone\" my skin as well. And unlike so many other products that work well at first, then end up giving me a rash, after a year of using this, no ill effects - only good.  I've used the exfoliating version also, but while it did okay (exfoliation is not the best thing for sensitive skin), the body wash is fantastic.  No more old lady legs!"},
{"title": "Ange ou Demon? Perfume Is a Must", "date": "Tuesday, March 27, 2012", "text": "Perfume should be a part of every woman's beauty routine.  It should be subtle and should match your mood, identity, or style in some way.  I tend to like to have a signature fragrance myself, one that I wear constantly and layer in all its forms.  In the 1980's through the 1990's until the formula changed, it was Sung by Alfred Sung.  It just smelled good on me and people commented on it in a positive way constantly.  Then, it was Escada - the original Escada with its wonderful jasmine.  Then Escada became hard to find. I had  Boucheron, and Fracas when the mood struck me, but neither could be my signature.  So, I'm still looking.  This year while traveling in Africa, I bought perfume and lotion in Maputo, Mozambique - Givenchy's Ange ou Demon.  I love it!  I don't think it can be my signature, but I am enjoying it.  Notes:   top notes are mandarin, white cumin and saffron which open to the florals of lily and orchid combined with ylang-ylang; rosewood and dense oak moss absolute continue and lead to a drydown of  powdery and sensual Tonka and vanilla. It lacks the jasmine I love so much, but for now, it's the perfect Spring fragrance - not too sweet, and just sexy enough.  Do you have a signature fragrance? Note: This is not a sponsored post, simply my own opinion."},
{"title": "Abreva: The Cold Sore Remedy", "date": "Monday, March 26, 2012", "text": "Unfortunately, I am one of those people who has always suffered from cold sores. Although I can sometimes go for a couple of years without one, eventually one is going to pop up - and it seems the season makes very little difference; I've had them in cold season and also in the middle of summer.  Oddly enough, the way the cold sore feels is a thousand times worse for me than the way it looks, although that is bad enough. But I have found something that works - finally.  And they are not a sponsor of mine, not do I receive anything at all from them.   The best cold sore treatment I've tried is Abreva.   Abreva really does work.  In the last week, my cold sore I could feel starting was averted simply by applying Abreva to it twice!  The package comes with funny little tubes that you break open for one application (although it bugs me that there is so much in there and it says for you to use each tube only once).  The end of the tube is basically a Q-tip with the clear ointment (did I say that there was lots of it?).  Put it on the cold sore and that's it!    No comparison to my Mother's old remedy of Campho-phenique!  Remember that avoidance is best.  Wear a sunscreen on your lips just as you do your face, keep your lips moisturized (not just with lipstick - I like to wear vaseline at bedtime, and the rest of the time a moisturizing lipstick and/or a good lip balm (not Chapstick)."},
{"title": "SPF - Sunscreen is NOT Optional!", "date": "Friday, December 03, 2010", "text": "Be sure to wear a sunscreen everyday!  As careful as I have been with my complexion, it is not something I have always done.  Going about day to day life, I often used a foundation with an SPF of 15, but often I didn't.  Now I know that you can prevent signs of aging by wearing a sunscreen year round, yes, even in the winter when all you do is hop in and out of your car to do errands. And remember, your foundation may have a sunscreen, but most people do not wear enough foundation to get true protection.  The answer is a moisturizer with sunscreen and a foundation with sunscreen. Wear both - everyday - even in the dead of winter!"},
{"title": "Don't  Forget Your Ears", "date": "Tuesday, November 09, 2010", "text": "One of the often neglected body parts are our ears!  Oh, yes, we adorn them with cute dangly earrings, expensive baubles; we try to keep them clean, but we forget that our earlobes can show age, too.  Every night when you put on that special cream to lift, moisturize, and/or erase your wrinkles, don't forget your earlobes!  They need all the moisture they can get.  In the morning, when you put on daytime treatments, and especially when you apply your sunscreen (you do wear sunscreen everyday, don't you?) make sure that you pull your hair back securely and slather your earlobes and the outside edges of your ears with moisturizer and your daily SPF.Remember also not to sleep in your earrings since doing so will pull your earlobes down."},
{"title": "Foundation: Armani VS. Estee Lauder - and the Winner is...", "date": "Sunday, October 31, 2010", "text": "There has been so much hype about the new Giorgio Armani silky foundation that I felt that I had to try it.  Armed with my Neiman's charge card (or rather, in this case, my husband's) I set out to Tyson's to see if it was all sold out.  It wasn't!  It had a nice silky finish and I bought a bottle and took it home. Now at this point it is probably important to add that I have stuck with Estee Lauder's foundations since the 1970's and been ever so happy with them  My favorite and the best all-time foundation is Estee Lauder's Fresh Air Make-Up Base; for a while in the 1990's I couldn't find it anywhere, but luckily it's available again and I am happy again!  During the interim when it wasn't available, I had used Double Wear by Estee Lauder and was happy enough with it, but nothing beat the Fresh-Air make-up.So I paid by $59.00 to try the Armani make-up (over twice the price of Fresh-Air's humble $24.50 price tag). The result: it looked fairly good, and it was different.  Very light, but there was coverage unlike most \"light\" make-ups. However, after wearing it for about 5 hours one day, I happened to look in the mirror while I was wearing my reading glasses and noticed that I had a bit of flaking near one side of my nose and a rather dry looking patch on the other side. I no longer had that refreshed look of well-moisturized skin, but rather skin that said, \"I've been on the overnight from Heathrow to Dulles and my skin feels it!\"I washed off the Armani and put the Estee Lauder back on.  It looked wonderful; the color was richer, but matched my skin, and it gave me a half-dewy, half-matte look that requires no powder.  I've been checking everyday since with my reading glasses to see if the look is lasting after 5 hours, after 10 hours... and it is!If Estee Lauder ever gets rid of Fresh-Air, I may have to use the Armani, but until then, the winner is - Estee Lauder's Fresh-Air make-up base.  Never fool with a winner!!  P.S. You can find Fresh-Air make-up in the standard department stores that sell Estee Lauder, but they don't seem to stock a lot of it.  I usually buy it directly from the Estee Lauder website."},
{"title": "It's Going to Be a Blue Spring", "date": "Wednesday, February 25, 2009", "text": "Blue for SpringIt's going to be a blue Spring - and I mean that in the happiest way possible. Blue, especially aquas and turquoises, are very in for Spring, and that's good news for most of us since blue is an almost universally becoming colour. Feel that you can't afford any of the new blues in these trying economic times? No worry, it's easy to add a touch of the new blue to your wardrobe without going into a personal recession. Think of accessories: *Great sunglasses in blue from Jil Sander's new sunglassesline*Blue jewels (try handcrafted artisan jewelry to get both real jewels and an affordable price) *scarves - yes, they are very in right now especially if they are long enough to double around your neck and hangdown to your waist. * *Find a shocking turquoise belt to brighten up the tobacco coloured dress or pants from last year (or the year before)or add it to a pair of light grey slacks.* Turquoise or blue shoes make a real statement when worn with an all-black ensemble or really many different monochromatic outfits. The good news is that if you can't afford them at first, you're probably going to beable to find these on sale just a bit later in the season. Always remember that dressing chic is mainly an attitude and keep the attitude strong!"},
{"title": "Essie's the Best!", "date": "Tuesday, February 24, 2009", "text": "I have a love/hate relationship with nail polish.  On the one hand, I like how it looks and makes my hands look (and my hands do need help).  On the other, there are not many things that look worse or that will downgrade your entire appearance more than having chipped nail polish.   My new favorite\":  Essie.  I first came across it when getting a manicure/pedicure in Arlington, Virginia.  Then my daughter-in-law gave me some for Christmas.  I can't find it here locally, but I buy it through amazon. com simply because I usually have other items to purchase at the same time.   Essie goes on smoothly, dries remarkably quickly without any drying agent, and comes in quite a few delicious colours. My only caveat is that I bought a colour (I think that it was called Beach Party) a sort of ballerina slipper pink, that had no shine whatsoever - totally matte so that it looked as though I had messed up my nails in some way. Otherwise, dark colours and their light pinks (try No Pre-Nup) are fantastic and have lasted a week for me - an unbelievably long time!"},
{"title": "The Cream de la Creme!", "date": "Tuesday, August 12, 2008", "text": "I have extremely dry skin (on my body - my face is slightly different). In fact, my skin has a condition known as ichthysosis (the ichthys from fish) which basically means fish-scale skin. And if left alone, it would look very much like fish scales. Luckily my case is not as severe as it could be, but it still makes finding the right lotions and creams a challenge.Of course, I love, absolutely love, Aveeno lotion. It is the cream that I use on my face - the only cream, and I've used it for years (I've received many compliments on my complexion which is rather porcelain-like; I attribute the complexion to Aveeno and to good sunscreens). However, finding a good body lotion/cream is a different matter.  I seem to need to rotate creams in order for them to remain effective.  The body butters from The Body Shop and Bath and Body Works are some of my favorite concoctions (I loved the ones with grapeseed and with pumpkin, both of which are now discontinued), but I've found a wonderful alternative.The Wildflower & Thyme Company in Waterloo, Illinois makes a cream to die for!  This body cream supplies just what my skin is hungry for: grapeseed oil, jojoba oil (my two favorites), avocado oil, Vitamin E, aloevera, and other goodies for your parched skin.  And best of all, the nice people will scent your cream with your choice of fragrance:  LAVENDER/ROSEMARY, PATCHOULI, ROSE, VANILLA BEAN, LILAC, PEACH NECTAR, JASMINE, LEMON VERBANA, GARDENIA, CINNAMON, MUSK, TROPICAL BREEZE, CUCUMBER MELON, PEPPERMINT, HONEYSUCKLE, GRAPEFRUIT, PLUMERIA, SANDALWOOD AND BROWN SUGAR, EVERWOOD OR FRAGRANCE FREE.  The Jasmine is my favorite, and it's a good strong jasmine so that the fragrance lingers.It also isn't as greasy as many of the body butters (those with shea butter especially), and it rather inexpensive at about $1.00 an ounce.You won't believe how great this cream is - and no, I have no affiliation whatsoever with the company.  I found them one night while frantically googling for lotions with grapeseed oil and jojoba oil together.You can e-mail them for information at wildflsoap@aol.com. At times they sell on ebay under the id cacook1.  Here is a link:  http://cgi.ebay.com/BODY-CREAM-ALOE-VERA-JOJOJBA-GRAPESEED-AVACADO-VITA-E_W0QQitemZ300249052852QQihZ020QQcategoryZ21205QQssPageNameZWDVWQQrdZ1QQcmdZViewItemskincare beauty skin fashion wrinkles anti agingaging beauty tipswomen skin skincare dry skin skin care tanning sunless tanning lotion moisturizer complexion"},
{"title": "Back with Good Products", "date": "Saturday, August 09, 2008", "text": "I've been concentrating on other things lately and have let this blog lapse shamelessly - but now I'm back! I'm not sure that it was the discovery of good new products that have brought me out of hiding or the completely hideous fashions that I've seen everywhere lately (more on those lately), but here I am again. First new product: Not necessarily a new product, but great are two mascaras, both by Lancome. The first is Lancome's Hypnose, the one I think that I cannot live without and that will take the place of the single best mascara, Elizabeth Arden, I've ever used that was discontinued years ago. Lashes are longer; lashes are thicker; lashes are curled, and they do not have that spikey look that does not flatter older women at all. The second is Lancome's Fatale, a mascara with a funky brush that takes some getting used to, but that will probably become your favorite mascara if Hypnose is not.        Stayed tuned for the next great find: a wonderful cream that moisturizes and lifts your spirits with its wonderful fragrance!fashion fashion news beauty hair women skin skincare dry skin skin care tanning sunless tanning lotion moisturizer complexion sexy hair haircare aveeno The Daily Fashion and/or Beauty Tip"},
{"title": "Lips Are IN!!", "date": "Monday, October 08, 2007", "text": "Body parts, just like clothes, go in and out of style (yes, there was a time when it was popular to be very small-breasted).Right now, lips are in, so a few words of warning are in order.I should say \"big\" lips are in. Think Angelina Jolie. No argument whether they are real - it doesn't matter - she looks gorgeous. So if you are trying all the lip plumpers on the market or considering going for those fat or silicon injections, keep a sense of proportion. If you've ever seen pictures of Angelina when she was a little girl, then you know that she was born with full lips (that or she began getting injections at a very young age). If you opt for the injections, think carefully about the lips that your face will carry. Angelina's face is strong, the lines appear as if she were a carefully chiseled piece of sculpture. Her large eyes balance her lips. Is this you?However, if your face is like Lisa Rinna's, forego the overplumping. Lisa Rinna has a great face - not perhaps as young as Jolie's nor as chiseled. Her lips make you look a second time at her face - in shock.  If you go to a plastic-surgeon and say that you want lips like (fill in the blank), then you may end up a trifle overdone.Remember that the key word here is proportion.A second warning: don't go for someone else's lip shape: enhance your own and you will look the best.Updates: check out Bath and Body Works online for their great supply of Wexler products.Also, for those of you looking for a new coat this fall season, check out Kim Cattrell's  classic camel shawl coat.  This is the look to aim for: classic, easy-going, flattering.Finally, AVOID BLUE EYE SHADOW!!!fashion fashion and beauty blog   fashion trend accessories shopping hair beauty beauty problems celebrity fashion don'ts celebrity fashion hair style Angelina Jolie Lisa Rinna wexler products lips cosmetic surgery plastic surgery"},
{"title": "Uh, Oh, Fashion Faux Pas on the Celebrity Scene", "date": "Friday, September 14, 2007", "text": "Okay, we all can't look like Jennifer Lopez does here - but we can try! Great hair, sexy, but well-groomed.  Revealing dress, but she has the body for it. Good make-up, but not overdone. Clear complexion, great smile...she really looks beautiful! How close could you come to having someone say the same things about you - no, not look like Jennifer, not even wear that dress, but have well-groomed hair, appropriate to the occasion, wear clothing that shows off (or reveals ) your body in a flattering way. Make-up not overdone, but applied well, sparkling complexion, clear eyes, and, oh, yes, a wonderful smile (we can all smile!)?  Oddly enough many celebrities can't live up to these demands as you can see below.Courtney Cox has gorgeous deep blue eyes, pretty make-up that emphasizes them without being too much and - what pretty hands! However, I want to scream, \"Go wash your hair!\" Or is it wet?  If this was a deliberate do, whoever did it needs to go off the payroll, pronto!They were adorable once upon a time; now they are supposedly on their way to becoming fashion icons.  ( I'm not sure why.) I always get them mixed up, so I'll just say to the twin on the right - you look good except for that horrible expression that makes you look as though you just got fat injections in your lips. I'm getting really tired of celebrities pursing their lips this way every time a camera comes near.To the twin on the right - brush your hair!!! I really chose a pretty flattering picture of these two - there are far worse - mostly involving nightmare hair days.An animal is not a fashion accessory! Nor should they cost as much as a Hermes bag. Have you heard of the Humane Society - there are plenty of animals there that really need a hug. (But if you do try this old trick becoming new again of using an animal as a fashion accessory, do please get an animal in proportion to your size; any animal that could get lost in your chest area is not proportional).Do I really have to say anything here?  Yes, I do.I wore that same dress in the second grade, only it was pink. And my mother had the good sense not to make me wear black tights with it.fashion fashion and beauty blog Jennifer Lopez Olsen twins Britney Spears fashion trend accessories shopping hair beauty beauty problems celebrity fashion don'ts celebrity fashion hair style Sarah Silverman"},
{"title": "Dressing Slim: The Tops That Work", "date": "Monday, September 10, 2007", "text": "Fashion changes constantly of course, although it reverts  to styles that were once in fashion years before.  If you don't believe that's true, just wait until you're over 50, and to your surprise you will find that \"something old is new again.\" Happens all the time. Of course, vintage is recognized as vintage because there's always a different take on the fashion: the material is very different, the colours are modern, the style is old but the length changes. This is why I cannot pass off the mini I got married in (the first time) for those that are in style now.Of the newer styles, one that I almost passed on that would have been a great mistake is the Empire waist look, both in dresses and tops. Why was I going to pass on it?First, because I remember wearing the Empire waist dresses in junior high - not my favourite time period (circa 1965). Secondly, I associate a lot of the Empire waist with clothing worn during pregnancy - not my favourite look either.    But I was wrong. Instead of making a woman look like she's pregnant or has a gargantuan tummy. the Empire waists today are cut subtly and naturally and give a pleasant shape to the body, often emphasizing a good bustline and making the most of a small one, and hiding a multitude of faults, including a protruding tummy and wide hips.The tops (such as these from Anthropolgie, a favourite online store) have shape and give shape to a thickening middle. The long tunic you see above also have the virtue of de-emphasizing large hips and tummy. In a solid colour with good tailoring details, you will look fashionable and slimmer!The second top perhaps really isn't an Empire, but has the same look in many ways. Its shaped with darts that lead the eye to the center of the decolletage ; its lacy neck is feminine and sexy rather than froufrou and it's almost 3/4 length sleeves hide the upper arms (which are sometimes a bit less than beautiful on some of us).  Just make sure that it is not too low!The cummerbund top (to the left) has the flattering (and usually slimming) V-neck, and sleeves that aren't skin-tight.  The Empire waist is subtle, and the vertical lines of the bust area both lead the eye to the bustline and give the illusion of slimming. The blouse is cut so that the waist is shaped - which means that it will give you some shape instead of hanging like a square cut boxy tee. The wider sleeves give a feminine look, but once again without being froufrou.The great thing about these, too, is that they work for any age. Even if you are over 60, you can still wear these tops and look age-appropriate.Finally, dresses with an Empire waist can be even more slimming than the tops. Be careful about the length however since a too-short Empire dress can make you look like a sausage with a bit of twine tied around it. A longer length or below knee length is usually best if you are over 40, and wearing the dress with boots is even more flattering. Also pay close attention to the neckline: low necklines with a V or a higher neckline look good. Both the red and brown Empire waist dresses here are flattering to the slightly overweight figure.   However, the fuschia dress with the square  cut neckline  screams, \"WIDE\".  If you're even slightly overweight or busty,  run screaming from this one!By the way, the best way to look slimmer? Get slimmer! Start your diet today, and start exercising, too.Note: all the clothing on this  entry from Anthropologie.com.fashion fashion and beauty blog fashion trends dressing slimmer dressing when overweight dress beauty fashion blog fashion tips shopping fashion style fashion advice fashion guide sexy clothing"},
{"title": "It's After Labor Day!", "date": "Thursday, September 06, 2007", "text": "It's after Labor Day, and you know what that means.  Yes, you must put away any white shoes and white pants that you have been wearing - that is if you are in the USA. If you are in Brazil (or anywhere else below the Equator)you can ignore this rule; however, even Catherine Zeta-Jones shouldn't wear white pants in the US after Labor Day - and wearing white shoes is infinitely worse! While we are on some \"rules\" or fashion faux pas, here's another: don't wear light, bright blue eyeshadow. First, it isn't in style, second, it won't make blue eyes look bluer, and third, it really doesn't look good on anyone.  In most places in the USA, it's still too hot to wear long sleeves or anything remotely resembling Fall clothing. Seasonless clothing that will keep you comfortable includes khaki pants and skirts, crisp white cotton blouses, dressy tees, and black and navy as long as it's in cotton.    One of the best bets for the next month or two are tops (tees and shirts) with three-quarter length sleeves. They are perfect for cooler mornings and hot afternoons. This year the fashion magazines are full of three quarter and shorter sleeved sweaters as well - great for transitioning into colder weather.  For work at least, put aside those brighter summer clothes, the light linens, and of course the whites. For many people, wearing those summer clothes now is going to make you look like the French Quarter the day after Mardi Gras.fashion accessories moda shopping fashion tips beauty clothes clothes"},
{"title": "Shoes for Fall: The Dos and the Don'ts", "date": "Sunday, August 26, 2007", "text": "I've been reading so much about shoes for this Fall, what is in, and what is supposed to be so fashionable that we can't live without them, that I'm dizzy.  So I figured that it was time to have a look at the world of shoes.First, the peep-toe is big this Fall. Uh, oh. Now these may look great on you, and if they do, wear them, but I remember these from the 'seventies and it's one reason I have so many foot problems today.  High heels and little open toes do not go together.  If you must wear peep-toes, try these great flats by Calvin Klein(Gia):Cute, chic, and they won't ruin your feet with your toes scrunched through a 2 inch hole by 3 1/2 inch heels. Or the little beige suede shoes with a tiny heel. You've got the peep-toe, and you can walk for more than 15 minutes at a time.   Next is the metallic finish. I'm all for it as long as it is Christmas or New Year's Eve or maybe even Valentine's Day. Or if you choose a subdued colour such as pewter or bronze. Wear bright gold or shining silver high heels and if you're over 40 you're going to look as though you should be wearing a leopardskin blouse and using a cigarette holder while visiting the local laundromat. If you're younger and it's during the daytime, unless you are at a wedding or involved in a very dressy occasion, people are just going to think that you do not know any better. Save them for disco night or Just say NO. Instead try these cute ballet flats (below). They are great, not only because they are a more subdued metallic, but because they are a great classic that you are going to be able to wear for more than one season.Patent is another look that is supposed to be good for Fall.  I still associate patent leather with black patent Mary Janes's that I got for Easter year after year when I was quite little.  When I was in high school, the rumour was that patent leather shoes were outlawed because boys could see up a girl's skirt in their reflection (yes, it was so long ago that we couldn't wear pants to a public school).These Ferragamos look classic and lovely, but if they're a bit too \"old\" for you, try these feminine looking T-straps(below). They  are patent, have a sexy sling-back as well as the feminine T, and these are in grey, one of this Fall's hottest colours.  But please, please make sure that you don't have cracked heels! No one will notice your shoes, and the long line from the rear view that is created with sling backs will be ruined.Don't forget about the platform - still going strong. But unless you have a fortune to spend and shoes and very strong ankles, opt for the mild platforms instead of the exaggerated ones. The snakeskin  pumps below  by Cole Haan are wonderful if you can wear the heel and the peep-toe at the same time. However, if you can't stand the height, you may want to forgo the  Christian Laboutins.fashion accessories fashion blog fashion tips shoes fashion trend 2007 fashion trend calvin klein shoes cole haan shoes muodostaa costumbre shoe styles shopping beauty"},
{"title": "Get Ready for Fall!!", "date": "Wednesday, August 22, 2007", "text": "Okay, if you are on vacation (as most of Europe is right now) lucky, lucky you! However, if you are like many of us in America, especially those who have children, the \"Fall\" semester has begun for the new school year, and that means new schedules, routines, work, and yes, new clothes! The temperature here has reached 101 F in the last week, so despite that \"Fall\" semester business, we are definitely having summer weather.  So, what to do?  This is a great time of year to stay indoors and start preparing your closet for the Fall/Winter to come. How?  You've read about this process before, many times, I'm sure, but the process is still tried and true, so stay under the air conditioning and get into that closet!   Get a small notebook. You need to make a list of the clothes and accessories that you will really need for this Fall and Winter. If you don't write down that your only black cashmere cardigan has moth-holes in it, you won't remember to buy a new one, and to look for new ways to store that sweater next year so that the moths stay away.Clear one drawer - this is where you'll put all the summer things that you're going to be wearing before Fall really kicks in.  Go through your summer pieces and put away those things like stark white pants that you can only wear another week or so anyway.Have one section (small) of your closet where you put the hanging summer clothes you'll be wearing for at least another month. Put away very obviously summer clothing that won't do for your workplace, if you work outside the home.This is a good time to throw away summer clothes that you know you won't wear again because they're stained, they shrank, they are too trendy to be in next year.Give away summer clothes that were from last year, yet you didn't wear them all summer because they no longer fit, you don't care for them, whatever. Pass them on to someone who will wear them. And you won't have to deal with them next April when you're getting ready for summer again.Check your summer shoes and either toss them, give them away, or reserve them for next year.Now, go through the clothes that some people call \"seasonless\" although few clothes actually fit that description. Some you may not have put away (khaki pants?), some you may have with Fall clothing (black cotton slacks?). Unless you live where there are harsh winters or in the tropics, much of your clothing will (should) fall into this \"seasonless\" category. (I've found that \"seasonless\" often means that it is wearable anytime except the hottest summer days and the most frigid winter days).You don't have to go through all your winter clothing right now ---the scratchy wool, the thick turtleneck sweaters. Save going through these for the end of September. But do look at all of your jackets/blazers and your cardigans because these pieces see you through non-coat weather, and then through the coldest winter days as well.If you colour-coordinate your wardrobe, then be sure that both tops and bottoms still fit properly and check for stains, tears, etc. , anything that would prevent your wearing it.Have a category that needs to go to the cleaners, a category that may need repairs or simple work before you can wear it again, and of course, if you can't wear it - get rid of it!Check your Fall shoes. Make notes on which colours and styles need to be replaced, what can be resoled, what needs to be thrown away, which should be given away.If there is anything that you didn't wear last year that you still have: throw it away or give it away!This is just a beginning, but you should know what you have to mend (or have mended), what should be cleaned, and most valuable of all - the clothing you are going to have to purchase to wear during the next 6 months.fashion clothes shopping accessories shopping closets organizing clothing shoes"},
{"title": "Discontinued Products", "date": "Sunday, August 19, 2007", "text": "Can anyone tell me why it is that when I find a great product, the store that offers it invariably decides to discontinue it? The Bath and Body Works had Pumpkin Body Butter that worked wonders on my ultra dry skin - yes, discontinued! Another favourite is The Body Shop's Grapeseed Body Butter; although it says on their online site that they are temporarily out of stock, I'm afraid that this wonderfully smoothing cream which is the best I've used so far is going to be discontinued also.  So, what to do?  First, I've been looking for other formulations that also contain jojoba oil and shea butter as well as the grapeseed oil. There are a couple of possibilities that look interesting only one is in the U.K. and I hate to think what shipping could be for it since it comes in a heavy glass jar.  The other alternative is Ebay, and surprisingly enough I've found quite a few offerings.  I got Pumpkin Butter at a reasonable price - not the $3.00 a jar it was selling for on the website when they were getting rid of it all, but a reasonable price with reasonable shipping.  If you check Ebay, be sure that the seller has at least a 99% feedback rating (although this can differ depending on how many feedbacks he/she actually has), and that the ad for it says that it has been unopened.  If it doesn't state this in the ad, be sure to send an e-mail to the seller to make sure that this is a new, unused product. Likely, it is, since many Ebay sellers will go to stores such as The Bath and Body Works and buy all the products that are being discontinued at rock-bottom prices, then offer them for sale on Ebay to people like me who can't live without them.  Happy Shopping!fashion beauty women skin complexion"},
{"title": "Wrinkles? A Temporary Fix", "date": "Tuesday, August 14, 2007", "text": "It's rare that I try a \"wrinkle-remover\" product, or really any product that affects my complexion since the skin on my face is extremely sensitive and prone to what some doctors have called dermatitis and others have referred to as eczema. However, I've read so very much about Dr. Patricia Wexler and what a marvel she is where skincare is concerned that I decided it was worth a chance.   While I am going to give some of her other products a whirl, I decided to try her Advanced No-Injection Wrinkle Smoother first since I had just washed my face (with my Purpose soap) and you are supposed to apply it before moisturizer (my regular Aveeno lotion).   Guess what?  It works.   The little lines (well, maybe one is not so little) at the top of my lips virtually disappeared once my makeup was on, and my face did look smoother. Of course, by the end of the day, I had a scattering of little \"bumps\", the kind that have been referred to as dermatitis. But that's me.  Super-sensitive. And I am going to try it again to make sure I can attribute the bumps to Wexler's formula and not heat rash from spending a good part of the day in the pool with the temperature in the upper 90's (30SPF facial sunblock from Clinique and a hat, but it was hot).   I bought the Wexler products at the Bath and Body Works online.   I can't wait to try the lip plumper!skincare beauty skin fashion wrinkles anti aging aging beauty tips"},
{"title": "Just Say No!    Good, Good Water", "date": "Wednesday, August 08, 2007", "text": "Yes, it has been a while - but business has been keeping me busy.  The latest news?  I've given up Diet Coke!!!  What's so special about this?  When you consider that I drank probably over a liter of it a day, giving it up is probably a good idea just because drinking over a liter of anything but water probably isn't very good for you.  And with chronic fatigue syndrome and fibromyalgia, the reports concerning the negative effects of drinking the stuff just finally got to me. So, I have gone Coca-Cola free for over a month now.  Do I feel better? I have to answer \"yes\".  I probably will drink a diet Coke now and again, but when I give something up, I have to go \"cold turkey\" for quite a while.  Meanwhile, I've found some good replacements, and number one among them is Dasani's flavoured water, or as they refer to it, \"Vitamin Enhanced Flavored Water Beverage\". The kiwi-strawberry flavour is as delicious and refreshing as anything I've ever tasted. I don't have more than one per day however, and not every day.  Other than that, I'm drinking iced tea without sugar or with Splenda added. Oh, and the Coca-Cola company! I'm still supporting them by drinking Dasani (and therefore also Emory University, my son's alma mater and a recipient of Coke's generosity) since Dasani is put out by the Coca-Cola company. Now, all those plastic bottles....I'm thinking we should return to recyclable glass!fashion shopping style health women beauty fashion tips beauty tips Dasani Coco-Cola fibromyalgia chronic fatigue syndrome"},
{"title": "Ah... Summer Vegetables", "date": "Sunday, June 24, 2007", "text": "I live in the South - that is, the southern part of the United States, so eating vegetables in the summer is a joy. If vegetables tasted like this in the winter, I would be one happy camper, and probably have few problems keeping to a sensible diet. Another wonderful thing about summer and vegetables is that the vegetables and fruits are usually cheaper now.What wonderful things should you be eating?Cucumbers: marinate them in apple cider vinegar with onions. Or make cucumber soup with unflavored yoghurt (also good for you), a bit of sour cream (use the low fat) and onions. A quick favorite I never get tired of: cucumber sandwiches. Make them with very thinly sliced low calorie bread, low-fat mayonnaise and fat free cream cheese. Tomatoes: full of all kinds of vitamins and good stuff: make my BLT by using the same low-fat mayonnaise, thinly sliced bread, lettuce, tomato, and use VEGGIE bacon. Protein, low-fat, low-cholesterol, these are great.Strawberries: put them in a smoothie or eat them plain. If you have to have something a bit sweet with them, do NOT douse them with sugar. Instead, serve them the way I always did for my nephew: slice them into halves and eat them with an oyster fork with a ramekin of sugar in front of you. Lightly touch each bite with sugar before you eat it. I'll guarantee you'll savour each bite, get the full flavor of the strawberry still, and eat much less sugar than you would if you mixed it in a bowl with the strawberries.Corn: boil it and eat it on the cob. If you use butter, you'll use far less than you would if you took the kernals off the cob first.The rule of thumb for eating fresh in the summer is to do the least cooking of any fruit or vegetable that you can safely get by with. You'll enjoy the food, and be eating healthfully, too.diet nutrition food cooking vegetables"},
{"title": "Beauty Food", "date": "Friday, April 27, 2007", "text": "I've been rethinking my lifestyle lately, and by lifestyle I mean only two things: diet and exercise.I made a promise to my son - yes, I will exercise!But I know that without eating properly, exercising is not going to do much good for me at my age when food becomes so important - and unfortunately, at a time when the only people at home are our two kitties and my husband and I.  I worry about the cats' food more than I do ours. When my son was at home, especially in his early teen years, I made dinners with wheat germ, cooked only with vegetable oil (when I used oil), used blackstrap molasses, etc., etc. You get the picture.   My major excuse is how busy I am, so I'm going to begin with a couple of \"easy\" ways to improve your health and beauty by what you eat.  First, raisins and prunes are your friends - not necessarily for the reasons that your mother forced them on you (although they do have that benefit) but because raisins are very high in antioxidants that fight aging and disease.  They are also low-fat and low-cholesterol, and are satisfyingly sweet for someone with the sweet tooth that I have. They are also a good source of iron and potassium. The same goes for prunes. Now some people are going to get upset when I say this,but if you must have some chocolate, then eat it around your raisins.  If you're going to eat the chocolate anyway; you may as well have the benefit of the raisins!  Raisins/prunes help with: dry skin, wrinkles, dry hair, dandruff,weak nails.  It's summer, and I'm looking forward to some decent melons and tomatoes.  Good for me!  Both are chock full of vitamin A/beta-carotene which helps us look lovely longer by fighting dry skin, wrinkles, and dry hair. It is also necessary for healthy vision.  Our Goal: This week incorporate raisins, tomatoes, prunes, and melon into our diets in a substantial way - meaning every day have at least 2 of these. We'll all look better and feel better. More beauty foods coming!fashion beauty health diet fitness nutrition vitamins antioxidant aging"},
{"title": "Something You Already Know", "date": "Sunday, April 01, 2007", "text": "Gee, I am looking tired lately, and I noticed more fine lines and wrinkles than I ever had before about three weeks ago. Very distressing.  The problem? Simple.  I stopped drinking water.  I am always thirsty, but since I moved into my husband's office building, it's so easy to sip diet coke constantly that I've been neglecting my water consumption which usually is very high, and to which I credit my good complexion.   I hope I haven't done any serious or permanent damage, but I have noticed improvements already.  Some things just sneak up on us!Donnachloefashion health beauty complexion skin women"},
{"title": "In Praise of Shawls", "date": "Sunday, February 18, 2007", "text": "Women in Europe, Spain, Italy, France, Portugal, still wear them.  They are practical, stylish, and have a certain je ne sais quoi.Women in America discovered them (fashionable women, that is, the more Bohemian and some of the dowdier always used them) with the advent of the pashmina.I am, of course, talking about shawls, a versatile piece of clothing that can keep you warm, add flair to your appearance, and serve every purpose from keeping your cat in control to being a make-shift umbrella.I fell in love with shawls when I was traveling in India where shawls are a way of life.  After all, the dupatta is a shawl, and really you could say that a sari is simply a shawl that serves as a dress. I bought shawls there, and I've been wearing those shawls and more that I've bought ever since.Now I am not talking about the loosely crocheted shawl that your great-aunt saw fit to make for you and give you as a token as her affection. I am talking about pashminas, woolen squares, solid or beautiful patterns, long lengths of cashmere - real shawls that will keep you warm. I wear a shawl many times instead of a coat. With a good woolen shawl that I can wrap around me, a pair of gloves, and warm boots, I can get by with a suit jacket unless I have to walk several blocks - certainly I can drive around doing errands without having to keep a bulky coat on. When it is really cold, I wear one over my coat: my largest wool shawl adds a layer of warmth and hugs my neck, while a simple pashmina I treat as a scarf and wrap it twice around my neck.When I'm caught outside in the rain, I simply pulling my shawl over my head keeps my long hair dry (unless it's a total downpour). In the summer, a light silk shawl keeps me from freezing in air-conditioned theatres, and just last week, I learned that my cat loves to go to the vet held against my chest wrapped in a shawl rather than being put in the kitty carrier.Maybe one of the things I love most about shawls is the way that they make me feel: feminine, even exotic, sophisticated.Choose your shawl carefully: you can't go wrong with a pashmina or Himalayan shawl. A Burberry is so popular in Europe that they stay sold-out. Avoid shawls that are made of too-fuzzy yarn, or are crocheted and bulky or that have fringe that will have all the cats in the neighborhood following you to play.Do match them to your coat, your suit, your gloves and boots. And stay warm and chic.The Louis Vuitton shawl to the left is a classic that you can keep forever and then hand down to your daughter.Donnachloefashion accessories style shopping beauty clothing shawl Burberry Louis Vuitton pashmina cashmere silk"},
{"title": "Coats, Massages, Manicures, Pedicures, and Perfume", "date": "Saturday, November 11, 2006", "text": "I've been in Washington, D.C., one of my favorite cities and one of the most beautiful American cities.  It also boasts some fabulous shopping and services.  I made sure that I did sample some of them.First, I found the coat I needed, but on the day before I left.  And instead of buying the perfect Burberry, I found it down the block at the Filene's  Basement (again).  I tried on every Burberry that I thought might remotely fit me or look good - nothing worked.  On a whim, I tried Filene's and voila, found a Tahari coat in black that looks almost identical to the one in the picture of my last post.   And as luck would have it, it was far, far less than the Burberry I was going to buy. Saving money meant that I had more to spend, of course, so I treated myself at the nearest Hermes store to a turquoise Hermes scarf (I'd been wanting one with turquoise).  I found Les Jardins d'Andalousie (I'm too lazy to get up to check to see if I got the prepostition right, but it means The Gardens of Andalucia - perfect since I love Andalucia!)In Georgetown, at the Georgetown Mall, there is a little perfume shop that I've been going to since 1992 that has wonderful fragrances, including those that are often hard to find.  I had to pay a visit, and though I wanted to walk away with most of the stock, I limited myself to one small, but incredibly potent, bottle of Fracas.  It's a fragrance that isn't for everyone, but I adore it and wearing it makes me feel sexy and a bit decadent (not to mention very floral) so I tried to spray a little of it as possible when riding in the car with others.One of the first things I did was go to the Ballston Mall in Arlington, Virginia (courtesy of my lovely, lovely daughter-in-law) and sign up for some badly needed beauty treatments.  A Swedish massage by Misty (whose gifted hands would have made her a high priestess in the Ancient World) made by body feel better than it had for some time, and her sinus massage did the same thing for my head.  A manicure and pedicure improved the appearance of my awful hands and feet by 100% and felt as marvelous as a massage. I also left with products, namely soap and a shea butter based creme with a \"Pink Champagne\" scent that is heavenly (Natural Body Day Spa).   My sister-in-law and daughter-in-law opted for facials as well.  At the risk of sounding terribly pampered and spoiled (and I was for that day, anyway), it was a day well-spent.     I found Cole-Haans (my favorite style, too) for half price at Bloomingdale's, a pair of boots that make walking easy (difficult for boots to do) and at least 4 pairs of black slacks (when I travel, I think I keep leaving them places) and probably a lot more items that I shouldn't have bought. (Beware of shopping with your sister-in-law and daughter-in-law!) But every purchase fit properly, was a good or good price, and, after all, I will wear everything!Donnachloefashion shopping Washington day spa massage spa manicure pedicure Swedish massage clothes shoes Hermes Bloomingdale's Cole-Haan boots coat perfume fragrance beauty women cosmetics The Daily Fashion and/or Beauty Tip Burberry"},
{"title": "Buying a Coat", "date": "Thursday, October 12, 2006", "text": "It's that time again for me: I need to buy a winter coat.  I have a full length mink with a sable collar that I don't wear anymore because of guilt. I also, regretably have a long lightweight cashmere camel coat that I adore, but the moths have gotten to it (I bought it back in 1993, I think, at Filene's in Washington D.C., but it is still ultra chic) so it's time now to get a new coat.  Coats are like cars for me: I get one I like and I keep it as long as I can until it wears out (my 1998 Mercedes 300 diesel is still going strong and looks great - I hope I have it for another 8 years - but that's another story).  I've decided that I will probably buy a Burberry trenchcoat when I go to Washington  in early November. Why? It's a classic (ooo, one of my favorite words); it will work as a raincoat as well as a warm coat (it gets cold here in northern Arkansas, for a few days every year maybe even down to 0 degrees F, but boots, scarves, shawls, and good gloves keep me sufficiently warm - and it's not as if I hang around outside here.  The Burberry should be great to wear in Seattle at Christmas and most places in Europe.  If I go skiing, I'll probably borrow someone's down jacket since that isn't something I would wear where I live. So, here is my wise advice about buying a coat.If you live in the northern US, you should consider a coat a major expenditure and budget accordingly. I suggest that the colour of the coat should be camel or navy or black or taupe -whichever is most becoming on you.  Some people can get away with a red coat if they have dark hair and complexions and most of their wardrobe is based on neutral colours.In the southern US, a coat is still important, but if you live in Florida, southern Georgia, Alabama, Mississippi, Louisiana, make sure that your coat is a lightweight one.  I suggest a very lightweight cashmere for Mississippi, Louisiana, Alabama, and northern Florida where it can get cold (suddenly, and with wind, too). In southern Florida, try a lightweight raincoat - the trench, of course, is the classic.You will have to take into account the time that you spend outdoors, and I don't mean engaging in winter sports which require different coats altogether. If you live in New York or Chicago and take the bus or subway and walking several blocks is a part of your day, get a heavy coat.  If you take taxis or own a car, lightweight cashmere or  a Burberry with a warm liner, and great shawls will suffice.   Shop carefully for a coat, and buy one that you plan to keep for several seasons.  Cheap coats will not look good after one season, and a coat is something that in some climes people will see you wearing almost every day.  If you knew that you had to wear a dress everyday or several times a week, you'd go for a real knockout, wouldn't you?  So think of your coat the same way.     Make sure that your coat fits! If you're buying it while wearing lightweight clothes, get a larger size than usual. If you wear business suits or jackets regularly, be certain that your coat will fit over  your suit jacket (you don't want to have to carry your suit jacket to work while you're wearing your coat).Be prepared to spend more than you think you can: you are not buying a dress or suit! Amortize the wearing of your coat and see how much it will cost per wear. For example, if you wear it 150 days per year for (a very conservative) 3 years, a $1000 coat will cost approximately 2.20 per wear. Compare that with the amount of times you wear a favorite outfit and you may be surprised at the cost. The longer you keep the coat, the less it costs!    Shop judiciously, and prepare to shop for some time.  The biggest mistake most women make is buying the first coat that fits and is in their price range. Find one that makes you feel chic, sexy, stylish, elegant, any or all of the above, because you are going to be wearing it often!If you are unsure about style, go to websites such as Saks and Neimans, Bloomingdale's and other upscale stores online to find a great style.DonnachloeFor unique handcrafted fashionable jewelry, see Cluny Grey Jewelry with pieces from the new Fall Collection.fashion fashion news beauty women women' s fashion coats winter coats beauty clothing clothes shopping style outerwear The Daily Fashion and/or Beauty Tip fashion tips fashion advice Burberry Saks"},
{"title": "New Products for Hair and Skin", "date": "Tuesday, October 03, 2006", "text": "I love trying new (and not so new) products.  Two that I've found lately are \"Big Sexy Hair\" and Aveeno's Continuous Radiance lotion that adds colour to your skin.  I have no idea how long \"Big Sexy Hair\" has been around, but since Clinique stopped selling the styling spritz I've used ever since I found it in Spain 3 or 4 years ago, I've been looking for a volumizing replacement.  While strolling through a mall in St. Louis about 2 weeks ago, I found the bright red can and was intrigued by the title.  Guess what?  It works.  And that's saying something for me now that my hair has grown past the middle of my back.  It's hard to make hair that long \"big\", but the product added the volume I need - especially around my face - and built great body.  I'm just hoping I'll be able to find it locally. I bought the Aveeno lotion just to try another of their products.  At a Saks recently as I looked through all the wonderful and wonderfully expensive cosmetics at the counter, a saleswoman came up and said, \"You have the most beautiful complexion! [I loved that she didn't even add 'for your age']. Whatever you're using, keep on using it.\" I smiled and said, \"Thank you.\"  I really wanted to tell her, but didn't, that for the last 15 years at least, I have used nothing on my face but Purpose soap and Aveeno lotion (the first Aveeno lotion before anyone knew it existed).  My super-dry skin all over my body has responded very well to the Aveeno, but it has kept my super-sensitive face from breaking out and me from repeated visits to the dermatologist for rashes.   So I tried the Aveeno Continuous Radiance without realizing that it is basically a tanning lotion.  I love it though.  I do not have rust coloured hands (I do put regular lotion on them first) or heels and my legs have a nice, well, radiance, that surprised me.  This is definitely one product that I will keep around - especially when I get that mid-winter lackluster skin on my body which has been covered too long by several layers of clothes.Donnachloefashion fashion news beauty hair women skin skincare dry skin skin care tanning sunless tanning lotion moisturizer complexion sexy hair haircare aveeno The Daily Fashion and/or Beauty Tip"},
{"title": "Tights Are Back!", "date": "Tuesday, September 12, 2006", "text": "Not that I ever stopped wearing what is one of the best fashion essentials ever, but it's nice to know that tights are big on the Fall fashion scene.Tights have the virtue of being classic fashion: they look good on almost everyone (so slimming a pair of matte black opaque tights); they are extremely functional (if you live where the temperature goes below 45 degrees in the winter, you know how comfortable tights can be - there's a big difference between thin hose and a pair of tights!); they come in a variety of price ranges; they come in a variety of colours and  patterns - from plain to herringbone to wild stripes, there's something for everyone; and finally, they last an unbelievably long time when compared to ordinary pantyhose.   I've worn the same tights for over 3 years without a rip, run, or tear anywhere.  And, oh, yes, a black mini-skirt with black tights and little heels -demure, yet  very sexy!fashion beauty fashion news tights women clothes clothing fall fashion"},
{"title": "Cosmetics and Animal Testing", "date": "Wednesday, August 30, 2006", "text": "I know many of you will groan when you see the title of this entry, but I do want to touch base and say that things are better than they used to be where using animals for testing cosmetics is concerned.  I was very glad to see that, among others, 2 of my favorite cosmetic companies, Estee Lauder and Clarins, do not use animal testing.  As I grow older, I seem to be realizing that most of the cruelty in the world is really needless - and that includes animal testing.  I do believe in serious research to discover cures for horrible diseases - and I know that sometimes means animal testing.  But to treat animals cruelly so that I can have a longer lasting eye shadow is just silly and wasteful.   Does your favorite cosmetic company use animal testing?  Go to the Peta website or Google for a list of cosmetic companies that eschew animal testing.   No one should have to suffer to be beautiful - including animals.Donnachloefashion animal testing beauty cosmetics makeup peta animal rights"},
{"title": "Listen!  How Are Your Ears?", "date": "Wednesday, August 16, 2006", "text": "Sigh...it's difficult for women; we have to try to make sure that every part of our bodies are attractive...and that includes ears!Ears are ears you say, what can you do besides keep them clean?First: Moisturize your ears, especially your earlobs.  Women frequently have very dry skin here, especially as we get older.  Even some of that great eye cream that you use that is so rich would be great here.  But don't forget to moisturize the tops of your ears either, especially if you've been out in the sun all summer.Second: Use a sunscreen on your ears when you're out in the sun.  Now most women don't want to do this - the cream or lotion or oil ends up in our hair and feels greasy, or we just forget to do this because except for the times when we are changing our earrings, we don't think much about our ears.  They do burn however as well as tan, and since they do both, they will show age - quickly if you forget the sunscreen.Third:  How long have your ears been pierced?  Check out the piercings.  Do you still have nice round holes for earwires to go through or have they grown into slits?  Are the holes unsightly? Do they look as though they've been stretched or mangled somehow? (And if you lived through those huge, heavy earrings of the 1980's, chances are they do).  Wear earrings that have posts with a front element that covers your piercings.  Don't wear earwires that pull your earlobes down or that look as though someone has almost ripped the earring from your ear so that there is only a millimeter of skin showing below the wire.Fourth:  If you must wear earwires, get a second set of piercings.  One woman did this because she found that she always wanted to wear some fabulous real diamond studs that her husband had gotten her. Now she wear the diamonds and another pair to match her clothing.Fifth:  While our ears are a different colour than the skin on our faces, do lightly brush some blusher in a light colour over your ears - not just when you're going out in the evening, but also before you go to work under those fluorescent lights in your office.  A bit of blush or very light bronzer will prevent your ears looking as though they belong on an alien being.Donnachloe  Check out pretty dangle earrings at Cluny Grey Jewelryfashion beauty skin skincare cosmetics makeup women The Daily Fashion and/or Beauty TipBeauty Tip  Beauty Tips Weblog"},
{"title": "Bare Powder Makeup", "date": "Friday, August 04, 2006", "text": "I love trying new makeup (if I think there's a chance it won't break out my sensitive skin)although I've been wearing a lot less since I work at home now.I've been watching those Bare Mineral commercials on televsion, very curious about their foundation that goes on like a loose powder that you use with a brush - but I am not one to order from the television. So when I found myself stuck in a Walgreen's in Memphis yesterday (there are no German car dealerships in our town, so we have to take our cars to Memphis even for an oil change) I was interested to see a new product by L'Oreal that was called Bare Naturale, evidently a take-off on the popular tv product. Of course, I bought it. I need something on my very sensitive face even when I'm indoors, and I'm tired of doing the  EsteeLauder liquid foundation when I know I'm not going anywhere. I am not going to wear a sunscreen product in the house, so I figured this was worth a try. I like it. I couldn't believe the coverage that a powder could give and that it could actually look as good or better than many liquid foundations. I have never liked those powder foundations that come in a compact, wet or dry, so I was extremely surprised. It's gives a nice fairly matte (not shiny at all) finish with just enough dewiness to look natural. The packaging leaves a lot to be desired. The top covering the brush is too deep for you to put powder in and then use the brush. I did get powder on my bathroom countertop. But it takes less than 20 seconds to put on (and I use a generous helping) and my fingers weren't coloured with foundation, nor was foundation stuck under my fingernails. Hurrah! No more scaring the postman when she brings a package to the door. I'll still wear my Estee Lauder for dinner out, but I have a feeling that the L'Oreal is going to become my daily makeup. A couple of other pluses: it has a 15 spf sunscreen (which I need since I break out from the sun)and it is very cool (with my full coverage from EL, sweat often beads on my face - it doesn't take that makeup off, but it is hot! I wonder if I'm the only Baby Boomer who is changing the way she looks at makeup after all these years (I wore a lot everyday, and now I'm tired of it! But I still want to look good.) I give L'Oreal Bare Naturale an A-.fashion makeup beauty The Daily Fashion and/or Beauty Blog Baby Boomer cosmetics beauty products skin care skin skin Bare Naturalefoundation"},
{"title": "Have a Pedicure", "date": "Thursday, July 20, 2006", "text": "Just a word to the wise: if you are over 40 and wear sandals, toeless shoes, or go to the beach or pool, make sure you get a pedicure. But more importantly, paint your toenails! They don't have to be bright red, in fact, they probably shouldn't be unless your feet are very attractive. They do need to have a light polish with just a bit of colour - one of the translucent shades with a pink glow to it should be perfect!  Your feet will look years younger!Donnachloepedicure feet nail polish nails beauty fashion makeup The Daily Fashion and/or Beauty TipHandmade Necklaces"},
{"title": "Cellulite!?!", "date": "Tuesday, July 04, 2006", "text": "Okay, I'm not going to debate the existence of cellulite (properly pronounced cell-u-leet); I've seen my thighs; there's something there, and I'm going to call it cellulite and it exists because I can see it! So many rumours - so little real information about \"orange-peel\" skin.I don't know that it gets rid of cellulite, but I do love this gel by Clarins - very refreshing although expensive.    Cellulite is the result of toxins under the skin.  Maybe, maybe not - how in the world are you going to find out?   Cellulite is genetic.  Maybe, I do know this: I've seen really fat people with no cellulite whatsover - even in women overweight and well over 30. I've seen thin twenty-two year olds with cellulite. I had it when I was very thin (one could even say skinny - I used to drink milk shakes in an attempt to gain weight - yeah, I'm paying for it now!)   Creams and gels will fix cellulite. Well, they may help your skin to look better, but if you think that it will really get rid of cellulite, you also believe that there are lotions that will increase your cup size from an A to a C.   Bubbly drinks (carbonated) including sparkling water will cause cellulite.  Who knows? Who cares?  I have found that there is only one thing that improves cellulite, and that is exercise - both aerobic and directed at the legs. One summer I read an article that advocated sitting on the floor and slamming your legs up and down against the (carpeted) floor - repeatedly (about 300 times). I did it, drank a lot of water, cut down on junk, and yes, I cut down on either the cellulite I had or the way it looked. I'm not sure which, but my legs were substantially improved. It was also quite a bit cheaper than all the Elancyl and Clarins products I 'd spent money on.   So, cellulite: there's no easy answer.  If you're serious about improving skin texture then:    Eat a well-balanced, junk-free diet   Exercise  The old stand-bys. Too bad eating chocolate in some form every day didn't seem to reduce my cellulite. But that's me - maybe the chocolate thing will work for you! ADDED NOTE: I received a comment about cellulite from the New York Day Spa, and checked out their very nice blog. I believe that there is a link to it in the comment - I recommend it. Donnachloebeauty cellulite fashion skincare cosmetics diet skin care exercise skin legs womenBeautiful, handcrafted jewelry: Cluny Grey Jewelry"},
{"title": "Summer in the Sun", "date": "Sunday, June 11, 2006", "text": "Okay, I won't even get into how horrible tanning beds are for your skin.But it is summer, so I have to say a word or two about getting a tan.You shouldn't tan.  That' what they tell us.But telling pale American women that they shouldn't get a tan is a bit like telling American teenagers not to have sex. Who's listening?So, if you're going to tan (and yes, I am, not in a bed, but in the sun, and following these rules) try to do the following.First, don't burn.  We're not talking about looking old here - we're talking about skin cancer. So don't burn.There are only 2 ways to avoid burning: stay out of the sun or use protection.We know that you (and I) are not going to stay out of the sun. So use protection.Get a good sunscreen - or really - get 2 good sunscreens - one for your body and a stronger one for your face. Get a hat or a visor and use it.I haven't had the sun on my face since I was in my early twenties: you should see the difference between the skin on the back of my hand and that on my face (I'm 55 years old). I swear that the skin on my face looks like it did when I was 30 years old. The skin on the back of my hands makes me wince- I think it looks a good 10 years older than my age (at least).Just don't tan your face. If you wear make-up, it's the easiest thing in the world to use a powder bronzer (get one that doesn't look orange), make sure to apply your powder blush - and no one will know. There are even some good self-tanners now for your face - Clarins makes a decent one. (I for one though get tired of having an uneven colour because part of it always washes off before some of the other parts - and my skin is way too delicate to exfoliate). But this one by Clarins (unlike many of the others) has a 15 protection rating as well.About 3 years ago, I spent the summer beside my son's pool in Brazil and got the greatest tan (as safely as one can) except for my face. The bronzer worked fine and took less time to use than my foundation! (By the way, if you are in Brazil or Portugal, I highly recommend the sunscreens put out by O Boticario -a chain of perfume boutiques; they protect from burning, moisturize, and didn't break out my highly sensitive skin.)Use the hat, but if it's too difficult to keep on, opt for the visor because you can wear it while you're in the water. This does not excuse you from using sunscreen however. You can and will get sunburned on the face (not to mention the unwanted tanning) on your face by the sun's reflection off the sand and water.Have fun and relax in the sun!sun sunscreen tan tanning skin skincare The Daily Fashion and/or Beauty Tip fashion beautyClarins makeup"},
{"title": "Almost Summer...Update Your Perfume!", "date": "Wednesday, May 17, 2006", "text": "While it's great to have a signature scent that smells great on you, and that people come to associate with you, you really should have more than one. Some people have a \"day\" fragrance that is light and fresh (within their \"type\" or signature) and switch to a heavier, sexier fragrance for evening.I think that everyone should have at least 2 signature scents - one for winter, and one for summer (you can also do the day to evening thing with these usually, too).If you favor Oriental fragrances such as Boucheron, Opium, these are really too heavier for daytime in the summer. Switch to something lighter. (What fun, deciding on a new perfume!) Keep in your signature family, but perhaps a bit more floral or green.My 2 favorite fragrances are Sung by Alfred Sung (the classic Sung) and Escada (the classic Escada). Both are florals, but I tend to wear more of the Escada in the winter, even though it does remind me of summer (it has a lot of jasmine). The Sung is a good everyday fragrance, but it is lighter and perfect for summer. I also love Boucheron, but only wear it in the winter since it is a heavier floral Oriental.You change your clothes in the summer, putting away your heavier things for winter; do the same with your fragrance to feel refreshed and cool all summer long.perfume fragrance scent beautyfashion The Daily Fashion and/or Beauty Tip weblog   Cluny Grey Jewelry"},
{"title": "12 Huge Beauty Faux Pas", "date": "Friday, April 28, 2006", "text": "Are you guilty of any of the following? These are real beauty faux pas, not just because they affect the way you look, but also because they can cause people to form a bad impression of you.Chipped fingernail polish. This says that you do not pay attention to details and think that others don't either. Chipped polish can spoil the effect of the most expensive clothing.Chewing gum. Have you ever noticed that when an actor wants to portray someone as stupid or ignorant, lower-class or just plain \"trashy\", she will chew gum to get the point across. Do you chew gum? Enough said.Cutting your own hair.  No, you can't, even if you cut other people's for a living.Not getting your long hair trimmed regularly.  Can you say split ends?  Do you realize how they look?Wearing too much mascara. You'll look messy and as though you have spiders sitting on your eyes. It will rub or flake off if you put enough on, no matter how good the product is.Wearing inappropriate shoes. Sure, they're sexy, but if you're prissing down the street in 4 inch heels with snow and ice, you will look silly.Not wearing lipstick (or something on your lips). Everyone needs some colour, even in their twenties. If you're over 35, you really need it, and if you're over 50, you should be shot for going out of the house without it.Ignoring your eyebrows. Okay, if tweezing hurts, have them waxed; they really are like frames for the face. Long unruly brows can make you look unkempt, and if you're getting older, you may need to fill in if they are thinning or some have turned grey or white.Dyeing your hair one too-dark colour. Natural hair is not one colour. Maybe you want to be a brunette, but ask yourself if black is the right colour. Dark brown is usually enough.Bleaching your hair all one colour.  See item immediately above.Covering all your hair with colour every time you colour your grey hair. You only need to do the roots most of the time. Covering all your hair to the ends will make the lower part of your hair hold more colour and look different from the rest of your hair. It will also cause your ends to become dry and brittle.Ignoring the way your voice sounds. Too harsh? Too screechy? Bad, bad grammar? Do you associate any of those with being pretty or sexy? How you sound when you speak to people does matter. Pay attention to your own voice. If you don't care how people see you or if it isn't important in your business, fine. But if you want people to think the best of you, you're going to have to pay attention to these problems!fashion beauty hair eyebrows hair color voice mascara nail polish lipstick The Daily Fashion and/or Beauty Tip"},
{"title": "Yukky Feet? Two Products That Work", "date": "Sunday, April 16, 2006", "text": "Do you have dry, cracked heels and ugly feet? I do; my heels are so dry that I sometimes get deep fissures and have to use a sealing product (I find it in the local drugstore's footcare department) to keep the fissure (crack) closed. My dry, cracked heels have been the bane of my existence for many years, and the truth is, they only seem to get worse. The vaseline and socks overnight works, but I need to do that almost every other night! Not very practical! Luckily there are some new products on the market for people with this problem. I recommend their use highly, especially because summer and pooltime will be here before you know it. If you're like me, you like to go barefoot, and dry, cracked heels aren't only ugly, they can be a source of infection. Two new products have come to my rescue: one is Aveeno, a lotion I regularly use on my face and body. They have a special footcare cream that is great! The second is called \"Miracle Foot Repair\", and I bought it at a Bed, Bath, and Beyond store. It is produced by Ontel Products Corp, and you can visit their website at Ontel Products . It also contains an analgesic. Great news, because if you have really dry, cracked heels, you know that they can be painful as well as ugly.   Neither product works overnight, but with regular use, you can see a definite change within a week or two.pedicure The Daily Fashion and/or Beauty Tip feet beauty body women fashion Weblogs"},
{"title": "Fat Closet? Lose That Weight!", "date": "Tuesday, April 04, 2006", "text": "Is your closet fat? No, not you, but your closet? Can you really find what you need or want to wear in it when you are looking for something? If the answer takes you a minute to think about, or if the answer is a resounding \"NO\", then you need to lose some closet weight.You've seen these articles before about how you need to clean out your closet, throw away things that you haven't worn for a year, two years, three years (depending on whom you're reading).     That is so very difficult to do, isn't it?      First, you don't really want to throw things away, right?  Never know when you may need to use them or want them again?      So don't throw them away.   My suggestions do require some purchases. First, buy some plastic bags that you can seal to put clothes in: space bags may work for some people; personally, I cannot keep them with the vacuum seal. I have found some plastic containers (bags that are supple, not hard containers) at Sears that have good heavy zippers and that are made of heavy plastic.   Use these bags for those clothes that you know are not likely to be wearing, but cannot bring yourself to throw away. I have clothes that I cannot throw away or give away because: I bought them in a foreign country and they are unique; they have sentimental associations for me; I loved the way they look so much that I want to keep a reminder of the style; they are not worn out, in fact, are almost new and I just can't get rid of them for that reason.  Now, if you're like me, these clothes are crowding your closet - and they are also preventing you from cleaning or organizing it. Store them in the bags, and store the bags - in the attic, under the guest room beds - wherever. You won't be wearing these clothes, so you can store them in an incovenient place. The important thing is to just get them out of your closet!     You'll be glad that you did.Donnachloebeauty clothescosmeticsfashion closet The Daily Fashion and/or Beauty Tip"},
{"title": "When You Can, Buy the Best!", "date": "Saturday, March 25, 2006", "text": "Bargains are super! I’ll be writing about bargains constantly, but remember that a bargain is not necessarily something that is low cost on the surface. You’ll read about it again and again in fashion magazines and books, but you need to think about cost per wear of what you buy. A blouse that you pay $20.00 for that you wear once is expensive, while a blouse that you pay $200.00 for that you wear 20 times costs 10.00 per wear; wear it 40 times and it is $5.00 per wear, and if it is a blouse that you wear regularly over several years time, it can end up costing pennies each time that you wear it. Now, if you don’t have the $200.00 to begin with, this is moot. But if you wear the $200.00 piece (blouse, pants, whatever) to work often, it suits you, you feel good wearing it, it fits well, you’re better off buying that one instead of 5 cheaper ones. What you can afford depends on how you decide to look at your wardrobe. You see a $400.00 blazer, and you fall in love with it.  Ask yourself these questions:      • Does this fit well? (This means at your normal weight, not that it’s a little tight and you’ll lose some. It also means that it will still fit if you gain 5 pounds.)  • Is it a good colour? Does this colour compliment your complexion? Is the colour slimming (if you need that)? Is the colour too trendy – will it look dated in 2 years? Does the colour complement other pieces already in your closet?  •     Does it have details that will date it? Again, this has to do with trends. Does it have a trim that is terribly in style this year, but won’t be the next?  •     How is it cut? Some styles, while they may reappear, can look very dated. Think of the extremely boxy large cut blazers of the ‘eighties. Is this cut in a classic style?  • How versatile is this piece? Can I wear it to work, to the theatre, on a date, over jeans? Ideally, it should go more than one place (and by the way, if it is something that you can wear while traveling that is really an extra plus).  •     How well made is this blazer? Check the seams to make sure that they are ample and well-sewn; that the lining doesn’t wrinkle and bunch, that it doesn’t hang down too low in the back.     When thinking about accessories that can be expensive, the same rules basically apply.  For handbags, • Versatile?  Handbags should be able to go to work and out to casual affairs.  • Colour?  How often can you carry this bag?  Does it go with many of the clothes that you already own?• Do you look good carrying this bag? People forget that you wear bags also. Does this bag “fit” you or does it hang awkwardly when you try to walk and carry it? Does it add unnecessary bulk to your overall profile?• How many seasons can you carry this bag? Remember that if it is white, for instance, you can carry it from Memorial Day to Labor Day – about 3 months a year. This is fine if you’ll be carrying it for several years.  • What is the design of the bag? Is it too trendy? Will it look dated in 3 years? Will you grow tired of it or is the design a classic shape?  • How well made is it? Check the straps for stray threads, the inside lining, the zippers to make sure that they slide smoothly.  • Is it a brand name that you can get repaired? Most brand names such as Vuitton, Dooney, Coach, Prada will guarantee their bags, and if you have a problem will repair them free or for a low charge. Some also will refurbish it when it starts to look “tired.”  • Does it hold everything that you need to carry with you? If it doesn’t, no matter how inexpensive, how much you love it, how beautiful it is, you won’t carry it often, and it will end up being a very expensive bag indeed.   Rethink what you mean by “expensive.” You may be spending money on that closet full of “nothing to wear” that could instead have gotten you a few designer pieces that you wear constantly and feel good in.This Gucci bag will last a long time! Above is a drawstring Dooney that holds everything and is a real classic.Very top is the great Coach Station Bag - it's been around for years and will be. I have one in my closet in navy that I've used since 1990 - and it still looks great!gucci prada coach Dooney clothesbeauty The Daily Fashion and/or Beauty Tip  Hermes blazerhandbag fashion bargain designer"},
{"title": "Dress Slimmer!", "date": "Friday, March 17, 2006", "text": "Everyone knows that certain clothes can make her look slimmer - but of course you have to find out just what clothes will do the trick for you. There are certain guidelines that you should pay attention to, but one thing that you must must remember is that none of these rules is correct 100% of the time. Case in point: double-breasted jackets usually aren't the most slimming that you can wear; however, when shopping with a friend's daughter (she was chubby) I had her try on blazers because they can hide a lot of body flaws. I would've bet against it, but the double-breasted style actually made her look much slimmer than the single-breasted style. It may have been the cut of these blazers, I don't know. But the major point is that although you need to know certain rules, you need to remember that sometimes they won't necessarily hold true. So, to look slim:Wear jackets or blazers, not too short, not too long. A too-short blazer will actually accentuate a poochy tummy and a big rear; usually the longer the better although it you go too long, a jacket that curves under your bottom is not attractive or slimming. Usually single-breasted is the way to go (but read the caveat above) and dark colours, black, navy, very dark brown are best.  In the summer, buy these colours in  (unlined) linen and pair them with white or cream clothes or very bright colours if you're tempted to wear bright.Wear a jacket that skims the body - not one that is a box.  Ideally, it should be cut so that it curves in at the waist.    Do not wear your clothes too tight or too loose. Too tight, and rolls are going to show; too loose, and you'll be giving the impression that you're bigger than you really are. (Also, wearing clothes that are too tight will cheapen even a very expensive outfit).Wear a bra that fits.  Most women, oddly enough, wear bras that are too little.  Get fitted for a bra; don't keep wearing the size that you wore in high school or college.  Make sure that your breasts fit in the cups and do not bulge outside them, especially on the underarms sides.    Wear clothes that look longer or make your body parts look longer. If you are overweight, wear long pants or shorts, but not capris. Wear V-neck tops, tees, sweaters, or buy blouses where the top button can be unbuttoned to create a V.Wear all one colour. Match a black top with black pants, red top with red - although usually the darker colours will make you look slimmer. If you have a colour that is a bright or pastel though that is your colour, and by that I mean that when you wear it, you always get very positive comments, by all means wear that colour even if it is bright or pastel. The good it does your hair, complexion, or eyes will offset the weight factor.When you wear skirts or dresses, put a jacket over them if the style is right; then, wear hose and shoes the same colour if navy, black or brown is the colour of the outfit. If not, then wear matte natural coloured hose with a beige coloured shoe that is about the same colour of the hose. Do not wear shoes with ankle straps or sling backs where your heel hangs over or the straps digs into your skin creating unsightly bulges.    Unless you find a case that goes against the rule (and this will be rare), just say no to belts if you are quite overweight.Wear the right panties for your outfit. You never want panty lines, but you especially do not want them if you are overweight. Buy seamless panties that fit correctly instead of gouging into your skin (in back and front).   Obviously, since all body types are different (you could be overweight with long legs, or short-waisted, long-waisted, etc.) you need to get to know yours well. There are many books out there that use body \"types\" and give examples of flattering ways to dress. Find your body \"type\" and dress accordingly! You'll feel better and look better.                                                                                   Donnachloefashion beauty The Daily Fashion and/or Beauty Tip weight  bra panties shoes body clothes"},
{"title": "Foundation For Beauty", "date": "Tuesday, March 14, 2006", "text": "What is one factor that can make a big difference in the way you look?  Your foundation!           There are women who don’t wear foundation.  They are making a big mistake!  Why?      First, because foundation protects the skin. It’s difficult to find a foundation today that doesn’t protect the skin from the sun – and just because you don’t have a bathing suit on, or because it is 35 degrees outside – doesn’t mean that skin can not be damaged by the sun. Most of the sunscreens found in good foundations are not going to break you out, so you can use them without worry. Note that while you may assiduously apply sunscreen while sunbathing, if you don’t wear sunscreen on your face the other 6 – 9 months of the year sun damage can occur – while you’re driving, walking around town, exercising, chasing after the children . . . These may seem as though they are short intervals of sun exposure, but they will add up – and where the results end up is on your face! Second, only foundation will give your face the chic, neat polished look that you need to make any outfit look good – and conversely, if your face looks good, it can make up for what you are wearing! Foundation evens skin tone, and almost all of us can benefit from that. It provides a base (or canvas as you so often read) that will help your blush and other makeup adhere to your face. The foundation you wear should be a quality one and by that I mean you should probably buy it at a department store. There are some less expensive foundations, L’Oreal makes one for example, that you can buy at a drug store, but make sure that their coverage is good and the ingredients don’t break you out (of course this goes for the higher end foundations, too; I think it’s just more likely to happen with cheaper cosmetics). I do not subscribe to the school of thought that says that cheaper products are just as good per se; some may be, but they may not go through the same processes and have the same elements necessary to make a quality product. More expensive products have plenty of propylene glycol which gives the foundation “slip” making it easier to apply. Unless you are prone to breakouts, you need to have at least one foundation that has lasting coverage, especially for travel. I use Estee Lauder’s Double Wear, a fantastic makeup that lasted through a flight (actually 3 flights) to India. It has a great finish, and once in India, in the summer, it was all I wore on my face getting in and out of auto-rickshaws in that very hot sun. I didn’t burn; I didn’t even tan! And it stayed on despite swear running down my face at times. AVOID THESE FOUNDATION FAUX PAUS:     Using foundation that is too pink (go with a neutral colour unless you are very, very sallow).    Leaving a line around your neck or chin so that it looks as though you are wearing a mask (blend, blend, blend).   Wearing makeup that is the wrong formulation for your skin: if it's oily, you've got to go with water-based, dry, try a moisturizing base.        Experiment; don't expect to find the right makeup overnight. And ask for samples at department stores; if they don't have pre-made ones, most salespeople will make a sample of a colour or type for you. Usually, you can get enough for a couple of days so that you can see how it \"wears\". Foundation is expensive, but it's well worth the price when you think not only of how much better you'll look wearing it, but it's worth in practical terms. Donnachloebeauty fashion The Daily Fashion and/or Jewelry Tip Blog travel cosmetics women women-lifestyle makeup skin care Hermes Estee Lauder"},
{"title": "Instant Status", "date": "Saturday, March 11, 2006", "text": "Okay, this whole column is about snobbery, so if that totally turns you off, move on now. However, it is something that we all have to deal with, and some of us more than others. If we are older, overweight, have a certain accent perhaps, or are traveling out of our element, there are some fashion elements and purchases that can confer status (a higher status that is) just by our wearing them.1. A Hermes scarf:I always take one with me when I travel; the scarf is not only versatile (you can cover your head in a mosque or church or just when it is more seemly) but it seems to be recognized almost wherever I go. It can instantly make a black t-shirt and jeans or black twills look more polished and put-together, making you look more polished and put together. If you are scruffy from traveling, wearing one while shopping seems to mean that I am treated better by salespeople. Buy one with a black border if that’s your basic, with cream inside, or a navy border if that’s your basic. I have one of each as well as one that is very, very light so that it looks more summery. And please, please, buy a genuine Hermes from a Hermes store – do NOT buy a fake. You can usually spot these easily, they will not last, and you will not have the same mental boost of confidence that you get from having a real one. If you care for a Hermes, you’ll be passing it on to your daughter and grandchildren. Buy a used one, if need be, but make sure that it is authentic first.2. A good versatile bag:Of course, one universal bag that always confers status is the Vuitton bag, but again, you have to make sure that it is a real one. The best thing about a Vuitton is that you can carry it with anything; the worst thing, of course, is the price. But once again, these last for a very long time. You can buy a Vuitton bag used, also, but make sure it is genuine. Some real Vuitton bags are made in the USA, so that does not mean that it is a fake. Look for the trademarks on the bag, the hardware, and especially look for the tag inside the bag, usually at the bottom side sewn into the seam with the number on it. Counterfeiters are getting smarter though, so buy from a reputable source.Other good bags are high quality Gucci, Fendi, and also Longchamp and Prada (Prada is great). If you travel abroad, I do not recommend carrying Coach or Dooney bags as their status is not as readily recognizable and they may mark you as American (in some places, I’d just as soon people not know my nationality). Obviously, the more expensive the bag, the higher the status.3. Shoes:They need to be real leather or suede and they need to be well-kept even if they are worn. I’d suggest that you have at least 2 pairs of expensive shoes that fit you well in your basic colour (mine are black). One pair should be heels that are plain enough that you could wear them everyday (but you don’t necessarily), but in a style that could be dressed up. The other pair should be flats – a comfortable walking shoe.   When traveling, please don’t wear high, high heels in an airport; they look silly and so will you. People will think that you are an inexperienced traveler or that your taste is inappropriate.  And if you travel out of the country, please, please don’t wear white tennis shoes unless you are actually playing tennis. In fact, don’t wear tennis shoes to travel in – wear your good walking shoes that should be just as comfortable (my loafers are actually more comfortable than tennis shoes and they are easy to slip off and on). beauty The Daily Fashion and/or Beauty Tip Blog Hermes shoeshandbag fashion"},
{"title": "New Hair Product I Recommend", "date": "Thursday, March 09, 2006", "text": "Okay, I have to admit it:  I have grey in my hair - much more than I want. And it isn't a lovely silver grey; it is what I call an iron battle ship grey and does not blend well with my reddish-brown hair. I do have it coloured regularly, close to my natural colour (only better) by a wonderful hairdresser. However, I travel often and usually out of the country. I have tried to carry my hair colour with me that I got from my hairdresser, but it is a pain, and when I was in India once for 6 weeks, even using Lisa's haircolour, I ended up with some very different results (was it the way they applied the colour? was it just the \"Indian atmosphere\"?).  I'd seen the Nice 'n Easy root touch colour advertised on television, and when I was suddenly called out of town for a week at a really crucial point in my hair's growth (one inch roots; I'd put off going to have it done), I knew it was time to give it a try. The result: it is wonderful! I went from looking like some kind of strangely coloured skunk to my usual hair. I wasn't sure what colour to get; my hair is a reddish-brown colour, but I was afraid the light red colour might have too much red, so I settled for the dark blonde. I remembered from long ago days that a blond \"rinse\" as we called them then always made my hair look red. The dark blonde worked! It blended beautifully, and the whole process took less than 25 minutes from reading the instructions to rinsing and then washing my hair.  The only caveat: if you have a lot of hair as I do, then you may want to buy more than one. I have long hair and needed to do not just my center and side parts and around my temples, but underneath as well because I wear my hair up and in a ponytail and I didn't want the dark roots showing around the nape of my neck.   The upshot is that I can't wait to travel with this! If I'd had these when I was driving around Spain and Portugal for over a month, I would have felt a lot better about the way my hair looked!hair color cosmetics hair haircare reviews beauty The Daily Fashion and/or Beauty Tip Blog"},
{"title": "Don't  Go To Bed with Your Make-Up On", "date": "Wednesday, March 01, 2006", "text": "Okay, this is a \"Do as I say, not as I do\" post. I am terrible about going to bed with my makeup on; yes, it is terrible, even at my age when I am not really prone to acne (although anyone is suseptible). Do I really even have to go into how bad it is for your face to go to bed with all the dirt and grime and pollution of the day on your face? I thought not. But more importantly, you also miss the chance to let your skin breathe, and get moisturized. I had a friend who hated to wake up in the morning and see her face\"naked\"; she left her makeup on at night because she really thought that she looked better the next morning with the residue of last night's makeup. If you feel this way, wash your face, then put your eye makeup on and some lipstick, too (a good moisturizing one-maybe slick some vaseline over it). You won't have that blank look that many of us with pale faces have in the morning, but you won't have harmed your skin. If you hate to wash your face with soap and water because you splash it on your clothes or pajamas then you need to buy those wonderful face-wipes (I think Oil of Olay makes some and maybe Pond's); be sure to get the ones that do NOT require you to rinse your face with water afterward. These are so wonderful; they are quick, neat, and disposable; they are not very expensive, and they are also wonderful if you travel much.   Clean your face at night; it will love you for it!beauty fashion moisturize makeup cosmeticsCluny Grey Jewelry"},
{"title": "One of the Best Beauty Products (Cheap, Too!)", "date": "Thursday, February 09, 2006", "text": "What is one of the beauty products that you cannot afford to be without?    Vaseline! Petroleum jelly (I guess I shouldn't use the trade name) can be used for many things, for quick fixes and for beauty treatments.   Use pj on eyebrows to tame those unruly hairs that stick up and make you look like an old man.   See below for using pj to pamper your feet and your hands to make them soft and smooth.   Use pj for your lips; keep a small jar on your desk. Everyone can use this; there are no added ingredients that irritate some people's lips. It keeps lips soft and instantly makes them look smooth.     To do a good job exfoliating your hands and have them feel soft and silky, coat them with pj first, then cover them with an exfoliating cream and rub. Rinse off and wash your hands with a mild soap and them use hand lotion. Your hands will feel wonderful.  Buy some pj (petroleum jelly); it's especially good to use in cold weather!                                                    Donnachloebeauty fashion eyebrows lips cosmetics"},
{"title": "Wake Up Your Eyes!", "date": "Wednesday, February 08, 2006", "text": "Uh, oh, did you stay out too late last night? Did you stay up too late last night? What can you do to help those bloodshot eyes and dark circles? First, use one of the products, of course, that is supposed to help with bloodshot eyes. If you don't have one of those, you should use some regular eyedrops (you need to have these on hand anyway) to hydrate your eyes. Don't forego your eye make-up. Use a dark blue liner, especially on the lower eyelid; this will make the whites of your eyes look whiter. Use a softer eye shadow colour than you usually use, and it is very important not to use too much. For those undereye circles, please don't make the mistake of putting a white coloured cream underneath so that you end up having white circles under your eyes instead of dark ones. Instead, use a concealer only one or two shades lighter than your usual foundation, or unless you are very sallow, use a yellow concealer. The yellow concealer works best on most fair skin that is not yellow based (I love it!), and I recommend its use as a daily concealer also.   Take the eyedrops to work with you and use them anytime your eyes start to feel \"scratchy.\" Try to drink decaf coffee or decaf soft drinks if you regularly drink either, since caffeine dehydrates and you need all the moisture you can get!                                                      Donnachloe eye makeup beauty fashion concealer cosmetics foundation"},
{"title": "A Day of Rest?", "date": "Sunday, February 05, 2006", "text": "Tomorrow is Sunday, and for many people (especially women) it's anything but a day of rest! It means getting ready for the rest of the week, and for some women that can be a lengthy and arduous task. However, you will benefit if you do something for yourself. Take the last hour before bedtime for yourself if at all possible.  Wind down by taking a bath, reading, looking through the latest magazine (that has nothing to do with your job), and spend just a little time doing a few pampering treatments.  First, after your bath (take one, even if you shower in the morning), do your nails. This can mean cleaning them, filing them, and buffing them gently, or it can mean that you do a complete manicure with basecoat, colour, and topcoat. If you can stand it, slather on vaseline and pull on some soft white cotton gloves to sleep in; your hands and your cuticles will be wonderfully soft the next morning. (White cotton gloves, you say? Okay, pull a pair of clean white cotton socks over your hands; remember this is not for everyone).  If your feet regularly hurt and you stand or walk a lot during the day, you can do the same vaseline treatment for your feet (and sleep in the white cotton socks). Your feet will feel great the next day, a definite lift for many of us.  As for the manicure, having clean tidy nails and hands can go a long way in helping to rid yourself of that frazzled, \"I'm not so put-together\" feeling.    While you don't have to use nail polish, having nice hands and nails will make you feel polished!    Donnachloebeauty fashion manicure pedicure The Daily Fashion and/or Jewelry Tips  Blog"},
{"title": "Cover Your Lips", "date": "Thursday, February 02, 2006", "text": "Lips are in - really in, and the bigger, the better. If you're getting older though, the skin on your lips is getting thinner and thinner - your lips are actually beginning to look thinner too (it's no accident those stars are getting their lips done; it's not just for fashion's sake but to remedy what time is beginning to erase).   So what's a girl, ahem, a woman to do? First, use your lipstick. Use a lipliner, but please, please use one that is close to the same colour as your lips if you're going for a more natural look, or one that is the colour of your lipstick if you're trying for something either more sophisticated or vampy. Please don't use dark brown or any colour that makes you look like your lips have been outlined like a person in a child's colouring book. The lipliner will help your lipstick stay in place - and my experience has been that even when my lipstick fades, my lipliner will still be visible - no, not outlined, but visible enough that my lips seem to keep their shape and therefore their fullness.  Line all of your lips; this means the corners also. Don't make clown lips, (this does take some skill) but you must have a line that goes all the way around your lips continuously. This isn't easy to do at first, and it is probably one thing that most women omit doing. But if you line the corners of your lips and then fill them in with your lipstick, your lips are going to look fuller, and more naturally full.  Remember that gloss is supposed to make your lips look bigger, too (but usually you'll have to keep reapplying it throughout the day).  Note: when I travel and know that I can't keep applying lipstick or when I know that I can't even carry one with me, I will actually moisturize my lips while I'm getting ready, then before I leave the house, I will use lipliner instead of lipstick! It lasts, and even in the lights of an airplane bathroom I can still see my lips!beauty lipstick cosmetics cosmetics lips fashion"},
{"title": "The Scent of Beauty", "date": "Wednesday, February 01, 2006", "text": "Imagine: Kim Bassinger in a movie talking about her childhood when her mother would put a drop of perfume in a glass of water and tell her,\"Drink it, it will make you feel pretty inside.\" I love that. Mostly because while you can look like Hudweiler the Hag, for the most part beauty, sexiness, prettiness comes from the inside. And when you do something to make yourself more attractive, something that is noticeable to other people, you are going to be more attractive as long as you remember that you DID something. So this morning, since it's probably too late to do anything else, put on some perfume. Yes, make sure that it works for your body chemistry, that it isn't overpowering for work (if that's where you're going)and that you don't actually bathe in it. But put some on. I don't know about you, but I've gone fluttery in the tummy standing next to a man that smelled so good and masculine that every sexual/sensual nerve in my body suddenly started doing somersaults.   It's gotta work the other way, too.Donnachloe                      beauty perfume fragrance scent fashion"},
{"title": "Still Tweaking", "date": "Wednesday, January 25, 2006", "text": "Hi, All!I'm still working with the site and trying to get it to work right.  Tips are coming soon.Enjoy tomorrow; Wednesday is over the hump day, so it's getting really close to the weekend. Plan to do something this weekend that is pampering to you, even if it is just taking a long bath! (With bubbles, or better yet, moisturizing oils). Take a long look at your elbows and heels; summer will be here before you know it, and everything (well, probably your feet and elbows, anyway) will be showing!DonnachloeDonnachloe beauty fashion"},
{"title": "Another new post", "date": "Monday, January 23, 2006", "text": "this is a bitch!"},
{"title": "Just Getting Starting...", "date": "Sunday, January 22, 2006", "text": "blah blah blahdonnachloe The Daily Fashion and/or Jewelry Tip Blog"}
]