[
{"title": "Pizza, Cats, and Other Kinds of Love", "date": "Saturday, February 27, 2016", "text": "\"Auntie, do you have someone you love?\", Tracy's six year old niece casually asked her on their outing. Tracy knew what Emma was really wanting to know, but chose to answer her in an auntie sort of way. \"I love  Grams and Papa, your mommy and daddy, Uncle Drew and Uncle Jake,\", she responded. \"And of course, you little munchkin, I love you the best!.\" Tracy tickled her as she said that.  Through peels of laughter, Emma declared, \"and ice cream.  You love ice cream!\" Love really is a funny word, particularly when discussed with a six year old. Of course Emma wanted to know if she had a someone to love like her mom and dad loved each other, or as the child's grandparents, Tracy's parents loved each other.  Even her brothers, Drew at twenty four, and Jake at 20 had significant others. Yet Tracy, not wholeheartedly content with her life in the relationship department, the eldest in the family, approaching 30, had nobody to love in that way.Really, there never has been a significant other. The longest dating streak with anyone she had was a little over a year, and that went back to college. Moving several times for her career, and now, what she hoped was a longer term move to Chicago, it seemed like a good time to think again about settling down. Having her niece visit for the weekend was stirring all kinds of nesting instincts she had been suppressing.Tracy's sister Melanie and her husband Jason were celebrating their 5th anniversary this month. High School and college sweethearts, they learned they were expecting Emma right before college graduation. It took a couple years before they officially married, though seem to have been a married couple since they were both 17. For the official anniversary, the couple thought it would be a good weekend to make the six hour drive to Chicago to see Tracy's new condo, and perhaps snatch some free babysitting while they took a couple days and nights exploring the city. They wanted to come the weekend after Valentine's Day, assuming everything would be overpriced or overbooked the weekend before. Tracy was over the moon with the prospect of one on one time with her niece, and planned a Chicago weekend of their own.Having never been on a train of any kind in her short six years, Emma was fascinated by the \"L\". They had a great time exploring the Chicago Children's Museum, visited the Navy pier, and ate Chicago deep dish pizza. Though Emma liked the sauce cheese on top, she said very definitively that pizza is supposed to be flat. \"Chicago is famous for this kind of pizza, and I love it\", Tracy responded, with a poor word choice. Over pizza and lemonade, the word \"love\" reminded the child she still wanted answers. She didn't let up on the love question. It didn't help that the remnants from Valentines's Day were still sprinkled throughout the city. \"Yeah, you can love pizza, but why don't you have someone like daddy or papa?\" The child thought a bit more, remembering something. \"You don't have to have a boy to love. Libby has two mom's instead of a mom and dad.\" This was followed by, \"Daddy thinks you should get a cat. I heard him telling mommy that.\"  Great, Tracy thought, not yet 30 and already labeled the spinster aunt. Not wanting to get defensive to a child, but also wanting to impart a few gems of wisdom, she thought how she should respond.\"Em, there's a lot of people that I could find to love like that. I just haven't yet.  Until then, I am so lucky that I have all kinds of other people that I love and make me happy.\" She paused, seeing the wheels spinning behind her niece's eyes. \"I  have friends that I love and spend time with.  I love having adventures in my new home, like we are having today. I love that you came to visit me.\" For the moment, this seemed to satisfy the child.It had been a full day, so they called it done at about 6:00 and headed home to make mac and cheese, popcorn, and watch a movie. Emma was out within 15 minutes of the DVD beginning. They slept in a bit before heading out for Sunday brunch and a trip to the science museum, before meeting Emma's parents back at her place. They decided through text messages on a meal together of Chinese take out before the family got back on the road for home. The subject of love stayed at bay for a long while until Emma saw her parents again. Tracy had left them the code and keys to her place, and they were already there when the wanderers got back, take out food in hand.Emma gave both parents a hug, and started telling them very quickly all about her weekend with Auntie. Her parents were amazed at the detail she recalled, and smiled at Tracy, her sister mouthing \"Thank you,\" at least a couple times. Then, out of the mouths of babe, love made its way back in the conversation. \"And daddy,\", Emma went on, \"Tracy may not want a cat. She has to save room for someone else to love. That guy will need to love pizza and she hasn't found him yet.\"  Love is a simple and complex, funny word.This short story is part of the Write and Link project at In the Writer's Closet. We take the cue of the month, and the lovely Natalia opens up a portal for us budding writers to share our hopeful gems of creativity. Please join in as a reader or a contributor.  It's great fun!"},
{"title": "The Belfry", "date": "Saturday, January 30, 2016", "text": "Bruges Belfry-Picture from WikipediaI want to travel the world, and Belgium, specifically Bruges is on my list of places to visit. While quite a dark movie, one of my favorites is In Bruges. Two hit men are sent to Bruges to hide out until the fate of one of them, who messed up a hit in a horrible way, is decided. I love Brendan Gleason's character as he attempts to make the banishment a sight seeing trip and explores all the wonders of the city. I always wanted to write something that took place in the that city after seeing that movie, using the Belfry, as in the movie, a pivotal character. Again, I might have gone all Harlequin on the story ending, so forgive me.Here are all the Write and Link submissions. The BelfryThe stairs were steeper than Connie expected, but she was determined to make it to the top. She knew she had lost a lot of her stamina in the last two years, but had turned a new page in her life with the turn of the calendar. She missed her old self, and decided she wanted her back. A few years earlier, as she approached 50, she slowly stopped doing many of the things she enjoyed.  These were activities that were keeping her toned and strong. Never having been particularly career driven, an evening with a calculator after an older work friends retirement party put some fear into her about her own future. Naomi was retiring young, at 62, with a tidy self funded retirement account, a husband with a firefighters pension, and they were going to now see the world. Hearing about Naomi and Franks plans, Naomi faced the reality that she was in her own boat for a future retirement.  The numbers didn't look good.  She had been putting a paltry 10% of her  income aside, but decided she now needed to contribute to the maximum allowed.  When she hit 50, she did the catch-up funds. This ate into her paycheck and soon her gym membership and rock climbing club went by the way side. She started scrambling for overtime, working late, eating microwaved meals, and using her lunch break for running errands she was too tired to do evenings. It was too much for Naomi, the loss of her carefree friend, who insisted Connie join her and Frank on their Belgium portion of their European tour. They had a cute two bedroom apartment in Bruges for a week, plenty of room for an extra, and air fare rates were at bargain prices. They specifically added Bruges so they could spend time with a younger cousin of Frank's, named Jack Cavanaugh, who was living in the city. Jack lived alone, his ex wife and adult children were back in the US.Now here was Connie, in this beautiful Belgian city, looking up the staircase to make it to the top of the famous Belfry, back to her carefree self. \"This will be magical,\" she told herself, having associated the Belfry with old world mystery and intrigue.  With each step, she pushed herself  along, a little smile forming at her lips.  She was happy her friend nudged her to come. The panic at being an old  woman who had wasted her life living like a carefree twenty year old, and now had to live on cat food, was gone. The annoyance she felt in the last twenty years since her divorce at well meaning friends and family trying to set her up with  just the right guy was stamped under each foot step. It wasn't that Connie shut the door on finding a partner, but she was happy enough with her life that she was not willing to settle for anyone less than perfect for her.  After a ho hum existence with the wrong person, she wanted something magical. At the top, she found glory. She saw the canal and people watched as they strolled in the open market. Before her climb, uncharacteristically, Naomi complained of a sore knee, and Frank didn't want to go up without her. She spotted them standing at a fruit cart, buying something, and walking towards a bench in the center. Naomi looked like she was walking perfectly fine, not favoring her strong knee whatsoever. She turned to take a look in the other direction and came face to face with a handsome man, almost bumping him in the nose with the top of her head. \"Excuse me!\" Connie said with a laugh, not knowing if he spoke English. \"I need to watch where I turn.\" He smiled a warm smile back at her. \"Not a problem at all. What's a bump on the nose between fellow Americans.\"  They chatted a moment about the sites, the sounds, the history of the city.  \"It's just magical.\" Connie said.  Standing with his hands in his pocket he said, Do you believe in  magic, Connie?\"  Not recalling saying her name at all, she was a bit taken aback. \"I have to say, excuse me again.  I don't believe I told you  my name.\"  He took his hand out of his pocket and extended it towards hers. \"Of course you didn't, but it is nice to meet you. My name is Jack.\""},
{"title": "Sleep Has Won", "date": "Tuesday, October 13, 2015", "text": "I've let my body decide to take the opportunities for sleep when needed.  I've been a sparse blogger on both sites.  The RA is flaring up and with a trip this week, I've decided to take a safe route and not push to keep up on prompts and poems.  I have plenty of inspiring themes though and may dive in tomorrow when we have a layover. For Justin and Natalia, I'm reading everything you write. I have a few ideas for posts swirling in my head so look out when I decide it is time to catch up!"},
{"title": "Nature Doesn't Look at a Calendar", "date": "Tuesday, October 6, 2015", "text": "54Write about changing seasons, that very particular time in theyear cycle when it is not Autumn yet, but already passed Summer… Natalia has provided an interesting idea for day 54.  For more prompts, click HERE.. Nature clearly doesn't bother to look at a calendar many times during the year.  If it forgets to look in the fall, and pretends it is still summer, I won't complain a bit. We had the most glorious of all Septembers and it appears October is trying to match Septembers tone.  The days start out crisp and cool-but not cold.  It is not the cold where you suck in wind and your throat hurt, but the coolness that feel like you are sucking on a tin of Altoids-refreshing and cleansing.  There is still plenty of green all around us.  Our yard is lush and long and almost looks like someone was out with a can of spray paint the green is so deep.  We are getting a touch of the yellows and orange, but not enough to be thinking pumpkins and turkeys yet. While lounging pool or lakeside in a swim suit and daiquiri by my side doesn't quite see to fit, spending a couple hours on the deck in lounge chair with a light sweater and either a book or my computer perched on my lap is not only doable, but entirely pleasurable.  Five weeks into the school year and I haven't had the morning argument once yet about grabbing a coat because it is too cold outside for just shirt sleeves. I am a four season kind of gal. While we get the early spring days that tell us winter will soon be a distant memory, the lack of color, the remnants of brown and grey, and the dirtiness of the last of the snow, masks the warm feelings.  Someday I want to to be able to pick how long the seasons last, by moving my destination to suit my preference, but for now, I am happy in this 5th season of Sumfall.  7 minutes 53Write about a village, real rural countryside. Do you idealize itas many writers and poets have done? Or, as Agatha Christie, see its dark side?Rise and Write is back and I am having fun again.  The Island VillageI fell in love with the Bennett's Island series of books written by the late Elizabeth Ogilvie.  The first book I ever read, The Season's Hereafter, when I was sixteen started my love for Maine and Island communities. Besides being a proper Anglophile, I am a Maineophlie as well, and spent my high school years dreaming of going away to college in Maine, and getting a job for the summer in a quaint fishing village just off the Maine coast. I learned years later that Seasons was actually part of a series of books, that originated some twenty years earlier, with a story line told in book one through a flashback to pre-depression, 1920's glory, moving into the depression.  In both books, I learned about the island village, which consisted of the various family houses, the little store, fish buyer, and post office all in one, and the little school. In book one, read more than a decade later, I learned the back ground story on most of the main characters.  I grew up with them-came of age with them.  I suddenly understood the references in the newer book.  There actually were nine adult books in all.  Three focusing on the main family, really the eldest daughter, then three more focused on newcomers to the village, and three more, that incorporated the next generation in more detail.  The last was written towards the end of Ms Ogilvie's life.  She wrote some children and young adult novels set on the island as well.  Of course, I read them too, and enjoyed them with my daughters. Bennett's Island is the fictional version of the real island known as Criehaven, where the author spent many summers.  The island village was in her blood, and she chose to immortalize in her beloved books.  You can see picture on the Internet of how the village looks today, though I believe there are no year round residents any more, no school, and no store at all.  However, nearby  Brigport as it is called in the books, but is really Matinicus, still has a thriving, if not tiny year round community.  Spending a week on either Island is on my bucket list, though Matincus is probably more likely as it actually has accommodations. That is the wonder of a good story teller.  They create such a vivid picture of something, you want to be there.  I want to be whisked away to another time, another place, and be absorbed in the island village life each time I pick up one of her books. 16 minutes"},
{"title": "What's behind the door?", "date": "Sunday, October 4, 2015", "text": "52Write about a door – wooden, glass, heavy, tall, Dutch door, garage door or a magic door (Open, Sesame)…OPTIONAL: Work on your fiction and share. Read more about Rise and Write here.What's behind the door?I have little envy of the Real Housewives of any where. Their lives seem chaotic and filled with ridiculous drama that if not scripted,which I highly think it is, you couldn't make up.  The weekend get aways at 5 star hotels and personal chefs-who care!  I can meet up with a friend, a real friend, any weekend for a walk around a neighborhood and a stop at a coffee house, and sit down to a homemade pasta dinner. No, if there is anything I envy is the always immaculate and spotlessly clean homes.  Of course these homes are camera ready at all times, and come with cleaning personal.  I would love to live in a house in which I do not feel the need to keep certain doors closed at all times.  I know most people have the room of doom, the clutter room, the space with a head case.  I seem to have many of them.  Closed doors are my friends. I can spend a whirlwind fifteen minutes and get my immediate walk in space tidy enough that I don't want to crawl in a drawer if my mother in law shows up, but if she opened those doors, I might burst into tears. Those doors are meant to stay shut, unless I or a family member open them. A few months ago, we wrote about door knobs. Like my door knobs these are basic house grade doors-nothing unique.  But when they help hid my clutter, or my unmade bed and dirty laundry strewn shamelessly about the room, they became my ally.6 minutesThis is prompt 51 in Rise and Write.Write about a queen. Is she a real figure in history or a fantasy character from your favorite fairy tale? Is there some thing about her you find admirable or enviable? Is there something that you dislike about her or her status?OPTIONAL: Work on your fiction and share.Beauty QueenI've not been into the whole pageant Queen lifestyle but the last six months, I had a bit of interest.  the daughter of a woman I went to high school with was crowned Miss Minnesota about six months ago, making her the state representative for the Miss America competition.  I followed her mother's post of her daughter the pageant Queen, and even watched the television program.  She looked stunning in her 10 seconds of national fame, being able to announce her name and a bit about the state.  She did not make it into the semi finals, so other than a crowd glimpse, that was all.  I must say, I do not understand what the criteria.  There evening gown, physical fitness-what they now call the swimsuit  competition, evening gown, and a random question.   That I found completely  random.  Two girls received questions on such hot button topics as gun control and Planned Parenthood, while another got a question on Tom Brady's participation in the deflated football.  I watched to support my former classmate, her daughter, and community, but I think I am done.  Good for the women that truly enjoy this kind of competition.  It is not my thing, but if they enjoy the challenge, more power to them. Five minutes!"},
{"title": "Toes", "date": "Thursday, October 1, 2015", "text": "50Write about fingers (or toes). Do they belong to your character?Are they lean and long “artistic” fingers, or short and chubby? All of them inplace? What are they good at?  I am back and will try and keep my end of the bargain, even if I only write 5 minutes a day.  Here is the rest oft the Rise and Write prompts at Out of the Writers Closet.Toes Toes are the most wonderful and the most silly of all body parts.  To look good poking out of a great pair of sandals, they need to be trimmed, buffed, and manicured, and ideally painted a fantastic shade  of color.  I have no patience for any of that nonsense, so my toes always look  unkept, and dry.  I was born with a partial web between my toes, just plain odd. I got them form my mom's side of the family and passed this lovelye trait to my son and youngest daughter. But, the opposite of weird grown up toes, are sweet and adorable baby and toddler toes.  What is better than seeing those first little toes on a newborn baby? I love to see the foot print of baby's, and see the toe print uniquely tied to that precious new human.  No two will be alike.  How fantastic is  seeing the curling toes as the toddler uses his toes, in a chimpanzee  like manner, to help grasp the floor as he steadies himself learning to walk. As the weather gets colder, I'll see fewer toes in my Midwestern home. I can guarantee you though there will be those hold outs that will wear open toed shoes until snow is on the ground. Not me.  I want my toes to be nice and snug.  Unless of course, I can slip away to a nice southern beach. 8 minutes"},
{"title": "Long Overdue Sorry", "date": "Sunday, September 20, 2015", "text": "49 (Sept 21)Write about being wrong. Is it easy for you to say \"I am sorry, I was wrong\"? Is it something you do or try to avoid doing? Write about someone else being wrong, or about your character being wrong. For the link to Rise and Write click Here.I was so wrong and I knew it.  The minutes the word's came out of my mouth, I knew it was mean and cruel. \"Stay out of my life!\" These were the last words I said to him, as he walked away. I could not take them back, and went on about my night and the next day.  Weeks passed, and I never made that phone call, never asked about him at all. Months passed, and then it was over a year. I had moved on, met someone else. Years later and I saw him at the same New Year's eve party.  I was now newly married, happy starting a life with someone else.  He had a date, with though, I learned nothing serious.  We exchanged polite hello's, nothing more.  My husband looked at him a little suspiciously, out only for a second, confident in our own relationship.  A decade went by, and we were at a reunion.  Both of us were without our spouses.  Both of us, me more than him, had more than our share of the beer included with our reunion ticket. We talked.  Suddenly, it all came out.  I finally apologized. I didn't  apologize for us breaking up.  I didn't apologize that I met and married someone else, I apologized for cutting him out in such a cruel an immature way, more than just that final blowup.  It was so evident that we were not in the same place mentally and emotionally.  It was evident that we wanted other things in life at that time. My way of handling it had been passive aggressive for months on end, until finally, I cut the cord with those five words. He laughed at me a bit, but also said he understood.  He too knew we were not the right long term fit, and that  he was just prolonging the inevitable, but showing up in the middle of the night that last time was a last effort to see if things could be salvaged. We both wish we could turn back the clock thirteen years and have the heart to heart we should have had at the time.  While we can't do that, we can move forward.  Our wounds have heeled, and we can see each other, our spouses, our children, and not feel that pain of the past lingering over our heads.  48 (Sept 20)Write about wrinkles - yours or on someone's face, or maybe your character's. What stories wrinkles can tell?OPTIONAL: Work on your fiction and share. Out of the Writers Closet  Rise and Write is an on line writing community hosted by the talented Natalia Lialina.  Visit to learn ore and join in  It has been incredibly fun and a great learning experience.  I''m continuing to work on my short story, or potentially building it out to a book.  Here was the last excerpt: Kara studied her face in the mirror in the hospital bathroom.  Not to be for her age.  Even with the years she spent in the summer sun, she was adamant about sunscreen well before anyone was preaching the gospel of it.  She also liked to read outside, so found that a shaded reading spot, thanks to the benefits of a beach umbrella, didn't give her headaches lie the sunshine, so she could experience the best of all summer worlds. heat, sun, and endless days for reading.The only signs of wrinkles were a single crease when she looked sternly at her face, furrowing her brows, and a touch as she smiled-laugh lines. Her own mother looked older than her years all the while Kara was growing up, though she never thought so herself.  She held onto her youth, wearing swimming suits in the summer meant for younger women, and .was more apt to buy her clothes at the Gap than at Chico's. Kara laughed in her head at that, as it wasn't entirely true, but her mother was always quick to jump on the clothing trend, even now as the grandmother of grown and near grown grand children.  Even this morning, as Kara was frantically trying to help get her mother dressed, her mother insisted on wearing one of her new long maxi  skirts, very impractical for a woman with balance issues and prone to tripping. Kara didn't try to argue.  Her mom being insistent on what she would wear was a sign that her mom was still her mom inside.  She was stubborn, and inappropriately dressed, as Kara had always thought of her mother, and in that she was comforted.  There had been many times in the week that Kara was shocked at how quickly the memory loss and the personality changes were coming on.One day she was insisting on waiting for their father to join them for lunch, even though her had been dead for nearly a year. When Allison came with groceries, her mother through a fit about the strange lady in the kitchen stealing food from her cupboard.  She hadn't recognized her daughter in law, and thought she was taking groceries out, not putting groceries away. There had been rough nights as well with the heart disease. Fluid was continuing to build up, and the discomfort her mother felt was painful and confusing. In her moments of clarity, she talked with both Kara and her brother about her  wishes for when she passed.  When she was struggling with memories, she cried for her own mother to help make the pain go away.  It was heart wrenching to watch, and Kara though particularly cruel to have her mothers body and mind being attacked so viciously at the same time. Kara didn't know if it was wrong or not, but she prayed for relief, prayed for her mother's suffering to end. When Kara went back to her mother's room,she was now in a hospital gown, her  skirt and top folded and placed in a plastic patients bag..  Kara went over to her mother and squeezed her had.  \"alright mom?\" she said, with a small smile.\"You look pretty comfy in that fancy gown.\"   Her mother laughed a little bit, through a grimace of pain. \"I don't understand why they can't make these things look a little better  I feel like an old woman.\" She laughed then, and KAra could see her mom's laugh lines, and suddenly, she looked younger, more vulnerable than Kara had remembered her."},
{"title": "Cinderella-NOT!", "date": "Friday, September 18, 2015", "text": "I had a much needed break from writing daily prompts, or much of any blogging.  My last two blog posts on my other site were a bit naggy then preachy.  I knew the change in fall and school routine was catching up.  I am back now, and hope to have a good bubble or to of thought.  Rather than catch up with the prompts I missed, I'll pick up with today, day 46 (Sept 18) prompt. For more, visit Out of the Writers Closet Rise and Link page.,Write about housework chores, such as vacuum cleaning or mowing the grass. Who did it in your childhood home? When you were introduced to this work first? Is it something you enjoyed doing or tried to avoid at any coast?I am not a fan of housework of any kind.  In fact, the main thing I like about staying in hotels is that someone else does the  housework.  It is not that I a lazy, it is that it just seems to be a never ending chore, and no matter how much we say we are going to stay neat and tidy after a major house overhaul, within two weeks, (despite doing the daily maintenance) the housework piles up.  To  be honest, this is probably rooted form childhood.  I don't ever remember not being part of  the house cleaning crew.  My own bedroom might have remained a mess, but the \"public places\" were always cleaned weekly, top to bottom, by my sisters and I.  Granted, my mom worked a full time job, and did a lot o car hauling us around, so doing our share should not have been a burden.  I remember it hen though as well.  The house would be clean, and then the next moment, not. The single most chore I hate more than any other has to be scrubbing the floors.  Scrubbing the floor screams Cinderella to me.  I hate the smell of the cleaning fluid in the water.  I hate the tip toeing around the wet floor afterwards until it dries.  I really hate when it is clean, and then that first sticky mess gets made, and it is as if it had not been cleaned at all. I never hear any chirping birds or cute little rodents singing me songs of motivation.  I just seem to find dirt in the crevices between floor and baseboard, so inevitably, I am on my hands and knees as the mop won't really reach those spots.  I like a nice clean home, but I so rarely have one.  I cam home yesterday for work, and the first rooms you walk into had bin spiffed up.  I have my husband to thank for that.  When I walked around the corner to the kitchen, unfortunately, The floor was as I had left it when I left for work.  I will not be able to put it off any longer, so scrubbing the kitchen floor just rose to the top of my weekend plan."},
{"title": "Just a Note-On a Little Writing Break", "date": "Wednesday, September 16, 2015", "text": "The start of the school year, a research project and launch of a new competitive grant at work, and the absolutely wonderful second summer weather has kept me off the computer and to in a mind set for anything creative.  I will revisit Natalia's prompts shortly, once I get caught up with the new routines in my house and develop a normal sleep patter.  In the meantime, check out Rise and Write at Out of the Writers Closet for those that are still going strong!"},
{"title": "We're talking Baseball", "date": "Friday, September 11, 2015", "text": "37Write about a stadium – either a real one from yourchildhood, or the one next to your home now, or a grand one you once visited,or write how you’ve never even been to a stadium. We'll give poetry a try. I don't technically use a stadium, but rather a major league ball park, but I hope you can picture a wonderful stadium/ball park on a perfect summer night.  Rise and WriteThe starting line-upboys of summer take the fieldpumping fists in gloves.Batter one to the plate'catcher signals his pitcher.The pitcher nods yes.Batter licks his lipshe clenches the bat tighterthe ball sails, strike oneBatter is ready;he knows the ball his bat wants.He waits patiently.The ball is releasedIt looks like a perfect pitchhe swings the bat hardCrack! The ball takes flightsailing over the infielders headsPast third base it goesLittle boy with arms outoversize glove on his handthe ball lands softlyMemories for lifehe falls asleep with his ballon the long drive home.   38 Write about the age you are now. How does it feel?Better or worse than you expected? Rise and LinkI will turn 50 by the end of the year.  Where did these years go?  Both my parents and my in-laws were grandparents well before they turned 50, but I can't imagine that  experience happening for many years. While I am reaching that milestone year, I am not bothered about it all in terms of age. I am dealing with chronic arthritis pain, but most days I just push forward and function the same way every elses does. I have more blessings that bothers in the big sense, and genuinely believe I have a good life. Over the last decades, as I have developed friendships with people both older and younger  than me, I have learned not to have expectations about what life should or will be like at certain ages. For instance, my friend K, a confirmed bachelor for most of her life. She never met anyone in her younger years, though she had several proposals, that she wanted to build a life with. Then, about ten years ago she met J, a single parent of two grown children, and grandfather of three. K and J just celebrated their 7  anniversary, and K's 60th birthday.  Life just is.  Age really is just a number in my head, but using my age as a point of tracking time, I sometimes get completely overwhelmed.  While I didn't put expectation on myself  and my life-married by 22, children by 25, promotion by 30, grandparent by 55, and so on, I do feel like the years are going by faster than I have time to experience everything I want to. I want to be there for my kids milestone events-their plays, their concerts their film debuts, their nesting in new homes, their day to day life.  I want to be there for my friends and family and experience their highs with them, and support them in their lows. I want to make sure I have time to hang out and just play with my friends! I want to volunteer more and help make a difference  in the world. I want to have the time to travel, and not just travel to new places, go back to the places I really loved and dive into the culture, the atmosphere, the day to day happenings as more than a tourist. I don't aspire to be rich, but I realize that to do all the things I want to accomplish, all the things I want to experience with regularity, money is a necessity.  To those ends, I get overwhelmed at times in prioritizing where to spend my money and where to spend my time. Fifty as an age is fine by me.  Fifty as a marker that my life is probably more than half over, is a bit daunting.  Yet, the saying Every Day is a Gift, is so true."},
{"title": "My Grandma", "date": "Friday, September 11, 2015", "text": "39Write about your grandma. Was she a good cook? Did shetell you stories of her life? Did she yell at you or spoil you rotten? Rise and LinkMy GrandmaI am number nine of ten children in my family, my dad already 40 when I was born.  He was also one of the younger children in his family.  My mom only had one older sister, how had two children, decades older than me. This made me and my sisters on both sides of us, the youngest cousins on both sides.  We actually grew up more with the children of our cousins.  This is not unsimilar to how my youngest is, with thirty years between my oldest niece (just five years younger than me).  My mom lost her mother before I was born, and my maternal grandfather died when I was just three, as did my paternal grandfather.  I give this as background to share I only knew one grandparent, my dad's mom.I am not sure when she moved, or probably was moved, from her rural home into an apartment in the town near where I grew up in the country.  The apartment was a mother-in-law style apartment made form the attic of a two story house.  That alone made this a fun pace to visit as you went up two flights of stairs to reach her cute little apartment. In hindsight, having a 70+ year old woman moving into a living space that required her to lug groceries, suitcases, or any other things up two flights was probably ridiculous, but she lived there at least past 80.  Eventually she was moved into first an assisted living apartment, and then a nursing home before she passed away at 87.My sisters and I would often spend Saturdays or school days off with our grandma, once we were old enough for school. She lived in walking distance of a park with full playground and ice rink in the winter, a large grocery store, and just two blocks away, a tiny little store that carried milk, bread, and a few other staples, but mostly snacks and  soda pop, and most impressively, bins of penny candy.  This is my strongest memory of spending time with my grandmas is walking to the little store with a hand full of pennies and maybe a nickle or dime, and coming back to her apartment with a full plastic bag of candies.  My grandma kept a margarine or Cool whip tub with her odd change, and form that, we were gifted our treasure to exchange for an even sweeter treasure. Grandma kept toys for us, as well as paper dolls, and coloring books and crayons, really, all kids would need to keep busy, chewing on our candy or sucking on our lolly's. Those were lovely days. Most pictures we have of her were either black and white, or if in color, were of her a bit older, so I don't remember this, but I was told she had red hair, and with her very fair Welsh-Irish skin, she was stunning. I remember that her eyes smiled. I am ashamed to say that once she was in the nursing home, visiting her became a chore, or rather going to the home, became a chore.  The home was not in our nearby town, but 30 minutes away, and depressing. My grandmas's eyes didn't smile when she was in the home, though she still laughed and liked to talk with us. One thing I will always be grateful for is that both of my parents lived in their own home until they passed away. When she passed away, this was the first time I remember ever seeing my dad cry.  I didn't see his tears again until my mother died. Even when he lost two of his sisters and his younger brother, he was stoic, but losing the two most important women in his life made even the toughest of men shed tears. The prompt for today is to imagine that today is the last day of a long hotsummer. How you would like to spend it? Is there anything you wanted to do thissummer, but haven’t had a chance? Is there anything you’d like to repeat? Writeabout your ideal summer day, or about how exhausting long summers are, whatevercomes to mind. I am going to pick up with my character from my short story, Calm in a Storm, as this prompt seems to fit.  Eventually I think I will string these together, get a great editor, aka my daughter, and see if I might actually have a complete novel. For the rest of the prompts and other entries, visit Rise and Write.Last Day of Summer It was a week since Kara and the twins  took three days to drive home from a summer trip back to her home state, and the family lake cabin. Now, while the calendar said September 7th, and summer technically didn't end until September 21st, this last day before sending her youngest kids back to school marked the true last day of summer for her. The college Paul worked at would start classes later in the week, but he was spending long hours already prepping his teaching assistants, and working with graduate and PhD candidates.  Brent, was a week into classes on the other side of the state at his university. Kyle and Courtney would be juniors, two years before they were out of mandatory school, and on to their next adventure.  Kara hope it meant college as well, but the parenting principle she tried to live by was not pushing her personal agenda onto her kids plans. Of course, she would heavily make all the arguments of why college would be the best choice, but ultimately would support them, as they did Brent when he originally was going to take a year off, and keep working for the Parks department. Good fortune intervened, when Brent was offered a part time job doing similar work near the university he was accepted into. Paul had worked a few connections to arrange an interview, but Brent's passion for the work, even as a high school student, must have shown in his interview.  though he was only going to start with generals, he declared a major in Natural Resources and Conservation mid year.Kara sat at her kitchen table and had a long think.  She had bulked up on her vacation, as well as took a few manuscripts along on the trip and working remotely.  This was how she was able to be out of the office for four weeks, but she too would be back to work the next day. She did have a very flexible schedule, and could work form anywhere really, but a certain amount of face time with authors, with the Editor in Chief, and her colleagues made a few office days a month necessary.  She knew tough with the bombshell news she received the last night at the cabin, that she was going to need every ounce of flexibility Pearson Publishing would allow. \"Early on-set Alzheimer's couple with a dose of congestive heart disease,\" her mother said out of the blue when she came into the bedroom where Kara was packing up their clothes. Her mother was sick and would be getting sicker. There had been many signs of her mother's illness, but Kara had brushed them off by interpreting them as her mother's grief, experiencing the first summer after the loss of her husband, Kara's dad. don't we all, Kara had though, walk into rooms and forget why we came in, or start a conversation, and sometimes forget what our point is?  Don't nay of us get winded if we over exert ourselves, are thirsty or if it is very humid? As Kara thought more though, she realized there were entire gaps in clarity with her mom.  A conversation they were having about Kara's aunt Jane and her spouse, Charlie, quickly shifted by her mother.  \"I don't know about that.\" her mother had said, when just minutes before, she was sharing the same information.  She also repeatedly told the same story's from decades earlier, but struggled with remembering how old the grand kids were. In another week, Kara was going to need to do a quick two day trip accompanying her mother to doctors appointments and her attorney.  Jim, her brother, would attend these appointments as well.  Her mother wanted to be sure her children knew her wishes and would understand the details of both her medical needs as well as her financial picture. The earlier  bombshell regarding her brothers bankruptcy, reared its head again. Was there eougth left, after the large investment her father had made, to ensure her mothers care and comfort?  while her borhter was full of talk, she believed he would never do anything that would jeopardize his mothers future, or that her dad would have been so secure in her brothers financial skills that he invested in a level that impacted his and her mothers own safety net, but Kara was still nervous.  This is how Kara spent her last morning of summer, with fret ans worry, two behaviors that were not normally part of her being. She wanted to be thinking about having friends over for a labor day barbecue, but hadn't plan anything. She wanted to be thinking about fall college fairs and SAT and ACT tests for her juniors.  She wanted to think about laundry, anything but having to be thinking about her mothers  quick decline in health. Her last day of summer was now marking a new stage of life."},
{"title": "Peace", "date": "Monday, September 7, 2015", "text": "35Write about feeling peace. What brings peace to your inner state? Is it being in nature, or being alone at home? Describe a particular situation when you are (or your character is) feeling at peace with yourself and with life. Rise and WriteI've been doing a bit more poetry.  I haven't made up my mind if I like it or not.  I used the haiku 5-7-5, but in multiple verses, and I tried with the Anger post, to just write, breaking the \"story\" up in four line sections. I've never studies poetry, so don't know much about style, but I know words and phrases  that I like, and though the topic of peace would lend itself well to a poem.PeaceFamilies celebrating new additions,Friends laughing in a pub, Neighbors helping each other,Children playing in the park,Teachers sharing their love of learning, Athletes shaking their opponents hands, Artists creating their visionChurches feeding the poor, Leaders using power for humanity, there can be peace.34Write about reptiles. Most people have very strong feelings towards them – either love or hate them. Which are you? (Or your character?) Rise and Write \"Snakes. It had to be snakes.\"  I can relate to Indiana Jones' feelings when he first lit that torch and saw the hundreds, if not thousands of snakes in the pit in the movie Raiders of the Lost Ark. Don't get me wrong, I think snakes are incredible creatures.  The way they slither and move to get to their destination, heat and cool their bodies in rhythm to the earths sun, come in all sizes and colors, are remarkable traits. I want to appreciate them from a distance however.  I've never understood the fascination of snakes as pet. Keeping live or frozen versions of whole prey for their meals is an image that makes me sick to my stomach. while the slithering motion and coiling is cool in a picture, or behind a glass barrier in a zoo, having either behaviors on my arm, or worse, my neck, the thought alone make me shudder. Another fascinating, yet terrifying snake fact is the massive variety that are poisonous.  Unless you are a snake expert, and even then I wouldn't trust their judgement completely, how do you know which are venomous and which are passive?  Here you are , Mr. Green Belly slithering up next to you while you're out reading on your front lawn, when suddenly, out comes his teeth into your leg, and you lay there in a state of anaphylactic shock. It was just a little garter snake, but something similar happened to me once reading on a blanket outside.  He slithered right over my blanket, touching my bare foot, and just stopped for a moment, me, in a state of disbelief, until my reflex kicked in and I jumped up shivering from the thought of it touching me. I love to travel, and I love nature.  However, there are  few places I can't see myself ever traveling to, no matter the opportunity. I've perhaps been brainwashed with too many Annaconda movies to ever venture into the Amazon rain forest.  Like wise, any rain forest or setting that has the massive pythons or varieties of boa constrictors will not be on my travel itinerary. Snakes are welcome to their parts of the world, and I am saddened that species have gone extinct due to over development. I have a healthy respect for nature, and part of that respect is keeping myself away from their space whenever possible.33 Write about a happy day from your childhood. Where are you? With whom? What’s going on? What made this day so memorable?OPTIONAL: Work on your own fiction, without the connection to the topic. Share what you are working on. I'm taking Natalia's suggestion and linking this to my first short story I wrote s part of Write and Link.Katie is the daughter of the protagonist from Laugh Until We Cry.Katie knew the move to Florida was not just for mom's new job.  She new mom was trying to get away, far away, from her dad.  Adults try to keep things from their kids all the time, thinking they are protecting them.  Really all the hushed conversations, the hanging up the phone when a child come into the room, the  watery eyes and excuses to leave the room, these all just make kids feel more anxious.  Kids perceive when something is wrong. Katie's dad would get very angry for no apparent reason. Just a while back, the family was enjoying a wonderful day at the beach.  Katie had seen a friend from school and as happily splashing around in the water, when she heard arguing from where her om and dad were with the cooler and beach towels. Dad left with a man. Katie later overhearing dad had spent the night in jail, and that man was a police officer. Katie knew they were moving to Florida to be away form dad.  Mom said it would be a bright new life.  Katie was only twelve, but she knew leaving her friends and family, and even her dad, was hard for her mom. She put on a sunny face for her mom, playing along with the big adventure talk. . The day after they arrived, mom had planned a trip to a theme park. Katie only knew about  Disney World, so when they walked through the gate at Universal Studios, a whole different set of amusement parks, she started to really think Florida was going to be like this everywhere, one big adventure. She and her mom rode on everything they could, but by far the best was going on the river ride for Jurassic Park.  Mom had read her many dinosaur books as she grew up and she knew the names to all the common and many of the not so common species.She grew up watching the Jurassic Park movies.  Katie saw how happy the ride made her mom.  She held her moms hand as they climbed up the steep incline, past  the raptors, and squeezed tighter as they dropped through the Tyrannosaurus mouth. After they had splashed on the bottom, and made their arrival back at the loading area, Katie looked up at her mom. She hadn't seen her mom this happy in a long time. They rode it again and again. Seeing her mom genuinely happy made Katie believe things were going to be  good.  She would have a life of adventure with her mom. It was the happiest day of her life."},
{"title": "4", "date": "Friday, September 4, 2015", "text": "Prompt 32 is to write about a number that is significant in your life.Maybe it’s your lucky number, or the opposite. Maybe you feel connected to acertain number and see definite patterns in your life (or your character’slife). Here is the Rise and Link  web site. The number 4 is my lucky number.  I just know it is, but I don't have any proof to give as evidence that it is lucky.  I just feel it is. Number four was my favorite basketball player Kyle Macy's number.  He wore it as a Kentucky Wildcat and as a Phoenix Sun.  I never got to wear number four, as in junior and senior high school, the small numbers were also the small uniforms.  While I wasn't heavy, I wasn't tiny, so 4 was off the option list. That bothered me for a long time, so when ever I am able to pick my own number, I always will go for four. I like things in life to be divisible by four, and things seem wonky if they are not.  I often will rationalize how something becomes divisible by four using my own rules, though. For example, I grew up in a family of  ten kids, and two parents, for a family of 12.  Twelve is divisible by 4 of course.  So in my own family, I have three children, and one husband-four others in my family. For this math, I conveniently leave me out of the count. If I truly can't find a divisible, even with modifying my rules, then that wonkiness kicks in.Most of us have been in small groups where the person leading the groups wants yet smaller groups so asks the a larger group to count off.  I feel unglued sometimes if I end up with a three or a five. They just don't work for me.  I can handle even numbers, because if you divide, you still will get equal decimal points, buy with odd numbers, the quotient becomes an irrational number.  That is just wrong. I need my rules to have rationality.If I get a fortune cookie that lists four as one of the lucky numbers, I tend to keep it a few days, tucked in myth wallet, or perhaps even taped on my computer screen for luck. I'm not much of a gambler, but the times I've been to the race track, I have placed bets on the fourth horse.  I have no evidence that four is lucky, but it is a system, my system of four. Rise and Write day 31 is to write about feeling angry. What are the sensations inthe body? What’s happening with the thoughts? Write a scene when your characterfeels angry. Do they want to punch someone? Will they?Hard Lesson The resentment boiled in her head.Nothing could cool the heat building, rising like steamready to escape like a bubbling tea kettle.She said she wouldn't ever get this angry again.Yet, when saw her words, written verbatim,but credited to another, her fists and mouth clenched.Once again her work was stolen,the rewards bypassing her skills.Her talent it appears, is to propel anothers career.\"She will be a mentor,\"she was told when rejected for promotion.\"Learn from her.\"She was learning alright.She had learned that rules  don't apply,to the person at the top. Stealing intellectual property, considered eminent domain.  When asked about the behavior before,was told she would see her just rewards.\"You have knowledge and talent,but I have the power and influence.\"\"Together we can do great things.\" was her bosses canned response.But the great things to one,meant long hours to the other.Great things meantall the authority to one,all the accountability,all the fall out to the other. Not this time. She had reached her end.Next time, she would not be there,to solve the problem, create the solution.\"I have no regrets in informing you,\"her resignation letter began.\"that effective this minute,my mind is my own property again.\"She placed the letter in her bosses hand,and turned silently on her heal.Her bag on her arm, she boldly left the building.Once in her car,she felt the tea pot dull to a simmer.The feeling of vindication,suppressed the fear of unemployment.Anger makes people do the irrational,but she never felt more sane.After all, she had skill and talent,and would find her own power and influence."},
{"title": "This Little Mug of Mine", "date": "Wednesday, September 2, 2015", "text": "Day 30 for Rise and Write. I've been a sleepy crank the last few mornings, so this is  Crash at Day's End and Write. Today I'll be writing about a cup or a mug. I wondered what all the giggles on that Friday had been about in my class of four year olds. Helping my kids shape letters, or manage a tiny button in the doll corner, or leading a group game, all day little tiny hands cupped their mouths giggling.  It was my last day teaching as a single woman.  When I came back ten days later, I wouldn't be Miss any more. It was clear there was some surprise coming.  Before the first of the kids left, my co- teacher rounded up the group, plus the younger kids, all to my classroom.  There, I was presnted a beautiful handmade card with lots of hand prints, and  valiant attempts at writing their names.  Most of my kids had mastered this, only a year out form kindergarten and were so proud.  \"That's not all miss, but you'll have to wait.\"Now the Sunday after the wedding, opening gifts with my new husband, I found out what the other surprise was.  It was a pretty, simple, clay coffee mug, with slightly raised blue flowers on the side, with a bouquet of short flowers in the mug itself. It came with a card, which my husband opened, wondering if it was a joke from his friends.  Of course he didn't yet speak four, not being a parent yet himself, so he couldn't decipher the messages and names my kids had written in the card. When the flowers had wilted, I cleaned the mug out and it became my daily coffee mug at school.  The kids loved seeing me drink from it.\"We gave that to you,\" someone said at lest once a week.That mug came with me when I switched schools.  It became my link to the classroom when I moved from teaching to doing  family education and counseling in an office setting.  It moved with me to my office days when I went on to work in program management.  It survived a move to a new building when most of the other sentimental trinkets did not. In the fall of 2011, I sipped out of it the afternoon before later going to a high school football game.  My son was long out of high school, but it was the 10th anniversary of the year the high school had won the Class 5 A Minnesota State Football tournament.  My nephew had been on the team, along with  half a dozen boys that had been in my preschool class twenty four years earlier. Many of them young fathers now, I could still picture their little faces, including one little boy, who was not there. He had tragically passed away a few years out of high school. I don't remember when exactly, but one day the mug went missing and never turned up again.  Often people had favorite mugs that would be left by mistake in the kitchen, and occasionally an all points bulletin was put out.  I did as well, but to no avail.  I was hoping someone was playing a joke and I would receive a ransom note or something, but no dice. It was gone. I'm sure it fell on the floor, broke, and was swept away.  There was nothing special about it that would make anyone think anything of it. For me, that mug held a lot more than coffee. It held the future of twenty four year olds. I still miss it."},
{"title": "My Hidden Love Affair with Vincent Van Gogh", "date": "Tuesday, September 1, 2015", "text": "http://www.vangoghgallery.com/printsandposters/van-gogh-top-20.htmlDay 29 of Rise and Write. Natalia, our fearless leader, gave a few days off and reiterated that there are no rules to using the prompts-just write! Today, is about writing about sunflowers – in the garden, in the fields, in the bouquet, in the wreath on the door. Write about the flowers or the seeds… I'm going to take her advise and write about sunflowers differently than I suspect others might, and thus I unveil my hidden love affair with Vincent Van Gogh.I could see the great steps, the colossal pillars, the banner that  marked the entrance.  The crowds were thicker than Minnesota mosquito's on an August night the day after a rain.  I took my daughters hand, even though she was thirteen, as much for my own security as hers, and followed my older daughter weaving through the crowd, my husband a step behind. We knew the Sunday before St Patrick's day was the London version of  the celebration, and Trafalgar Square was host to a thousand Irishmen, if only Irish for the day. Still, nothing could have prepared me for the density of people.  My daughter knew her way around a crowd.  Six months in London and she had figured out how to move, sway, and ditch between people, clearing a fine path that filled in behind us as we walked. Up the steps we walked, pausing to get a picture before security shooed us to keep moving and not clog the stairs.  Inside, the museum was nearly as crowded as out. We saw the sign pointing to the Van Gogh, Sunflowers only to learn there was a line queuing deep, down a hall, up a stair case, and then in a line in the more open space between gallery rooms. We decided to wait and go the next day, a week day, when the throngs hopefully would be home or at work nursing hangovers. My disappointment in being so close was visible. We doused the disappointment with a good catch-up with our daughter over fish and chips and beer. Monday was already sketched out to do the London Eye, a Thames cruise, a double decker bus to anywhere, and a Hop on Hop off tour bus trip.  It was fun day, and when we stopped in the Square, we decided to give it one more day before heading to the gallery again as the weather was unusually warm and sunny, as we were told, for a London day in March. Too nice to be in doors, so we continued to view and photograph the architecture and landmarks from the streets. That night after settling into our hotel room, me drinking my second cup of the in room Nespresso coffee, I read a bit more on the exhibit, and the life of Van Gogh.  I really like to build the anticipation before I see an attraction.  I'm the same way with vacation,s reunions, and other special events.  Some people feel researching and planning creates an inevitable let down for when the real event takes place.  I on the other hand feel it heightens the experience. I never could put my finger on why Van Gogh has such a firm spot in my heart.  The colors he used are vibrant, and the texture he captured with the brush fools my mind into thinking I am actually touching the subject matter. Many other artists of his time did that as well, but not in the soul seeing way Van Gogh does for me.  Perhaps it is his story; his lack of fame and appreciation in life, when clearly there was brilliance touches a nerve with me.  Sunflowers in particular is like a blow to the gut. Normally I think a sunflower must be the happiest plant on earth.  I swear I can almost see a smiling face when I've see a single one sprouting from the side of the field. But Van Gogh's sunflowers almost weep.  Yes, they have the same bright, sunny, golden yellow, but seeing them in the vase, almost reaching out to be touched, feels sad and lonely. They make me imagine the artist, reaching out his hands, just wanting to be touched, be affirmed, be valued, be appreciated. Tuesday, I was not to be deterred.  After the mandatory American tourist  viewing of the changing of the guards at Buckingham Palace, which I found damn cool, despite the  length, by the way, we made our way back to the National Portrait Gallery. There was  small line, but after getting our tickets for the cue on the floor below and making our way back upstairs, there was only a couple families ahead of us. My older daughter had classes so was not with us, but the younger one teased me asking if I was going to faint when I saw it,  \"Probably.\" I remember replying. It was our turn.  We walked in.  There were a few other Van Gogh in this room, a few Monet, and at least one Gauguin.  Then I saw it, lit from above and hanging on the central wall. Sunflowers,Vincent Van Gogh. I don't know how long I stood there.  It felt like an hour.  It felt like seconds. I felt the wet tear on my cheek, but I did not care. Let them fall, my brain told my eyes. Seeing that painting was overwhelming. I am sure I could feel every hurt, every ounce of pain he felt with each stroke. Then,  suddenly, I felt peace.  I found  tissue in my back pack, wiped my eyes, and wandered around the room, taking another look at each of the other wonderful painting in this special exhibit room.  Before leaving, I stood one more time in front of the Van Gogh.  \"Thank you. \" I mouthed, and left the room.  My wedding, the birth and graduations of my children. closing on our house; these are all experiences that are deep in my heart, moments in time captured forever. This viewing, is captured there as well."},
{"title": "Laughter", "date": "Friday, August 28, 2015", "text": "Poetry deserves another try with prompt 28 which is to write about a sound. Maybe you woke up from a sound.Maybe it is a sound of music, or an annoying noise. Click  HERE for the rest of the prompts and posts.Laughter fills the airIs there any better sound?Happiness risesI love a good jokeone that makes my belly shaketurns giggles to roarsLaughter of a childshould be my morning wake up my ears filled with smilesOn the worst of dayshearing a good laugh can purgemy ill tempered mind Laugh with me, I saydon't laugh at my quirkinessrather, join your ownLaughter is musicsound of life, hope, happiness,friends, family, peace.Prompt 27 is to write about sand. Imagine touching it with your hands.What does it feel like? Write about a sandcastle you built as a kid or as anadult with your kids. Or about construction sand. Write whatever comes to mind. I'm continuing to build on my character, Kara, from my short story Calm in the Storm, so I guess this is an exert from a not yet written book.  Visit Out of the Writers Closet Rise and Write for other posts and prompts. Sand Castle Tomorrow Kara and her two younger children would start the drive back, taking at least three days, visiting a friend form college on the way.  She wanted to take full advantage of lake today, so had thought ahead  when she got up and prepared salads, sandwiches,  snacks, and all things necessary to picnic water side. They planned a big meal for dinner with steaks and corn for the grill, so this casual fare worked for the teens as well, who much preferred casual take and eat lunches tot he sit down affairs their grandmother liked to host.  Her mother had lunch plans in town with a lake neighbor, and her brother and his wife needed to be back in their home town to settle more business.  Her niece and nephew stayed at the lake to hang with their cousins.  The boys were throwing a football around in the water, the girls sunning on the raft, and Kota lay by her side.  A boat went by very fast and created a pretty strong wake, causing rippling waves to force the water farther onto the beach area than it had been.  The sand soaked in the water, hungry and thirsty.  Kara was reminded of how when she was younger, perhaps about the age of her nephew Jack, and was caring for Jim, then already a boisterous six year old, and she convinced him to just stay and play calmly around her by promising to build a sand castle with him.  Jim had gathered up old cool whip containers buckets, toy shovels, sticks and anything else Kara suggested would be good tools.  She knew if she stretched this out, she could keep him busy at leat an hour, and possibly even tire him out enough that he might let her linger with a book instant of the constant vigil she needed to keep on his every move. Kara remembered how the sand felt, eyes closed thinking about the sand castle building. The sand, hot and cold at the same time, scooping firms mounds into the bucket, then patting the wet grains down firm. There were others over the years, but this one was particularly grand. they had used the large bucket to create a base, and smaller ones to build the castle higher.  She helped Jim create a mote, and then a wall around the moat using cups of sand. strategically placed sticks out of spires of sand were flags.  Jim didn't have any medieval knights but he had army men that he brought down from the cabin.  Not only did Kara get an hour of busy building, Jim played with his guys for  most of the afternoon, pausing only to swim every so often when his body got hot. It had been a good day. The grown Kara needed some action now.  She got off her lunge chair and went over to the waters edge and  plopped down on the wet sand. She didn't have any buckets or old food containers, but she began to sculpt the sand with her hands.  She made little mounds, and then started to try and mold them bigger. When she got hot, she walked into the lake, doused herself, and then leaned over to get handfuls of very wet sand.  She rubbed the sand between her hands, on her shoulders and arms, feet.  The course sand felt refreshing as it  sloughed  a thin layer of peeling skin, remnant from a sun burn the week earlier. one more dunk to get the sand off and back to her building. She fund she had help; Jack had found a bucket and a red solo cup, and was helping to create real sand castle shapes. Kyle, at 16, couldn't resit getting in on it, and brought some sticks over, using a larger one to start digging moat. The girls form their raft looked up to see what was going on. Each waved, but laid back down again. Kara was content. It was a good day."},
{"title": "Trains", "date": "Wednesday, August 26, 2015", "text": "26Write about a train. Did you ever travel by train? If not, what do you think it would feel like? Write about a character who’s traveling by train if you prefer. For all the Rise and Write prompts use the link.What is not to love about a train?  Passenger trains taking families cross country to visit relatives, complete with dining cars for snacking are my favorites.You can stretch your legs going from car to car, an exhilarating feeling.  Commuter trains taking suburban city workers from their  bedroom communities into the crowded city, and back home again. I picture men in business suits with a newspaper under their arm, and women sporting up do's with their hair and high heels, straight out of Mad Men. The subways and light rail trains are a wonder to me. I wrote a post about them on my other blog These were my mode of transportation when I used to travel to Washington DC for work on a regular basis and how we got around, and never lost, on a London vacation.  We now have light rail in my community, though it isn't expansive enough to work for my needs. Though inconvenient when you get stopped at a crossing, the cargo trains, moving freight from each end of a train track, brings out the kid in me.  I can't help but find myself counting the cars.  As children, and with my own, we would try and guess how long the train would be. On highways that run parallel to a train track, I  still like \"racing\" a train in my car.Besides the work trips however, trains have not been a regular part of my travel experience. Perhaps this is part of my appreciation. I might get tired of all the stops if I was taking a light rail daily to work, or had to travel for days to reach my destination as opposed to hours by plane. I'm drawn to train's in movies and books. The movie and television shows that are inspired by the book  Murder on the Orient Express, regardless of how camp they are, become a must see.  Did anyone see the Doctor Who, episode  with the mummy on the space age train?  Yeah, I loved that one. A favorite book, The Train Home, by Susan Shreve, has been read at least 1/2 dozen times, and on a train in fact. I intentionally packed it for a business trip as it seemed fitting. Then there are the action adventure movies with the chase scenes on top of the train, always a train tunnel involved. Ridiculous, yes, but fun to watch, I can't not mention one of my favorite movies, The Station Agent, and learning about \"walking the rails\". Now that I have trains on the brain, driving to work in my Chevy Malibu is going to be a let down this morning."},
{"title": "Feast", "date": "Tuesday, August 25, 2015", "text": "25 Write about a feast – a family gathering, a company banquet, or maybe you treated yourself after fasting. Now here is a prompt for me! I will  give this one a true  stop watch and write for no more than 10 minutes and see where I end up. Christmas dinner in my extended family moved from the big sit down turkey dinner on Christmas Eve to a buffet of organized potluck.  We had  sort of sketched out menu- a few meats, some sides,  appetizers, but nothing was written in stone, and we switched up year to year.  This  was started about twenty five years ago, when the last of my parents children, my younger sister, got married and moved out of the house.  It was just so much easier on my mother, since she lost her last set of extra hands to help.  There was never a shortage of food before, but this newer buffet way of serving was gluttony at its finest. Not only did each  extended family household bring the equivalent amount to feed their whole family, usually the amount was doubled. We typically had twice as much food as people to eat.  No worries, Christmas buffet makes for great leftovers and \"pickings\" when you have kids from school the rest of the break.A few new family favorites have emerged and are part of the tradition, as the buffet has now become. My sister makes an incredible beer cheese soup, complete with popcorn to crunch on top. My brother in law is the chicken wing king and usually has several varieties. I am the maker of \"puffy things\"  little  popovers made with crescent dough and filled with cheese and herbs.  These were my dad's favorite appetizer and  no matter how many I make this is the appetizer that gets downed in full. As we have moved away from presents as each of us has our own exchanges in our immediate families, the lingering over the buffet, the chatting, the  communal coming together, is he heart of our Christmas now.  It is special in terms of using nice dishes, ad crystal serving pieces, but casual enough that extra guests blend into the fold easily. My sister hosts now and she ever gets a true head count. If we need  more dishes, a couple of us just quickly hand wash, as it takes a while for fifty plus people to go through so that first groups through the buffet are usually done eating before the last have come.  Besides, we will all graze and nibble throughout th evening. The Christmas Eve buffets are truly a feast.Link to Rise and Write is HERE.24  Write about pain – either physical or emotional. Or write about how it feels to live without pain. For all the Rise and Link visit the page.Pain is on my mind-too much in fact.  Each morning as I coax my muscles back to work, Each shift of my knee, the movements of my wrists, and the sharp, stabbing feeling in my lower back are the physical pain that will be with me for life, managed better some days than others.  To me it is getting dull, and while have mentioned it here, I don;t want to consume my prompt with it. I will explore the emotional  interpretation of pain, and try again as a poem.  Thank you for the feedback Justin and Natalia.News arrived todaythe letter in the mailboxsealed life without youNo phone call would doyour letter started to sayto share your new lifeYou would not be back-new life over the ocean-you could not come backYou said, \"This is home.I've found my place in the sun.My life will be here.\"\"I know we had plans,of love and home and children.That image scares me.\"I am still to young.Time is now to laugh and learnmy true place on earth.\"\"I'll love you always.Keep holding my heart in your heart.As I do as well.\"You are my first love,but we both need to see more.experience more.\"Tear drops smeared the print.The letter closed with these words,\"Come visit sometime.\"She would not visit.Her heart holding his was breakingpain spreading through veins.He left her aloneto sweep their life plans to trash.Her life was over.Soft arms around her,a gentle hand soothing hair,her moms love was there.\" I know you're hurting,the pain you're feeling is real.\"her mother told her.\"Let the pain fill you.sometimes you need to be full,then pour out, start new.\"Mom had a first love,she still holds his heart in hers,but found a new life.A life with her childwho she now held so closely,a life with such love.She hurt for her child,though knew it would fade in time,if not go away.Pain is part of love.But life is like a garden.More love can be grown."},
{"title": "Head of Hair", "date": "Sunday, August 23, 2015", "text": "The 23rd prompt is to write about hair, mine, or my characters. For all the Rise and Write prompts and to read other sketches, link HERE.As a very young child, my hair was very blond.  It gradually darkened to what was commonly referred to as dishwater blond.  I couldn't imagine  a less attractive word to describe a hair color.  My son and second daughter followed my pattern, but daughter number one got her fathers rich dark brown coloring, though with a tiny touch of auburn.  It is of a color that hairstylists have been trying to master since hair dying became popular.What my hair lacked in color appeal was made up for with strength and fast growth.  As a teen, I never worried too much about a bad hair cut as it would grow out in short order.  In each of my pregnancies, with addition of prenatal vitamins and hormonal changes, my hair grew even faster.  I never grew my hair out long until after my first daughter was born.  then I grew it so long that when I had it cut in nice little cropped bob, I donated 15 inches of hair to Locks of Love, to be used for making wigs for cancer patients. I have done that extreme growth three times in all, for donation.  It seemed there should be some purpose in growing long hair beyond my own vanity.My hair still grows fast, but last year, a month before my 30th high school class reunion, I started noticing the gray I was starting to sport no longer just looked like a blond highlight.  My hair was not graying elegantly, but rather coarse and unmanageably. I began to color my hair.  I thought I was selecting a color that was very natural, back to my original hair color.  I did though go just a smidge lighter, and between that smidge, and having my entire head one color, called champagne, my hair had a shine and prettiness to it that I couldn't remember since childhood. Locks of Love needs pure hair-no dies or chemicals, so my donating days are done.My friend, who's hair started graying in her 30\"s, has lovely long gray locks.  She twirls them around her head, throws them back in a rugged pony tail, and sometimes just throws a head band on and lets them hang long.  She and her hair are beautiful.  She has had more to face than most people I know, having lived most of her married life with a cloud of stress from her husband, living with a brain tumor, and nearly two decades of surgeries, and waiting, until last fall, the waiting was done.  As a mom now raising the teen daughter still at home alone, she has always had more to think about than the right shade of hair color or right style, and let her head select on its own behalf.I want women, and men for that matter, to feel confident and happy with themselves.  I appreciate that some want and can pull off natural.  I just wasn't feeling it myself.  I didn't feel like me as I was going gray.  I may feel differently in a year or five or ten, but for now, the champagne bottle will be used 1/2 dozen times a year."},
{"title": "Let it Rain", "date": "Saturday, August 22, 2015", "text": "On to week four of Out of the Writers Closet Rise and Link.  Today is to write about rain. I love a good rain, and we are slated for one later this afternoon-evening.Natalia suggests we think about whether it is a warm summer rain or a heavy downpour, and whether or not I or perhaps a character are looking at it from inside. I am going to break out of my comfort zone and give poetry a whirl with this one. Rain hits my face hard,blurring my vision to seethe wondrous new growth.Drops roll from my cheek.Glasses are an impairmentto see the fresh green.Puddles fill my shoeswith the icy cold water,but my heart is warmApril showers fall.I walk when others will run.I drink up the rain.All snow has melted.The dirty remains washed clear,Spring has now arrived.Let the rain fall down.It does its April job well,preparing for MayRain hits my face hard.My toes are curling from cold.Yet, I walk and think.Nature has rhythm.Patterns no need to question.Let the rain soak in."},
{"title": "So Hot!", "date": "Friday, August 21, 2015", "text": "Day 21 is to write about feeling hot – your sensations, thoughts,desires. For this one, I'll  stay to the sketch element, so am planning on only writing for 15 minutes, and see where I land for a post. It is hard to believe that after this post I will have done 21 Rise and Writes.  Not all were done religiously each morning, and not all at the moment of first rising, but most have and I am finding the process to be challenging and rewarding.  I need to go back now and do a fair amount of editing, but that might be for another day.  To read more, visit Natalia's Out of the Writers Closet Rise and Write. So Hot! \"It's not he heat, it's the humidity.\"  How many times did I hear that growing up by my mother.  She hated to be hot. She thought you could always put on another sweater, but you couldn't decently take off enough to ever be cool when the hot stickiness set in. I am fortunate in that unless the humidity goes on for days and days, I am not overly bothered by it.  I like the feeling of being very warm, and resist turning on the air conditioner in my car  and home. It is a battle with me and my husband, who hates the heat.  If it could be no warmer than 75, he would be happy.  To me there is nothing like the sensation of being so hot and then having the cooling effect of water.  Whether that water impact is a jump in the lake or pool, a cooling shower, or even being spritzed by a water bottle, it is instant pleasure and gratification.  Lately though, and apologies in advance to male readers for any lack of resonance, the onset of years has made my internal thermostat go haywire. I can have chills on the hottest of days, and when others are cool, I can feel like my body is on fire. There is no relief for this kind of heat; the heat that comes from inside, and not from the sun. Perhaps it is \"just rewards\" for having benefited for decades with a heat tolerance that exceeds most. I find ice water is my friend, the colder the better.  The two luxuries we have at my office are an ice maker that kicks out an endless supply of clean cubes, and a filtered water cooler.  I drink no less than three 20 ounce bottles of water a day. Perhaps there is some master plan in my psyche doing this to force me to drink more water, and consume less caffeine? As I write this, I am sitting in a Caribou Coffee, sipping the light roast of the day.  Yes, coffee and not ice water. It is overly air conditioned, but I can see the sun outside. Today is supposed to be 75 and full of sun and low humidity.  My daughter is running with her cross country team and will meet me here when she is done. I am not a runner, but she was excited for perfect running conditions.  It is my flex day off, and I was hoping for heat.  The natural kind that only the bright sun of summer can satisfy. Day 20 and here is my task for the Rise and Write daily prompt.  I am a day late and will be doing two today and getting caught up. I'm going to try another fiction take, building on my last short story. Here is the prompt: Write about a summer day – a particular one or afictional one. Where are you (or where is your character)? What’s the weatheris like? What are you doing or wanting to do? Are there people around you, or are you alone? Write about your thoughts and feelings on that summer day.Kara and her family had another week left to spend at her mother's cabin in Minnesota.  Actually Paul, her husband ,and Brent her son would be leaving in three days to prepare for college.  Paul had a new crew of teaching assistants and PhD candidates to acclimate, and Brent would be starting his senior year on the other side of the state.  He had friends he still wanted to see, so he and Paul would be flying home, where Kara would take her time, stopping at a different friend's home on the way back. As was normal, Kara was up early, with first light, not wanting to miss a moment of the solitude the early morning lake brings before the boats and motor toys come out.  This particular morning was an incredibly glorious gift.  At 6:30, it was already warm, and she knew the day would get steamy.  Later she would find a spot in the shade, surround herself with a magazine or two, the Susan Shreve book she was reading, and a small cooler that held provisions to refuel her ice tea cravings.  Now, she through on her swim suit under a pair of khaki cargo shorts, a tank top and a baseball cap, grabbed an apple for herself and a couple doggie treats for Kota, and headed to the canoe rack.  Kota, their eight year old German Shepherd, was not fond of swimming particularly, but he loved riding along in the canoe.  He would settle in for the first ten minutes of paddling, but as he acclimated his water legs, he would shift to the front of the canoe, and assume the positron of crew leader, while Kara paddled sleekly and elegantly, gilding the  small canoe through the water. At the far end of the small lake, out of view form her mother's cabin and in a spot where the incline up to the main road was too steep for cabins on the shoreline, she paused to eat her apple, and enjoy the wooded view.  Kota sat don again, expecting his first treat.  He wouldn't get the other until they were back home. There, Kara's mind pondered the events of the last 10 days.  They had packed the jeep with stuff for five people, and a dog, and made an ambitious two day drive, stopping midway at a camp site in Indiana where they met friends for one night, before finishing the trip and arriving late.  most slept in the next morning, but not Kara.  She allowed herself naps in the summer as the nights around the fire got late, and she wasn't going to sleep away the morning solitude. Since learning her brother and his family were going to be moving into the cabin. at least for the short term, while he attempted to get his finances in order, she wondered if coming home to the cabin would remain the same.  It sounded like her brother was not only starting from scratch repairing the damage he caused his own finances with his failed business deal, but he had potentially jeopardized his mother's financial security, since their father had invested heavily before he passed away in the venture. She would probably really know very little; her mother never confided in her in such things, having put Kara in a lifelong box of being a child.No, it was Jim her mother had turned to to help sort all the financial details after her father died while  Kara was to play hostess and personal secretary for the social side of her mothers life. Kara was one to have multiple plans and solutions going on in her head at all times.  While the family she grew up in thought of her as simple, unambitious, and not worldly, her own family, and Paul's saw her as the problem solver. It was part of her calm demeanor to never fall apart in the the face of adversity, real or potential, but to visualize scenarios and actions and outcomes. She knew she would have several  options developed by the end of her canoe ride should the bottom fall out for her mother, if anyone would care to ask her. Kara looked at the wooded area above the lake, seeing the first hints of fall color, even though it was only early August. As much as she loved the fall colors of her family lake home and her home in New England, she wasn't ready for fall yet. She let the rising sun heat up her face, her legs, and her arms.  She soaked it all in. She started her paddling again, seeing the  lake community slowly coming awake as she paddled by each cabin.  There were a few fishing boats out, still and silent, their masters lazily holding rods draped over the sides of the boat. She said a silent prayer that all would work out for her brother and his family, and more so that this feeling of peace and serenity would last."},
{"title": "Not My House", "date": "Wednesday, August 19, 2015", "text": "19Write about a disappointment. Were you the one whofelt it, or someone you cared about was disappointed? How did it make you feel?Haven't we all had many disappointments in our life?  Promotions or jobs passed over or maybe missing out on a special event because of illness,  are part of life. One disappointment though I think about from time to time is our failed bid on my then dream home.  We were late to get an offer in, and another families was accepted just moments before the seller saw ours.I sometimes imagine that we would still be living there, twenty eight years later, though more than likely after three kids it would have been thought to be too small.  It was a small dutch colonial, barn looking house with  built in cabinets int he dining room, old plumbing, and creeky stairs.  It was cute and charming and no doubt would have been a money pit.  It was also a house I had imagined living in, raising my children, with a dog curled up by the fire place.  It had a single bathroom upstairs, and an old kitchen, ready to have paint and  cute curtains. The whole house was hard wood, as house built at the turn of the 20th century were.  It was in our price range, and I would have spent the summer before we got married making it our own.   We ended up buying another quaint, even tinier house.  It too was old and a fixer upper, and provided a an affordable, if not cramped space to live for three years.  We sold it for a tidy profit, which allowed us to buy the house we are still in today.  While it was cute, it did not have the custom features of my dutch colonial.  I didn't feel too nostalgic moving on.  it was a house.  It was a good house, and we made it our home for those brief years, but I didn't have a heart longing affinity for it as I would have with the one we lost. Years later the Dutch Colonial was featured in the little local paper in a segment, \"I've always wondered about...\".  Here the couple that had won the bid before ours was interviewed, showing all their efforts in maintaining the home, and keeping it true to it's origins.  I was happy to learn that the house found owners that lived it and cared for it as I imagined I would have. I still think,if they ever sold it, I would take another look.  the house would be impractical now.  I sometimes drive by it, as it is near a friend of my daughters house.  I smile and say hello, and silently wish the owners well. Rise and Write link up holds all the prompts and other writers creations."},
{"title": "What a Couple Trees", "date": "Tuesday, August 18, 2015", "text": "18Write about a pine tree – any pine tree, a real one which grows in your yard or in the woods where you go for a walk, or a pine tree you saw on your vacation, or a pine tree painted by an artist. What it looks like, smells like, how does it feel to touch? Where to start wit this prompt!  Visit the rest of the Rise and Write link ups here. This was a true prompt-11 minutes. We have four pine trees in our back yard.  For a brief time there were six, quickly dwindled to five due to the one unhealthy spot in the yard.  Two summers ago, number five dried up and died and now is waiting it's fate in logs under the deck with the river birch we lost a few years ago.  Little by little, log by log, the trees will be part of weekend fire and lazy relaxing around the fire pit. Two of the four left were purchased with the other two that died, part of our first summer landscaping.  The were all about 6 feet tall when they went in the ground, but without girth.  The last two though were bought on a whim. Two little pines in pots, smaller than our then three year old, and about the size of the one year old.We found these and bought one for each kid at a Menards store, not a garden store. Humble beginnings, but have these two ever grown and thrived.  They are fuller and taller than the remaining two landscape trees, reaching more than a dozen feet to the sky.  I love these trees.  For a few years, I tried to get pictures with my squirming and growing kids, but being a poor photographer, I couldn't find anything decent to try and scan for this post.  Perhaps when I go back and edit, i'll find something suitable.  As the trees have grown, they've morphed into creating a hideaway, a barrier between the neighbors and the park.  This was a perfect spot for my now blown away and smashed up chaise lounge chairs.  I am on the hunt for more.  They leave me gifts of pine cones to put in bowls each Christmas, and block out the too bright morning sun when I am trying to have my Saturday morning coffee on the deck. Some day, another family will live in our house, and our now haphazard tree assortment of trees will be cut down and cleared for a more cultivated landscaping.  I won't worry about that now.  It will be a few years before we move on, so until then, I'll continue to think of these two trees in association with my two oldest children. May my children reach the heights that their conifer siblings have."},
{"title": "Money...", "date": "Monday, August 17, 2015", "text": "Write about the first money you earned. Was it for a chore you did for your family, or you got a job outside of home? Was it for something you enjoyed doing? Remember the moment when you held money (or a check) in your hands for the first time. How did it make you feel? It is day 17 of Rise and Write, though for me, it is crash on the couch after a head spinning day and write.  Click HERE for the Link Up.Once I had my first \"gig\", it seems I had an endless supply of them for the next five years.  I'm talking about my babysitting jobs. First, for family, watching nieces and nephews, for long nights and very little pay, less than the going rate would have been had they hired non family. In those days $1.00 an hour was pretty typical, but often, more for families that had more kids, or required you to feed the kids. Not in my faily, and a few conveniently nver seemed ot have cash when they got home, so would pay me next time. I picked up jobs for neighbor families, and took jobs passed on by my friends who had to turn down for either another scheduled job, or a family commitment. Those were usually the best paying jobs because I was helping out in a pinch. For family though, and I am ashamed to admit it, I did not like to babysit in my junior high years, even though I  did so much of it. I found the kids annoying, and the parents, my siblings, even ore so,  regularly switching up the rules on me. I had multiple plans cancelled because without prior notice, the end time changed by several hours. I started to resent both parents and kids as I felt like I didn't even get a say in babysitting for family members. It was just assumed that if one of them needed a baby sitter, their life was more important than mine, so I was expected to buck it up and say yes.  I had multiple Saturdays, intending to enjoy a quiet day, when suddenly, the kids would be dropped off, and I was now expected to watch them.  It was always unpaid when at my mom and dads. In families, we often feel under appreciated as I often did, and was passive aggressive about it, never speaking my mind. It showed when I was with the kids instead. I had been the babysitter the kids didn't want, but were stuck with, their misbehavior a response. As I moved into high school, I matured in my own human development besides age. Looking back, there was a lot of mental health  and destructive issues circling my extended family. As an adolescent, I was too young and immature to understand, and only could see how I thought I was being dumped on. Then slowly, over time, as I was getting out of the awkward, cranky, antagonistic early teen years, I started to appreciate the little beings as something more than mess makers.  A few hard situations in my family where I became the comforting aunt, helped me see the caring and compassion I really had for kids. While babysitting was my first money earned, I never made the big bucks a couple of my friends made with their regular clients.  In hind sight, though, I and my nieces and nephews, many who later baby sat for me, earned our battle scars being stuck with each other."},
{"title": "School Friend", "date": "Sunday, August 16, 2015", "text": "Good morning Day 15 of the Rise and Write series of prompts, impromptus, and sketches based on a common theme.  This morning I am going third person again, my tool I use when an event or a story is based on real events or people, but morphed with creative license and varied details, plus a bit of anonymity by using fictitious names. Today's prompt, write about a friend from your school years, fits this way of writing well.  She and her former classmates were near religious in following the reunion cycle of every 5 years.  Up until the twentieth, the reunion had been planned by the three class officers and anyone they could get to help.  With the adage of Facebook and other social media, by the time the 25th and 30th reunions was being planned, fatigue had set in by those three, and planning became an open invitation for anyone who wanted to help.  The reunion events were casual from that point on, and besides the every 5 year one, impromptu gatherings became the norm. This is how Lisa reconnected with a former friend from elementary school.  Thirty-nine and a half years earlier, Debbie and her family moved to town.  When you grow up in a small town with generations of families, having fresh faces is a big deal.  At first, everyone wanted to be the new girls friend. Then over time, as 3rd grade friendships were solidified, the glamour wore off, and Debbie melded into normal. But not to Lisa.  To Lisa, she thought Debbie was unique to all the other friends she had. Lisa and her friends were the quiet, background kids, who spent more effort trying to stay out of attentions way than trying to stand out.  They did their own things, and let the vibrant, pretty children capture the teachers attention. In these days, organized sports for girls younger than 12 were rare.  Phy Ed was the only form of sports for girls, until finally there was an after school option for 5th and 6th grade girls. In athletics, Lisa naturally stood out from most girls. Until Debbie came along. Debbie came from a family of athletes.  All were tall and muscular for their ages, and lived and breathed sports. Where in Lisa's family they might play a game of PIG or HORSE outside on the hoop hanging on the garage, at Debbie's house they had three on three games, with no mercy on Debbie or her younger brother. They went for family runs and had weights and sit up benches that were actually used in their basement. Elementary  years closed out with Track and Field Day, Debbie winning first place ribbons in just about all her events, Lisa with a small collection of second and third place finishes.  In the mile, a track event that Lisa normally finished first, even after Debbie was in the school,  Lisa felt a sharp pain going into the last lap. She knew she was slowing down, but her body just wouldn't let her go faster as the pain increased. Debbie, as well as two other girls passed her by and she didn't even get a ribbon in the event. Lisa was crying huge wet tears by the time she completed the race.  Her ankle was in real pain.  Debbie was the first one over to her. \"What happened?  Are you OK.\" she asked her.  Debbie waved a couple teachers over to show them Lisa's ankle.  It was discolored and swollen. Lisa''s parents were called, and she was taken to the doctor.It turned out that not only had Lisa sprained her ankle, there was also a small fracture in the bone. She returned for the last two days before summer vacation, in a walking cast, using crutches the first day as the plaster hadn't fully set. She would be spending the first half of summer in that cast. As the kids were finishing packing up the class room, cleaning book shelves, stacking books on carts, and cleaning their desks as was the last day of school ritual, Debbie came over to Lisa with something in her hand.  It was the 1st place mile ribbon.  \"You should have won.  This is really yours.\" Debbie was competitive, but more so, kind. The two stayed friendly in middle school and high school, but had different circles.  Debbie continued to grow in her athleticism, while Lisa had peaked at 12, never more than a bench player. Debbie was featured periodically in the local paper for her college sports successes. Lisa went to college, married young, and started a family, exposing her children to a variety of sports and opportunities.  At each of the reunions since graduation, Lisa and Debbie found a few moments for a catch-up. Debbie too became a wife and mother, with her daughter taking after her in athleticism, but her son, a different path. Not surprisingly, Debbie's career took her in the sports medicine direction, so fitting after she rushed to her friends aid when they were 12."},
{"title": "Road Trip and Thunderstorms", "date": "Saturday, August 15, 2015", "text": "15 and Week number three of Rise and Write.  Pop over to visit Natalia at Out of the Writers Closet to learn more.  The prompt for today is to write about a thunderstorm.The Midwest hosts regular thunderstorms each summer, leaving n shortage of events to think about.  I love a good loud rolling thunder and a cracking of lightning in the sky. I am fortunate that none of my children were frightened by them, just the opposite.  On the severe ones that trigger the sirens going off, each would like to still , if we would have let them, stand by the back double windowed door and watch the show in all its majesty. Driving in a thunderstorms is another matter. The most memorable experience was in the summer of 2002.  We had all been at my nephews graduation party for the day, but were set to leave early the next morning for a 11 hour road trip to Branson, Missouri for vacation.  DH and the older kids went home earlier to do a final packing, and preload the car.  The plan was to be on the road by 5:00.  I was staying longer to help my sister clean up, and keep DD#2, then an 18 month old toddler, out of his way.  Before the party ended, the first of what was going to be a series of storms came through. By the time I was about to go home, there were already several streets  impassable due to flash flooding.  The storms continued, giving  DH little sleep.  finally about 2:00, and a break in the storms, he decided it would behoove us to just get on the road.  He was wide awake and figured the kids would sleep more and after driving 3-4 hours, we could stop for breakfast and a stretch, and he could get a 30 minute nap.  We weren't prepared for the storm to follow our route south.  Within an hour outside of town, the rains picked up again.  They continued to be heavier with each mile until eventually it was so hard by the time we reached the Iowa border, he couldn't see and we were forced to pull over. It was still very early morning and no hint of sun, making vision even poorer.  The kids slept on, the little one in her car seat, and the older two locked in with seat belts, but each stretching out as best they could making makeshift beds with their pillows and blankets. We just sat on the side of the highway, along with all the other cars, waiting until it seemed like conditions were improved. After 30 minutes or so, the rain was slowing down, sight improved, and DH gently coaxed the van back on the road.  once more we had to pull over, and a second time, we were rerouted off the highway via an exit ramp, and back onto it via he entrance ramp. Apparently the section of highway in between had standing water so deep, cars were getting stalled. Slowly the rain stopped and by the time the sun was coming up, the storm seemed to be winding down.   The kids groggily woke up, asking when we were stopping for food. We stopped at probably a fast food place off the highway where I took the kids in to eat.  DH stayed in the van and slept hard. It was sunshine and blue sky's for the remainder of our trip."},
{"title": "Wake and Think", "date": "Friday, August 14, 2015", "text": "We are at day 14 of the Rise and Write challenge.  I don't know if ore are in store, but I have enjoyed the process.  Here is the final prompt of week two. What was the first thing you thought about this morning? Did you think about your dream and wondered what it meant? Did you think about the list of things you have to do today? Did you think of breakfast? Of a work situation? Of your parents, partner, your child or your pet? Was it a creative idea you want to work on? Was it an unusual thought, or something you typically think in the morning?I went to bed last night, in a drunken state, not from alcohol, but of trying to watch a couple episodes of a Neflix drama. I fell asleep 15 minutes into the first episode and woke up with about 10 minutes left in the second.  A woman was being chased through the streets of London until she made it to the underground, and managed to get on a train before her pursuer made it to the platform. Now I'll need to back track and watch both.  I slept rough last night. I hate falling asleep watching shows. The screen images blurry with my own thoughts, and I get very odd dreams. I woke still thinking about the odd dream I had. I wasn't being chased in my dream,  but I recall there was a heated conversation, and it was with the man that was chasing the women in the program, or at least with similar looks.  I just kept repeating, \"No, we have to get there.  We have to get there tonight.\" He had hold of my sleeve and was holding tight as I was trying to pull away. In most of my dreams, I'm always how I remember looking at age 20.  Even dreams that have my kids surfacing in, I am 20.  What is my brain trying to tell me there? Dreams fascinate me.  How the images and and words that seem so real, yet often have nothing to do with anything you can connect to reality, form in the subconscious is both exciting and a bit scary  I am a pretty devout Christian, believing in God, Jesus, the resurrection,and heaven and hell.  Still, I am open to thinking there could be even more to life and the after life than what previous Christians of old chose to capture in the bible and what theologians teach and preach about today.  Are lives recycled and reincarnated, and what we get in dreams is bits and pieces of our own life? Are these images of future life to come? Here is a weird thought I have sometimes when I first wake up after a particularly  intense dream. Are the dreams real, and is my day to day existence the dream?  I have actually pinched myself in the morning to assure myself I am awake and not dreaming any longer. I'll think off and on today in little blips of day dreaming, about this dream, trying to decipher some meaning. By the time I go to ed, all image of it will be gone though, my brain prepped for new visuals. My dream from last night was my first thought this morning.  I didn't think long as I needed to push my body up and out from under the sheets and get both  day 13 and 14 Rise and Write prompts completed. Yesterday was a rare sleep in, and I didn't get out of bed until after 6:00.  I didn't even take time for my morning \"think\", the usual first task of the day.  This will have to suffice.13Write about your favorite book as a child. Do you remember the title, the writer’s or the illustrator’s name? Were you reading it by yourself, or was an adult reading it to you? Have you ever re-read it as an adult, maybe to your child, or just for yourself? What was the most memorable episode or character? Did it make you do anything new – maybe to become more adventurous, or change your name and identity, or learn how to read, or write and illustrate a book yourself? The Rise and Write details are here. With letting myself sleep late yesterday, I am doing two this morning.  I clocked this oe at 16 minutes.  feedback welcome.The pages were already smudged, and the cover tatty when I placed my copy of E.B. Whites Charlotte's Web on the new book shelf in my new bedroom. I don't remember exactly when the book first became mine, but it was before I could read.  In elementary school, each month was the opportunity to purchase books through Scholastic book orders.  I didn't get to order every month, but birthday money, odd change found, and occasional money from my mom and dad, would allow a book or two from the $1.00 section.  This is how I  owned my beloved  book.  I remember one of my older sisters reading it out loud to me and my younger sister.  There were a few pen and ink illustrations strewn throughout the book to help develop the image of Fern, Wilbur, Charlotte and the rat in my head, but they weren't needed.  I could see it all.  I could smell the barn yard and smell the county fair. The summer before I turned 13, about the age Fern was in the book, my family moved into a new house, on the same property.  The 13o year old farmhouse was deemed in too rough a shape to try and update the wiring, heating, and foundation. It was to be demolished. The new house was a plain split entry, two bedrooms up, two bedrooms down, practical house.  My younger sister and I still shared a room, and being in the lower half, a natural shelf where the brick foundation  was built, surrounded the outside walls,   This shelf was perfect for books, and I continued to fill my section. Nine years later when I packed up those books to move into my first house after getting married, Charlotte and Wilbur came with me as well. I remember reading the book when I was on bed rest, pregnant with my first child, needing to hold the pages carefully as they were coming loose from the glue binding. The book came to our current house, and was read to my two older children until eventually, it just completely fell apart. Each of the kids have brought home library copies.  We watched the movie as a family, much like I did as a child, but I've never purchased another copy of the book.  I would have if the kids had ever requested, but I didn't feel a need for another version.  In writing this I am feeling a mourning for the book.  I mourn that old farmhouse with the creeky floors and outdated minimalistic plumbing.  I mourn my childhood, and more so my children's childhood. I mourn those last minutes of Charlotte's life, and remember my version of Wilbur's sadness in my mind.  But I mourn for just a moment.  It is morning, and it looks to be a glorious day ahead. So, in the immortal word of my favorite book, I greet you reader, \"Salutations.\""},
{"title": "Door Knobs not Head Knobs", "date": "Wednesday, August 12, 2015", "text": "12Today's prompt is to write about a door knob. Any door knob – maybe it’s in your room, maybe in a fancy concert hall, or in an antique shop. Is it made of glass, metal, ceramic? What color is it? Is it attached to a door that you are afraid to open, curious to open, eager to open, or are you indifferent? If you never paid any attention to door knobs, write about how stupid it is to even think of door knobs. If nothing comes to mind, invent! The other prompts and other writers tales of the door knob can be found at the Rise and Write page.I am smiling to myself as I type this, because writing about my door knob or plain door challenge popped into my head even before reading today's prompt.  Here is a typical morning, including this morning.  When I wake up, it is often quite dark in my bedroom.  After my morning stretches and little morning \"think\", I less than graciously stumble to the door.  Here is where it gets tricky.  I like to sleep with the door shut, but not shut tight. My assumption, even though both my husband and dog may come in after me, leaving the door open, I still expect it to be closed in the morning. I walk precariously with my hand out in front of me, trying to find the door knob.  If I don't do this, I am apt to find that the door is 3/4 opens, and I will run head first into the door, as it swings open to my side of the bed. We also struggle with persistently loose and jiggling door knobs in our house. I often feel like I should carry my short little chubby phillips head screw driver with me, room to room, screwing the door knob frame back into place, as a regular accessory. Are we harder on door knobs than other families?  Do normal people do a regular door knob rotation of tightening the screws so they never experience the loose jiggling handle? Our house being of a late 1980's style, has very generic oak doors and brass door knobs.  I would love to have doors with more pizazz and maybe porcelain or the diamond-glass looking knobs.  They wouldn't fit the house though. I picture those in my centuries old London flat of the future, an homage to a scene from a Dickens book.  Until such time, I'll still take my awkward steps each morning, looking for door knob while not putting a knob on my forehead."},
{"title": "Swimming Pool", "date": "Tuesday, August 11, 2015", "text": "11Write about your first experience of swimming. How old were you? Was it in a swimming pool with an instructor, or someone kicked you and you fell into a lake?  Were you with your friends, your parents or by yourself? Did you learn how to swim eventually? Do you love it, hate it, or are you indifferent to it? Visit  Rise and Write for more daily writing prompts,I don't remember not swimming.  My earliest memories were of going with my mom, or an older sister to the splash pool next to the large pool in my home town.  This splash pool had two square water fountains that turned on in the morning when the pool opened and shut down when the big pool closed. The enclosed  splash pool was staggered so the center between the two spraying fountains perhaps got about 18 inches deep, and gradually less depth as you moved away towards the outside up to the dry side walk that lined the pool. Here is where the babies, the toddlers, and the young preschoolers played. Here is where I also walked on hot summer mornings with my son the first two summers of his life when our first house was only four blocks away. As we got older, we graduated to the big pool.  Each summer we would each get a season pass.  The pass was not the credit card variety if today, but a cloth patch that was sewed on your swimsuit.  This pass meant any summer day we had a ride into town, or were ambitious enough to bike the 5 miles in and then back home again, we could be at the the pool. I don't remember taking any formal swim lessons, but oddly, can't recall ever not knowing how to swim, except for the splash pool days.  My mother was terribly afraid of the water, so it was not her that taught us. My dad would have either been working long hours in construction, on the road  putting shoes on horses around the state, or working in the barns, large garden or fruit trees, so was not the teacher either.  It must have been one or more of my older siblings and their friends that helped me and my sisters learn. I don't know who taught them.Throughout elementary and junior high, I loved that pool. My friends, sisters, and I would try and get there early and seek out a spot not too close, but easy to see the locker room entrance to the pool that let us see who was coming, and easy view to see the diving boards so as not to miss the really good divers.  There were two diving boards at the far end of the pool and the life guards one by one would let kids climb up and dive, or more often cannonball into the water.  There was always a few non or minimal ability swimmers that were goaded into jumping off, knees shaking the whole time.  I fortunately never witnessed anything tragic, but on many occasions I recall a life guard jumping in to help the struggling novice to the ladder. We played games of Teddy Bear, Teddy Bear, Who turned out the lights?, and Marco Polo.  We dove for coins or sticks.  These were real sticks, not the made for pool diving sticks used today.I loved that pool, and then, overnight, I didn't. I don't know if it was the summer before high school, or the summer even before that when I stopped going.  It suddenly felt juvenile and like the pool was over run with either  idiot little boys, giggling little girls, and  yelling and bossing parents with their kids. We moved to the beach, the strip of sand on the St Croix that separated Minnesota and Wisconsin. With my family, once we moved from walking distance, I didn't take my kids to the splash pool much.  We always had a back yard set up that I could fill or add to each morning, gently warming up for use later in the day. My kids had formal lessons at the high school pool, and we swam weekends at the lake. Eventually the community pool, leaking hundreds of gallons of water a day, was removed, and a new 0\" depth pool and aquatic center was built. My kids were starting school then and we used that pool a lot.  My youngest still does. I don't know if there are any of these community pools left.  Water parks  seem to have replaced all the ones I was aware of.  They are of  another time, another era.  This pool, as many were, was a product of middle class expansion in the 1950's.  In keeping with other modern times, these pools are too simplistic, not enough wow.  I miss it now, or miss the nostalgia.  Whenever I watch the movie The Sand Lot, the scenes at the pool are my favorite. That was my pool."},
{"title": "The Bed", "date": "Monday, August 10, 2015", "text": "10Write about your last trip to a furniture store – or abouta memorable one. Was it with purpose or just browsing? Did you buy anything, ordid you leave empty handed? What store was it and why did you choose it? Ormaybe it was online shopping? Here is where to find all this weeks prompts. \"Buy something that will last,\" her mother told her.  As a recent graduate, having lived the last six years in a combination of dorm rooms, over crowded flats, and back and forth in her parents basement, she had finally moved into her first apartment of her own.  There would be no roommates and no family within 200 miles. Her budget was tight, with a student loan bill from obtaining her masters of nearly $600 a month, nearly 1/3 of her take home pay. She filled a U-haul with enough furniture, handed down from relatives, or bought second hand, to adequately set up house. There was one item she needed though, and this she had determined was going to be new and that was her bed. Too many years of sleeping on a twin mattress, never being able to feel quite like a grown up, made this want feel more like a need than anything she ever desired. She could make do without a bedroom set, having watched enough YouTube videos and DIY in those months of late night resume writing and job searching, that she felt she could update pieces and cobble together a bedroom suite with what was given to her. She planned on sleeping on an air mattress until she could locate a mattress, box spring, and bed frame. She set out the first afternoon she arrived in her new city, boxes and other furniture left where her friends had left it when they helped her unload.  Timing worked out well.  Two guy friends arranged their own road trip to only take  a slight detour to follow her as she pulled the small trailer.  In an hour, they were unloaded,  grabbed lunch, and were back on the road. She had researched and found a furniture and mattress store, a big, multi site company, within 15 miles of her apartment. With a budget of $1,000, which she didn't know was realistic or not, she headed in the door. She was immediately greeted with an eager salesperson, overly smiley, with an aggressive handshake.  She was directed towards mattresses, and was slightly relieved to learn this woman must need to stay in that section, and didn't follow her.  She passed display upon display of carefully  set up living room sets, dining rooms, and whole bedrooms that could be bought in full, and picked up and dropped in any home in America. The new graduate felt a little smug, knowing her apartment, once she was done, would have an eclectic and unique look, and not look like it was thrown up from a furniture advertisement. She found the mattresses. A less aggressive man gave her a quick overview of where different brands and types were. He let her know he was available for questions, and would check in, but she should feel free to wander and test.  The choices were staggering with pillow tops, and sleep numbers, and memory foam, multiple variations and price points. She knew she wanted a queen size, having been blessed to find an apartment in a second floor of an old large house, now converted into three apartments, one on each floor.  Hers was a one bedroom, but must have been the master when it was a single family home, nice and large with a big bay window overlooking the shared back yard.  She tested  out a few until she laid on one that was so comfortable, she fell asleep for a minute or two. She got a sock of sticker shock in her belly. Before frame, before delivery, the mattress was priced at $1,499.  Her heart dropped a little. \"That is a good selection.  Twenty year warranty, and highest customer satisfaction rating. \" said the salesman, who was more aware of her shopping than he appeared. \"and this particular set, is going to change slightly, so we are running an unadvertised special at 50% off.\" Remarkable, she thought.  She completed the paperwork, added the frame, and set up delivery for Friday of that same week.  She would have three nights to sleep in splendor before starting her new job the following Monday. She spent the week organizing the rest of her place, creating order out of the chaos.  She used a combination of Target gift cards and money saved for her move to purchases new bedding.  She laundered it, and made sure it was at peak softness for when the bed arrived.  Lacking a head board, she had found a discarded garden trellis down the street, salvaged it after asking the owners, by spray painting a mint green color, and toggled the trellis on the wall where the bed would go. It arrived relatively on schedule, the frame put together with ease. That might she was so exhausted, she didn't even have time to savor her surroundings.  With the first morning light, she slowly reached her arms out wide, first right, then left, and knew she was home."},
{"title": "Love in Blue and Gold", "date": "Sunday, August 9, 2015", "text": "9Write about your favorite blanket – or about your least favorite blanket. What does it look like? Is it soft, scratchy, warm, new or old? Is it a gift, a find, a purchase? What do you use it for? If your blanket had a voice, what story would it tell? Read more prompts and other writer's stories at the Rise and Write link.Love in Blue and GoldAs grandparents, both sets of our parents loved to attend our kids and nieces and nephews sporting events.  They were the bleacher sitters at basketball games, and brought along yard chairs for sitting on the sidelines of soccer, football, softball and baseball games in the younger years before the kids played at the high school level. Minnesota weather is unpredictable, and chilly and wet spring can last well into summer, and early fall coolness can land in August.  We also have the sweltering above 90 days as well.  Grandparents need to be prepared for all sorts of weather so besides the yard chairs, umbrellas, extra jackets, and blankets were permanent contents in their care trunks. One year for Christmas my older daughter, with the help of her younger sister, decided to make fleece tie blankets for both her grandmothers.  She decided to do them in our towns school colors of blue and gold, reversible.  If you haven't made them, even a non sewer like me can turn  5 yards of fleece into a beautiful gift since all it requires is a good eye to line up the two pieces of fleece, a strong hand to cut the fringe strips around the border, and the patience to tie the strips to bind the blanket. DD # 2 was of little help, but she was there to ask questions and tell her big sis how much she liked the blanket and she would like one too.  She later also got a smaller one made for her as well from her sister who took the less than subtle hint. Both blankets were thoroughly enjoyed by both grandmas. They came out for every sporting event, even the warm ones for extra seating on the grass if there were people without chairs.  They sat on the grandmas laps or bundles around their body on the colder days. In my mom's last couple years, it was harder to get her out of the house to go to the games. If the weather was just right, it was easier. One of the parks my younger daughter played softball at was near my mom's and I could easily push her to the game in her wheelchair, so we didn't have to worry about how close we could park, or making sure there were two adults to help get her dropped off, and then park the car.  My dad was starting to have stability issues himself. She would bring her blanket with her, riding on her lap, as I pushed her to the spectator section.  She was always so proud when she received compliments on her blanket from other grandparents to say, \"My granddaughter made it for me.\"After mom passed, the blanket sat on a ottoman next to her chair.  My dad starting using my moms recliner, both for the comfort it game him, and because it was sturdier and  easier to get in and out of by himself.  He was rarely chilly, but occasionally, he would rest the blanket on his lap as she did.  After he passed, two years later, the blanket came back to my daughter, who then gave to me.  I now carry the blanket in my trunk, and on those chilly soccer game days, it comes out to be there just in case I need to keep the cold away.  This blanket is brilliant not just because of it's warmth, softness, and team spirit, but because it holds traditions and memories of my whole family."},
{"title": "So What Am I Afraid Of?", "date": "Saturday, August 8, 2015", "text": "I am on to week two, prompt 8 of the Rise and Write  challenge. Write about fear you experienced (or are experiencing now). It can be a situation from your life, a fear of heights, of dogs, of closed small rooms or clowns… or a fear of being yourself, doing what you want to do, expressing yourself. Does your fear have a face, a voice, a smell, physical presence? Is it an abstract blob? How does it make you feel when you experience it? How does it make you feel when you look back at it? If it’s a fear you overcame, how did it happen?What am I afraid of?  Waking up and having no forms of caffeine in the house would be a nightmare to me, and I might have to send the husband on an early morning errand. Caffeine withdrawal aside, there are not too many physical things that frighten me.  I love daring theme park rides, and airplane rides, and tall buildings and bridges.  I have a healthy respect for heights, but no fear, though have no desire to jump from an airplane for fun. I love the water.  My mother who had a good fear of open water and swimming pools, made sure we all could swim adequately.  I have the cautiousness needed when walking alone or small groups in isolated areas and at night, but no fear of being alone. I sometimes am uncomfortable with small spaces, but only if there is poor air flow and no outside view,  and it seems like it will be more than 15 minutes.  It isn't really  a fear, more a physical uncomfortableness. I do experience anxiety when in certain situations that go longer than I had mentally prepared myself for.  These are mostly family gatherings and parties, or an isolated situation that whacks me in the face when I had prepared for something else. This may be an oxymoron, but I do think people can be filled with anxiety when a situation gets beyond their control, and also be spontaneous.  I like days and times when there is no set agenda, I just need to have  a certain degree of control over the spontaneity, and know I have a back-up plan to move on if it isn't working for me. This is where the family stress comes in when I am  faced with  situations that are overly controlled by someone else. I used to have a fear of being  or getting lost.  Before the age of cellphones and GPS, I carefully mapped out my routes, got directions, found landmarks. I would get so flustered if I couldn't find the right place, and tiny variation in the correct directions  confused me. Part of the change has been in technology and part has been my work and having to be here to there and a few places in between, that I just had to get over it. Loving travelling and experiencing new places was another way I have not let the fear of being lost stop me from going places I've never been, without fear that I wouldn't find my destination, or my way back. I had  a minor dose of anxiety when the bus system in Paris was shut down on half the city, and we were on the wrong half, trying to get to the train station for a 7:00 departure.  I calmed myself down though and figured we could find a cab, expensive but doable, take the next hour train, or worst case, stay a night in Paris.  We ended up taking a cab, as we had made it closer to the station with a combination of walking to just in range for the bus, and taking that bus as far as we could,  the cost was only 10 Euros. Now, I look at these minor blips in direction as good stories."},
{"title": "Before I Really Get Up...", "date": "Friday, August 7, 2015", "text": "It has been a good week of diving intot the world of prompted writing.  It is Day seven of  Rise and Write and here is my prompt from Natalia.  Write about your morning ritual. You wake up… then what usually happens? Write about how your body feels, what you think about, what you like to do, to eat or drink the first thing in the morning. It does not have to be about you. Write about your character if you prefer – What is their morning routine?Before I really get up...Rarely do I need an alarm clock to wake up.  I set one every night for 5:50, but on most mornings, weekends included, I'm wide awaken thinking about the day before the beeping thing goes off.  Sure, I eventually open my eyes, stumble into the bathroom to douse my face with cold water, and head to the kitchen to get that first cup of coffee. However, the morning  think is probably my true ritual.  I have been told by some this is a source of my anxiety.  \"You need to just get up ad get going.  You think too much therefore you worry too much.\" This was said by a friend on a recent walk after I shared some recent morning ponderings. I admit it.  On months when my husband's commissions are low, I wake up an do mathematical calculations in my head as to whether or not the funds in the check book will cover all the bills. I recalculate vacation costs, and then fret if we really can afford to go.  In the weeks leading up to Christmas, I do a running checklist in my head on who I have or haven't yet shopped for, what I purchased, and then second guess if I selected the right things. I think about my kids, their current life and their future. I get a mix of joy and apprehension because the job market, even in this improving economy, has been tough for them both.  But then, I also use this quiet reflective morning time to work out solutions to nagging and sometimes real problems.  In the dark, I can think through various scenarios and think through worst case, and often I've worked out that if worst case happened, I'd be able to deal with situation. I debrief in my head about conversations or situations, and see what could have been done differently, or what my next actions will be. Once I have decided to get up, I first do a series of stretched in my bed. I roll my ankles, my hips side to side. I draw each leg up to my chest, one at a time, and then both together. Then I find that cold water for my face, and that hot cup of java for my  mouth and soul, and I start my day. I must add though, that this past week has altered my morning.  My think time has been my Rise and Write time. It is early to think if there is a change to my outlook not having this silent time in the dark.  Perhaps that is what writing for oneself is, just thinking on paper, or on a computer, or in a cloud."},
{"title": "Little Bundles of Yum", "date": "Thursday, August 6, 2015", "text": "Here we are already at Rise and Write  6, and the writing prompt given is to write about my favorite dish as a child. Do I still remember the taste of it? The smell? The texture? Who was cooking it? What ingredients they used? Did they say anything while cooking? Where it was? How old was I?Growing up, food did not have the significance of a lifestyle as it does today.  People weren't described as foodies.  Food nourished the body, was offered to guests, and on holidays, was eaten in too large a quantities. In  stable financial times, breakfast was cold cereal, toast, or a big pot of oatmeal.  We mostly ate school lunches, or brought a simple sandwich and fruit.  Suppers were meat, potato, vegetable and white bread. Leaner times,we ate a lot more hot dishes and soups.  I should explain hot dish for those not in the Midwest.  Hot dish, not to be called casserole, was a noodle or rice base, a protein, often hamburger, leftover chicken or canned tuna, a  can or jar of something to bind it, and maybe cheese or bread crumbs on top. That was about as foodie as meals came.However, there was one food, served very rarely, that I absolutely adored.  I don't believe I have eaten one in twenty plus years, probably since the last time my mom made them before they moved into town.  She called them Corned Beef Burgers.  These were not a burger at all, but rather a kind of meat salad, put on little hamburger buns, wrapped in tin foil, and heated in the oven. I think one of my sisters knows how to make them, but they are an acquired taste, and because I only remember these being made in large quantities, the recipe probably makes more than she could find current day eaters to consume.  Really these are nothing more than canned corned beef, flaky and gelatinous, mixed with salt, pepper, relish, and a jar of Cheez Whiz.  I really typed Cheeze Whiz as a recipe ingredient. Oh how I loved the steam coming out of the little bundle when I opened the foil on my burger. The scent of the beef blended with the cheese msde my mouth would water. Corned beef burgers were associated with informal family and friend gatherings. Once cold and winter set in, it was less frequent that people would get together, but when I saw these being made, I knew the house was going to be full. A large pot of soup was also made to serve with the sandwiches and later years when mom got a bit more creative, a toned down chili, more of a hamburger, bean, and tomato soup.  That is part of the appeal for me.  These were a Saturday night food, made if my parents were having people over for cards.  My sisters on the sides of me in age didn't like them, so when we were each offered one as a treat before we were banished out of the room, I got one of theirs as well.  They were happy with potato chips we also were allowed. My brother used to say he thought my mom was a good cook until he grew up and moved out and learned there was a thing called spice in the world. It is true that my mom was a no nonsense, basic, really quite bland cook. She would have had no time with the plethora of shows on the Food Network. In her later years, she got more adventurous with what she ate out of the house, and appreciated other peoples expanded menus, but personally stuck to her staples.  Those little sandwiches though are locked in my head and in my memories, and no one since has been able to replicate the full package of the Corned Beef Burger experience."},
{"title": "The Christmas Box", "date": "Wednesday, August 5, 2015", "text": "Morning number 5 ofRise and Write has me thinking aboutkindness. Write about an act of kindness that made you look differently at whatkindness is and maybe look differently at life. What was the situation? Maybeit was in your childhood, or maybe it happened last week. Maybe you were theperson who was being kind, when someone needed it the most, and maybe did notexpect it. If nothing comes to mind, invent!With each year sincethe passing of each of my parents, some memories begin to fade, and others maybecome distorted.  Events lived by my siblings and I may each be toldthrough a different memory filter.  This may or may not have happened thisway, but it is how I remember it, or choose to remember it.  For those whohave read my posts on this or my other blog, you may recall I come from a largefamily of ten kids, me in the 9th position.  Money was probably alwaystight, and I am betting at times we were down right poor, but as a credit to myparents, we never lacked for necessities.  I don't know if my parents didor not. To give a little context, the mid to late 70’s saw two oil crisis, highunemployment peaks and a recession.  Many families were not doing well,but the go-go 90's and millennium before the last economic bubble burst, madepeople forget those years. Despite our ownfinancial reality, my family adopted another family each Christmas. This meantputting together a food basket, homemade items used to be perfectly acceptable,a gift for each of the children in the family, and a few practical things forany adults. You could also put gently used items, clothes, and dishes etc. thatwere on a wish list.  While we handed down clothes within the family, occasionallymy younger sister would get a new article of clothing. My sister got a new coatwhen it became obvious the one I used to wear was too thread bare and beyondmendable. This was a lovely coat too, red with a hood, with a light fake furtrim. She was so pleased to have been able to pick it out, and it not beingjust a cast off from an older sibling or relative. As timing would have it, acousin did pass a coat along in my sister’s size, after the red coat waspurchased, of equal or better quality and condition, but not nearly as pretty. Coincidentally,a girl’s coat, in the size my sister wore, was on the wish list. One of the twocoats was going to be given in the Christmas box, but my sister could make thechoice. The tradition ofadopting a family is completely anonymous, so I don't know why this particularChristmas we knew who the family was we had adopted. We knew the kids. Therewere four of them, and they lived generally in our rural area, riding the schoolbus with us. The two boys in the family seemed to attract the worst behaviorfrom other boys.  Now it would clearly be bullying, but unfortunately,seemed to be the norm. The two girls were quiet and mousy, and seemed to wantto be invisible. Their stop was one of the last stops on the route so the kidswere left balancing on the edge of a seat. That first Monday after Christmasvacation was done, my sister and I couldn't help looking for the kids to see ifthe girl was wearing her coat. When they got on, sure enough, she was wrappedin the warmth of the coat, fur trimmed hood and all, and also sporting whatlooked like a new scarf, hat, and mittens. The siblings too each appeared tohave new, or at least new to them, outer wear. My sister loved that coat, butknew the girl would probably love it more.I've often wonderedif I would have made the same choice.  I hope I would have, but my kindsister, who remains kind and generous as an adult, didn't even debate herdecision. Kindness to me is those on the spot decisions to do the thing thatwill make someone else’s life, day, hour, or even moment just a bit better,regardless of the inconvenience. It's not saying yes all the time to anyrequest or favor, but saying yes when it most makes a difference.Day 4 Rise and Writehas me thinking about tress.  If you want to learn more, here is where youcan find the details on the daily writing prompts at Out of the Writers Closet: Rise and Write.Writeabout a tree (or another plant) that you see from your window. What kind oftree it is? How tall it is? Does it bear fruit or berries? Is it a home tobirds or small animals? If not, could it be a home to mythical creatures? Whatwould you think of it as a child?The Climbing Tree“Idon't know much about trees, but we need one that will be big enough toclimb.\" Sam told her husband that cold February day when they were lookingout the back door over the snow covered blank canvass that would becometheir yard in less than a month. She was holding a sleeping baby while her twoyear old was running up and down the stairs and room to room, totally free fromclutter of unimportant things like furniture and stuff on tables he could knockoff. Even after they moved in, it was years before they had proper furniturefor most of the rooms, extra money and space needed for two active children.Theypurchased the house on a contract for deed, as is, 98% finished, from her sister’slaw firm who had the property in escrow after the builder went bankrupt. Therewas a chance that the family the house was originally built for, could decideto take possession again, but they only had another six months to do so. Therisk was low, as in the year and 1/2 the house sat empty, they surely had movedon to find or build a different home. Still, the couple was nervous, so waitedthe full six months before doing any real back yard work, bringing the calendarto September. Thetree imagined, if not quite visualized, turned out to be an oak tree. Many new homeowners, excited by the prospect of doing their own landscaping,picking our shrubs, and flowers, and trees, are unprepared for the addedcost.  This was the case for Sam and her husband. The oak was a tall,but skinny little thing, with branches no bigger than her children's fingers.A budget tree, still, it was well over $100, or in the reference Sam used for cost comparisonat the time, a month of diapers. They planted the tree with bone meal, and puta plastic tube, slit on the one side around the tree to keep any animals formgetting at it. Year by year that tree grew taller, and wider, and stronger.The tubing was removed. Leaves, sparse at first, began to fill in each spring, and slowly,provided shade for an early morning cup of coffee.Thebaby and two year old grew older, started school, and eventually outgrew theopportunity to climb the tree without breaking the limbs. The boy, now astrapping teen, did use a branch as a pull up bar after going for a run. Alittle sister came along, and the former baby that slept in Sam's arm, nowwould be the good big sister and sometimes sit on a blanket under the tree withthe new baby, laughing as she learned to roll over.  The tree keptgrowing, stronger and thicker.  Oneday when the third child was about seven or eight and had been playingoutside, Sam went to call her in for dinner. She had thought she was just inthe back yard with a couple neighbor kids, but didn't see her so called out hername. She heard a little giggle and then someone saying \"shhh\". Samcalled her name again, which was responded to with more giggles, then laughter.\"Look up, mom” said a voice.  Sam moved closer to the tree, andthen leaned over and turned her head up.  There was her daughter andfriend each sitting precariously on a couple of the lowest branches.  Thecanopy of lush green leaves had concealed them from first view. Sam had herclimbing tree."},
{"title": "On Going to the Dentist", "date": "Monday, August 3, 2015", "text": "3Write about your first visit to a dentist – or the most memorable one. Do you remember the dentist’s face, voice, the smell of the office? Do you remember your pain, fear, or a pleasant feeling of knowing that you are taking a good care of your teeth? You don’t have to write about yourself – write about your child’s visit, or about your character’s visit.  The prompt above is number three in the Rise and Write link up found HEREOn Going to the DentistLike many things that were routine to other families, but not so much in households where money was often tight, going to the dentist was an infrequent experience. As my dad moved through union based construction employment, and times of layoff when he then was self employed, insurance coverage probably was hit or miss. As a child, I didn't understand those kind of things. Thinking back to a particular visit when I was probably 8 or so, I went with the three other youngest girls in my family of ten kids. Sitting in the waiting room, waiting for our turn patiently,  it must have been a long time between visits. The waiting room smelled medicinal, and the chairs were sticky and hot. While not remembering each visit as an individual event, this one had to have been summer, probably August. I recall my legs sticking to the chair when I stood up. Highlights for Children magazines were on a magazine rack hanging on the wall. My sisters and I  laughed about Goofus and Gallant, and oh how dumb the comic was.There were also different women's magazines, all with beautiful slim moms with lovely baking treats being offered to some child out of the camera view. They didn't look like my mom, tired and worn after probably working a 5:00 a.m. to 1:00 p.m. shift at the coffee shop, and now dragging four kids back into town. As tired and overwhelmed as I have felt on my most tired days as a working mom, I realize now that is how my mom probably felt everyday. I'm sure one by one as each of us was in with the dentist, my mom was doing a little prayer hoping that the visit was going to be nothing more than a long overdue cleaning, and not any cavity and filling work needed. Both parents had horrible teeth, but poor dental care because of money.  In their elder years, both turned to dentures and probably had nicer teeth than they had ever experienced in their lifetimes. Not one of the four of us youngest children ever had a cavity. I am sure that was huge consolation to my mom who probably received a bit of a lecture each rare visit from the dentist for delaying regular check-ups.We would leave with each of us receiving the new toothbrush and small tube of toothpaste.  The toothpaste would be hoarded to take with on a sleep over  or an overnight 4-H event. I loved getting that toothbrush.  It made me feel like all other children, going to the dentist, getting my check-up."},
{"title": "Never a Better Bouquet", "date": "Sunday, August 2, 2015", "text": "Growing up, vases and bouquets of flowers were just not the norm.  I grew to think of them as only something for a very special occasion, or for getting my dad out of trouble. While I enjoyed and appreciated the smell, color, and the feelings that came with them, getting a bouquet was never something I pined for. I even made the error of telling my husband a few months into our marriage when he would bring the impromptu bunch home that he really didn't need to do that.  I probably didn't receive another bunch for a decade from him. The bouquets of flowers though I most remember  growing up was lilacs. Our little hobby farm had two of the four sides lined with massive and overgrown lilac bushes.  These were so dense, as small children we could create little hideaways in the centers of the bushes. We each had our own little \"houses\", and would bring out small blankets or towels to create places to sit. Big roots were chairs. We often would picnic outside of the bushes, laying a blanket out. My first bouquet in memory, though there could have been years of these before, was when Billy, the neighbor boy, picked a bunch of lilacs, with stems and placed them in a mayonnaise jar, filled with water.I don't remember the menu, but more than likely we had peanut butter and jelly sandwiches, graham crackers, Kool Aid served in bathroom size Dixie cups, and maybe a cut up apple. If it was a banner grocery week, we might have even had potato chips and  chocolate or vanilla sandwich cookies, with a creme in the middle-rarely real Oreo's. We were elegant 5, 6, and 7 year old diners, pretending to drink tea out of the Dixie cups with one pinky in the air like we had seen on the television. I do remember this time, or maybe it was another time, bringing those lilacs into the house and there they stayed until they had withered, the scent growing fainter after time. Lilacs are still my favorite flower over all, though I've a fondness for lilly's as well. We tried growing several times, but just didn't seem to get them to grow. On one of my walking routes, a whole mess of lilacs line the path. I am tempted each spring to bring along a scissors and grab a little bouquet, but of course that would be wrong.  Instead, I close my eyes, inhale deeply, and picture those carefree days of late spring from decades gone by.This post is part of Out of the Writer's Closet Rise and Write project. Visit HERE for more information.and to read other blog posts.  This is prompt 2, Write about the first bouquet of flowers you received (or gave to someone)."},
{"title": "My Morning Eyes", "date": "Saturday, August 1, 2015", "text": "It is hard for Sam to see clearly each morning.  Besides the need to wear seriously strong prescription glasses, lately what feels like layers of caked on eye sleep glue her eyes shut to the point she has to physically stretch all her facial muscles to to force the lids open.  It reminds her of having pink eye as a child, when there was a constant need for the warm wash clothe over the eyes to loosen the debris. Once open, and once the glasses, hastily thrown on the night stand right before sleep sets in, are on her face, she can see the familiar sites of her bedroom.  More often than not, the fluffy eighteen pound shitzoo-poodle mix, sensing her being awake, has got onto the bed ready to give her a good nuzzle. If not him, she sees her husband of nearly 28 years, with his morning sleep position of one pillow and and arm strewn partially over his face trying to keep the encroaching light of his face. Some mornings she wakes up and wishes her eyes could immediately be drawn out the window to some beach landscape, mountain view, or centuries old landmark, and not the dusty blinds used to block out the too bright sun.  Even if they were open, all the picture out the window would be is the next door neighbors back yard. Some day that will be here morning view.  She sighs, and rolls out of bed, focused on that first cup of coffee. This post is part of a daily Rise and Write exercise attributed to Out of the Writers Closet: Rise and Write Week1, Day 1I'm joining the Rise and Write group over at Out of the Writers Closet.  My summary of the seven themes for the week re below.  I haven't decided if I'll do just one a day, or combine a few but I like the idea of the discipline doing just one a day for  5-10 minutes might instill in my writing patterns. For the details on Natalia's Rise and Link project, visit HERE.  I've shortened the seven themes to a statement.1Write about the first thing you see when you open your eyes in the morning.2Write about the first bouquet of flowers you received (or gave to someone). 3Write about your first visit to a dentist – or the most memorable one. 4Write about a tree (or another plant) that you see from your window. 5Write about an act of kindness that made you look differently at what kindness is and maybe look differently at life. \\6Write about your favorite dish as a child. 7Write about your morning ritual."},
{"title": "A New Sort of Adventure", "date": "Friday, July 31, 2015", "text": "I began blogging a little more than a year ago.  I guess you would say my other site, A New Frame of Reference, is a lifestyle blog.  My lifestyle, slowly being redefined through less clutter, chaos, and consumerism and commercialism. With this blog, I hope to unleash my alter ego, that of creative writer.  As many young girls, I did a lot of creative writing in my teen, tweens and very young adult life.  I wrote short stories, poems, song lyrics, and attempted  a short play once. Marriage, family, work, all took over the free time but thanks to some inspiring and motivating fellow bloggers, I am getting my muse back.  Feel free to weigh in on anything you read.  I'll try tackling whatever strikes my mood, but with hopes of improving my style, phrasing, grammar, and other essential elements of good writing.  As my comments say, you are welcome, but let's keep it constructive shall we?   I'll use this blog to do my Rise and Write exercises, and some other word play. This is exciting and scary for me at the same time. I'll be turning 50 before the end of the year.  There are days I don't feel any older than that 16 year old curled up with a spiral notebook and a Bic pen scrolling out though t after thought, with a Coke by my side.  Now, it will be the corner of my living room chaise sofa and a good strong cup of coffee or glass of wine to get my juices going. Finally, I need to shout out to Natalia at her creative writing blog Out of the Writers Closet.  She has offered up her blog as a venue for writer-want- to-be's like me to share and learn from each other."}
]